return {
	config=
	{
		[1]=
		{
			id = 1,
			code = 110000,
			name = "北京市",
		},
		[2]=
		{
			id = 2,
			code = 110100,
			name = "北京市",
			city = "北京市",
		},
		[3]=
		{
			id = 3,
			code = 110101,
			name = "北京市",
			city = "北京市",
			qu = "东城区",
		},
		[4]=
		{
			id = 4,
			code = 110102,
			name = "北京市",
			city = "北京市",
			qu = "西城区",
		},
		[5]=
		{
			id = 5,
			code = 110103,
			name = "北京市",
			city = "北京市",
			qu = "崇文区",
		},
		[6]=
		{
			id = 6,
			code = 110104,
			name = "北京市",
			city = "北京市",
			qu = "宣武区",
		},
		[7]=
		{
			id = 7,
			code = 110105,
			name = "北京市",
			city = "北京市",
			qu = "朝阳区",
		},
		[8]=
		{
			id = 8,
			code = 110106,
			name = "北京市",
			city = "北京市",
			qu = "丰台区",
		},
		[9]=
		{
			id = 9,
			code = 110107,
			name = "北京市",
			city = "北京市",
			qu = "石景山区",
		},
		[10]=
		{
			id = 10,
			code = 110108,
			name = "北京市",
			city = "北京市",
			qu = "海淀区",
		},
		[11]=
		{
			id = 11,
			code = 110109,
			name = "北京市",
			city = "北京市",
			qu = "门头沟区",
		},
		[12]=
		{
			id = 12,
			code = 110111,
			name = "北京市",
			city = "北京市",
			qu = "房山区",
		},
		[13]=
		{
			id = 13,
			code = 110112,
			name = "北京市",
			city = "北京市",
			qu = "通州区",
		},
		[14]=
		{
			id = 14,
			code = 110113,
			name = "北京市",
			city = "北京市",
			qu = "顺义区",
		},
		[15]=
		{
			id = 15,
			code = 110114,
			name = "北京市",
			city = "北京市",
			qu = "昌平区",
		},
		[16]=
		{
			id = 16,
			code = 110115,
			name = "北京市",
			city = "北京市",
			qu = "大兴区",
		},
		[17]=
		{
			id = 17,
			code = 110116,
			name = "北京市",
			city = "北京市",
			qu = "怀柔区",
		},
		[18]=
		{
			id = 18,
			code = 110117,
			name = "北京市",
			city = "北京市",
			qu = "平谷区",
		},
		[19]=
		{
			id = 19,
			code = 110228,
			name = "北京市",
			city = "北京市",
			qu = "密云县",
		},
		[20]=
		{
			id = 20,
			code = 110229,
			name = "北京市",
			city = "北京市",
			qu = "延庆县",
		},
		[21]=
		{
			id = 21,
			code = 120000,
			name = "天津市",
		},
		[22]=
		{
			id = 22,
			code = 120100,
			name = "天津市",
			city = "天津市",
		},
		[23]=
		{
			id = 23,
			code = 120101,
			name = "天津市",
			city = "天津市",
			qu = "和平区",
		},
		[24]=
		{
			id = 24,
			code = 120102,
			name = "天津市",
			city = "天津市",
			qu = "河东区",
		},
		[25]=
		{
			id = 25,
			code = 120103,
			name = "天津市",
			city = "天津市",
			qu = "河西区",
		},
		[26]=
		{
			id = 26,
			code = 120104,
			name = "天津市",
			city = "天津市",
			qu = "南开区",
		},
		[27]=
		{
			id = 27,
			code = 120105,
			name = "天津市",
			city = "天津市",
			qu = "河北区",
		},
		[28]=
		{
			id = 28,
			code = 120106,
			name = "天津市",
			city = "天津市",
			qu = "红桥区",
		},
		[29]=
		{
			id = 29,
			code = 120109,
			name = "天津市",
			city = "天津市",
			qu = "滨海新区",
		},
		[30]=
		{
			id = 30,
			code = 120110,
			name = "天津市",
			city = "天津市",
			qu = "东丽区",
		},
		[31]=
		{
			id = 31,
			code = 120111,
			name = "天津市",
			city = "天津市",
			qu = "西青区",
		},
		[32]=
		{
			id = 32,
			code = 120112,
			name = "天津市",
			city = "天津市",
			qu = "津南区",
		},
		[33]=
		{
			id = 33,
			code = 120113,
			name = "天津市",
			city = "天津市",
			qu = "北辰区",
		},
		[34]=
		{
			id = 34,
			code = 120114,
			name = "天津市",
			city = "天津市",
			qu = "武清区",
		},
		[35]=
		{
			id = 35,
			code = 120115,
			name = "天津市",
			city = "天津市",
			qu = "宝坻区",
		},
		[36]=
		{
			id = 36,
			code = 120116,
			name = "天津市",
			city = "天津市",
			qu = "铁厂区",
		},
		[37]=
		{
			id = 37,
			code = 120221,
			name = "天津市",
			city = "天津市",
			qu = "宁河区",
		},
		[38]=
		{
			id = 38,
			code = 120223,
			name = "天津市",
			city = "天津市",
			qu = "静海区",
		},
		[39]=
		{
			id = 39,
			code = 120225,
			name = "天津市",
			city = "天津市",
			qu = "蓟州区",
		},
		[40]=
		{
			id = 40,
			code = 130000,
			name = "河北省",
		},
		[41]=
		{
			id = 41,
			code = 130100,
			name = "河北省",
			city = "石家庄市",
		},
		[42]=
		{
			id = 42,
			code = 130101,
			name = "河北省",
			city = "石家庄市",
			qu = "市辖区",
		},
		[43]=
		{
			id = 43,
			code = 130102,
			name = "河北省",
			city = "石家庄市",
			qu = "长安区",
		},
		[44]=
		{
			id = 44,
			code = 130104,
			name = "河北省",
			city = "石家庄市",
			qu = "桥西区",
		},
		[45]=
		{
			id = 45,
			code = 130105,
			name = "河北省",
			city = "石家庄市",
			qu = "新华区",
		},
		[46]=
		{
			id = 46,
			code = 130107,
			name = "河北省",
			city = "石家庄市",
			qu = "井陉矿区",
		},
		[47]=
		{
			id = 47,
			code = 130108,
			name = "河北省",
			city = "石家庄市",
			qu = "裕华区",
		},
		[48]=
		{
			id = 48,
			code = 130121,
			name = "河北省",
			city = "石家庄市",
			qu = "井陉县",
		},
		[49]=
		{
			id = 49,
			code = 130123,
			name = "河北省",
			city = "石家庄市",
			qu = "正定县",
		},
		[50]=
		{
			id = 50,
			code = 130124,
			name = "河北省",
			city = "石家庄市",
			qu = "栾城县",
		},
		[51]=
		{
			id = 51,
			code = 130125,
			name = "河北省",
			city = "石家庄市",
			qu = "行唐县",
		},
		[52]=
		{
			id = 52,
			code = 130126,
			name = "河北省",
			city = "石家庄市",
			qu = "灵寿县",
		},
		[53]=
		{
			id = 53,
			code = 130127,
			name = "河北省",
			city = "石家庄市",
			qu = "高邑县",
		},
		[54]=
		{
			id = 54,
			code = 130128,
			name = "河北省",
			city = "石家庄市",
			qu = "深泽县",
		},
		[55]=
		{
			id = 55,
			code = 130129,
			name = "河北省",
			city = "石家庄市",
			qu = "赞皇县",
		},
		[56]=
		{
			id = 56,
			code = 130130,
			name = "河北省",
			city = "石家庄市",
			qu = "无极县",
		},
		[57]=
		{
			id = 57,
			code = 130131,
			name = "河北省",
			city = "石家庄市",
			qu = "平山县",
		},
		[58]=
		{
			id = 58,
			code = 130132,
			name = "河北省",
			city = "石家庄市",
			qu = "元氏县",
		},
		[59]=
		{
			id = 59,
			code = 130133,
			name = "河北省",
			city = "石家庄市",
			qu = "赵县",
		},
		[60]=
		{
			id = 60,
			code = 130181,
			name = "河北省",
			city = "石家庄市",
			qu = "辛集市",
		},
		[61]=
		{
			id = 61,
			code = 130182,
			name = "河北省",
			city = "石家庄市",
			qu = "藁城市",
		},
		[62]=
		{
			id = 62,
			code = 130183,
			name = "河北省",
			city = "石家庄市",
			qu = "晋州市",
		},
		[63]=
		{
			id = 63,
			code = 130184,
			name = "河北省",
			city = "石家庄市",
			qu = "新乐市",
		},
		[64]=
		{
			id = 64,
			code = 130185,
			name = "河北省",
			city = "石家庄市",
			qu = "鹿泉市",
		},
		[65]=
		{
			id = 65,
			code = 130200,
			name = "河北省",
			city = "唐山市",
		},
		[66]=
		{
			id = 66,
			code = 130201,
			name = "河北省",
			city = "唐山市",
			qu = "市辖区",
		},
		[67]=
		{
			id = 67,
			code = 130202,
			name = "河北省",
			city = "唐山市",
			qu = "路南区",
		},
		[68]=
		{
			id = 68,
			code = 130203,
			name = "河北省",
			city = "唐山市",
			qu = "路北区",
		},
		[69]=
		{
			id = 69,
			code = 130204,
			name = "河北省",
			city = "唐山市",
			qu = "古冶区",
		},
		[70]=
		{
			id = 70,
			code = 130205,
			name = "河北省",
			city = "唐山市",
			qu = "开平区",
		},
		[71]=
		{
			id = 71,
			code = 130207,
			name = "河北省",
			city = "唐山市",
			qu = "丰南区",
		},
		[72]=
		{
			id = 72,
			code = 130208,
			name = "河北省",
			city = "唐山市",
			qu = "丰润区",
		},
		[73]=
		{
			id = 73,
			code = 130223,
			name = "河北省",
			city = "唐山市",
			qu = "滦县",
		},
		[74]=
		{
			id = 74,
			code = 130224,
			name = "河北省",
			city = "唐山市",
			qu = "滦南县",
		},
		[75]=
		{
			id = 75,
			code = 130225,
			name = "河北省",
			city = "唐山市",
			qu = "乐亭县",
		},
		[76]=
		{
			id = 76,
			code = 130227,
			name = "河北省",
			city = "唐山市",
			qu = "迁西县",
		},
		[77]=
		{
			id = 77,
			code = 130229,
			name = "河北省",
			city = "唐山市",
			qu = "玉田县",
		},
		[78]=
		{
			id = 78,
			code = 130230,
			name = "河北省",
			city = "唐山市",
			qu = "曹妃甸区",
		},
		[79]=
		{
			id = 79,
			code = 130281,
			name = "河北省",
			city = "唐山市",
			qu = "遵化市",
		},
		[80]=
		{
			id = 80,
			code = 130283,
			name = "河北省",
			city = "唐山市",
			qu = "迁安市",
		},
		[81]=
		{
			id = 81,
			code = 130300,
			name = "河北省",
			city = "秦皇岛市",
		},
		[82]=
		{
			id = 82,
			code = 130301,
			name = "河北省",
			city = "秦皇岛市",
			qu = "市辖区",
		},
		[83]=
		{
			id = 83,
			code = 130302,
			name = "河北省",
			city = "秦皇岛市",
			qu = "海港区",
		},
		[84]=
		{
			id = 84,
			code = 130303,
			name = "河北省",
			city = "秦皇岛市",
			qu = "山海关区",
		},
		[85]=
		{
			id = 85,
			code = 130304,
			name = "河北省",
			city = "秦皇岛市",
			qu = "北戴河区",
		},
		[86]=
		{
			id = 86,
			code = 130321,
			name = "河北省",
			city = "秦皇岛市",
			qu = "青龙满族自治县",
		},
		[87]=
		{
			id = 87,
			code = 130322,
			name = "河北省",
			city = "秦皇岛市",
			qu = "昌黎县",
		},
		[88]=
		{
			id = 88,
			code = 130323,
			name = "河北省",
			city = "秦皇岛市",
			qu = "抚宁区",
		},
		[89]=
		{
			id = 89,
			code = 130324,
			name = "河北省",
			city = "秦皇岛市",
			qu = "卢龙县",
		},
		[90]=
		{
			id = 90,
			code = 130400,
			name = "河北省",
			city = "邯郸市",
		},
		[91]=
		{
			id = 91,
			code = 130401,
			name = "河北省",
			city = "邯郸市",
			qu = "市辖区",
		},
		[92]=
		{
			id = 92,
			code = 130402,
			name = "河北省",
			city = "邯郸市",
			qu = "邯山区",
		},
		[93]=
		{
			id = 93,
			code = 130403,
			name = "河北省",
			city = "邯郸市",
			qu = "丛台区",
		},
		[94]=
		{
			id = 94,
			code = 130404,
			name = "河北省",
			city = "邯郸市",
			qu = "复兴区",
		},
		[95]=
		{
			id = 95,
			code = 130406,
			name = "河北省",
			city = "邯郸市",
			qu = "峰峰矿区",
		},
		[96]=
		{
			id = 96,
			code = 130421,
			name = "河北省",
			city = "邯郸市",
			qu = "邯郸县",
		},
		[97]=
		{
			id = 97,
			code = 130423,
			name = "河北省",
			city = "邯郸市",
			qu = "临漳县",
		},
		[98]=
		{
			id = 98,
			code = 130424,
			name = "河北省",
			city = "邯郸市",
			qu = "成安县",
		},
		[99]=
		{
			id = 99,
			code = 130425,
			name = "河北省",
			city = "邯郸市",
			qu = "大名县",
		},
		[100]=
		{
			id = 100,
			code = 130426,
			name = "河北省",
			city = "邯郸市",
			qu = "涉县",
		},
		[101]=
		{
			id = 101,
			code = 130427,
			name = "河北省",
			city = "邯郸市",
			qu = "磁县",
		},
		[102]=
		{
			id = 102,
			code = 130428,
			name = "河北省",
			city = "邯郸市",
			qu = "肥乡区",
		},
		[103]=
		{
			id = 103,
			code = 130429,
			name = "河北省",
			city = "邯郸市",
			qu = "永年区",
		},
		[104]=
		{
			id = 104,
			code = 130430,
			name = "河北省",
			city = "邯郸市",
			qu = "邱县",
		},
		[105]=
		{
			id = 105,
			code = 130431,
			name = "河北省",
			city = "邯郸市",
			qu = "鸡泽县",
		},
		[106]=
		{
			id = 106,
			code = 130432,
			name = "河北省",
			city = "邯郸市",
			qu = "广平县",
		},
		[107]=
		{
			id = 107,
			code = 130433,
			name = "河北省",
			city = "邯郸市",
			qu = "馆陶县",
		},
		[108]=
		{
			id = 108,
			code = 130434,
			name = "河北省",
			city = "邯郸市",
			qu = "魏县",
		},
		[109]=
		{
			id = 109,
			code = 130435,
			name = "河北省",
			city = "邯郸市",
			qu = "曲周县",
		},
		[110]=
		{
			id = 110,
			code = 130481,
			name = "河北省",
			city = "邯郸市",
			qu = "武安市",
		},
		[111]=
		{
			id = 111,
			code = 130500,
			name = "河北省",
			city = "邢台市",
		},
		[112]=
		{
			id = 112,
			code = 130501,
			name = "河北省",
			city = "邢台市",
			qu = "市辖区",
		},
		[113]=
		{
			id = 113,
			code = 130502,
			name = "河北省",
			city = "邢台市",
			qu = "桥东区",
		},
		[114]=
		{
			id = 114,
			code = 130503,
			name = "河北省",
			city = "邢台市",
			qu = "桥西区",
		},
		[115]=
		{
			id = 115,
			code = 130521,
			name = "河北省",
			city = "邢台市",
			qu = "邢台县",
		},
		[116]=
		{
			id = 116,
			code = 130522,
			name = "河北省",
			city = "邢台市",
			qu = "临城县",
		},
		[117]=
		{
			id = 117,
			code = 130523,
			name = "河北省",
			city = "邢台市",
			qu = "内丘县",
		},
		[118]=
		{
			id = 118,
			code = 130524,
			name = "河北省",
			city = "邢台市",
			qu = "柏乡县",
		},
		[119]=
		{
			id = 119,
			code = 130525,
			name = "河北省",
			city = "邢台市",
			qu = "隆尧县",
		},
		[120]=
		{
			id = 120,
			code = 130526,
			name = "河北省",
			city = "邢台市",
			qu = "任县",
		},
		[121]=
		{
			id = 121,
			code = 130527,
			name = "河北省",
			city = "邢台市",
			qu = "南和县",
		},
		[122]=
		{
			id = 122,
			code = 130528,
			name = "河北省",
			city = "邢台市",
			qu = "宁晋县",
		},
		[123]=
		{
			id = 123,
			code = 130529,
			name = "河北省",
			city = "邢台市",
			qu = "巨鹿县",
		},
		[124]=
		{
			id = 124,
			code = 130530,
			name = "河北省",
			city = "邢台市",
			qu = "新河县",
		},
		[125]=
		{
			id = 125,
			code = 130531,
			name = "河北省",
			city = "邢台市",
			qu = "广宗县",
		},
		[126]=
		{
			id = 126,
			code = 130532,
			name = "河北省",
			city = "邢台市",
			qu = "平乡县",
		},
		[127]=
		{
			id = 127,
			code = 130533,
			name = "河北省",
			city = "邢台市",
			qu = "威县",
		},
		[128]=
		{
			id = 128,
			code = 130534,
			name = "河北省",
			city = "邢台市",
			qu = "清河县",
		},
		[129]=
		{
			id = 129,
			code = 130535,
			name = "河北省",
			city = "邢台市",
			qu = "临西县",
		},
		[130]=
		{
			id = 130,
			code = 130581,
			name = "河北省",
			city = "邢台市",
			qu = "南宫市",
		},
		[131]=
		{
			id = 131,
			code = 130582,
			name = "河北省",
			city = "邢台市",
			qu = "沙河市",
		},
		[132]=
		{
			id = 132,
			code = 130600,
			name = "河北省",
			city = "保定市",
		},
		[133]=
		{
			id = 133,
			code = 130601,
			name = "河北省",
			city = "保定市",
			qu = "市辖区",
		},
		[134]=
		{
			id = 134,
			code = 130602,
			name = "河北省",
			city = "保定市",
			qu = "竞秀区",
		},
		[135]=
		{
			id = 135,
			code = 130603,
			name = "河北省",
			city = "保定市",
			qu = "莲池区",
		},
		[136]=
		{
			id = 136,
			code = 130621,
			name = "河北省",
			city = "保定市",
			qu = "满城区",
		},
		[137]=
		{
			id = 137,
			code = 130622,
			name = "河北省",
			city = "保定市",
			qu = "清苑区",
		},
		[138]=
		{
			id = 138,
			code = 130623,
			name = "河北省",
			city = "保定市",
			qu = "涞水县",
		},
		[139]=
		{
			id = 139,
			code = 130624,
			name = "河北省",
			city = "保定市",
			qu = "阜平县",
		},
		[140]=
		{
			id = 140,
			code = 130625,
			name = "河北省",
			city = "保定市",
			qu = "徐水区",
		},
		[141]=
		{
			id = 141,
			code = 130626,
			name = "河北省",
			city = "保定市",
			qu = "定兴县",
		},
		[142]=
		{
			id = 142,
			code = 130627,
			name = "河北省",
			city = "保定市",
			qu = "唐县",
		},
		[143]=
		{
			id = 143,
			code = 130628,
			name = "河北省",
			city = "保定市",
			qu = "高阳县",
		},
		[144]=
		{
			id = 144,
			code = 130629,
			name = "河北省",
			city = "保定市",
			qu = "容城县",
		},
		[145]=
		{
			id = 145,
			code = 130630,
			name = "河北省",
			city = "保定市",
			qu = "涞源县",
		},
		[146]=
		{
			id = 146,
			code = 130631,
			name = "河北省",
			city = "保定市",
			qu = "望都县",
		},
		[147]=
		{
			id = 147,
			code = 130632,
			name = "河北省",
			city = "保定市",
			qu = "安新县",
		},
		[148]=
		{
			id = 148,
			code = 130633,
			name = "河北省",
			city = "保定市",
			qu = "易县",
		},
		[149]=
		{
			id = 149,
			code = 130634,
			name = "河北省",
			city = "保定市",
			qu = "曲阳县",
		},
		[150]=
		{
			id = 150,
			code = 130635,
			name = "河北省",
			city = "保定市",
			qu = "蠡县",
		},
		[151]=
		{
			id = 151,
			code = 130636,
			name = "河北省",
			city = "保定市",
			qu = "顺平县",
		},
		[152]=
		{
			id = 152,
			code = 130637,
			name = "河北省",
			city = "保定市",
			qu = "博野县",
		},
		[153]=
		{
			id = 153,
			code = 130638,
			name = "河北省",
			city = "保定市",
			qu = "雄县",
		},
		[154]=
		{
			id = 154,
			code = 130681,
			name = "河北省",
			city = "保定市",
			qu = "涿州市",
		},
		[155]=
		{
			id = 155,
			code = 130682,
			name = "河北省",
			city = "保定市",
			qu = "定州市",
		},
		[156]=
		{
			id = 156,
			code = 130683,
			name = "河北省",
			city = "保定市",
			qu = "安国市",
		},
		[157]=
		{
			id = 157,
			code = 130684,
			name = "河北省",
			city = "保定市",
			qu = "高碑店市",
		},
		[158]=
		{
			id = 158,
			code = 130700,
			name = "河北省",
			city = "张家口市",
		},
		[159]=
		{
			id = 159,
			code = 130701,
			name = "河北省",
			city = "张家口市",
			qu = "市辖区",
		},
		[160]=
		{
			id = 160,
			code = 130702,
			name = "河北省",
			city = "张家口市",
			qu = "桥东区",
		},
		[161]=
		{
			id = 161,
			code = 130703,
			name = "河北省",
			city = "张家口市",
			qu = "桥西区",
		},
		[162]=
		{
			id = 162,
			code = 130705,
			name = "河北省",
			city = "张家口市",
			qu = "宣化区",
		},
		[163]=
		{
			id = 163,
			code = 130706,
			name = "河北省",
			city = "张家口市",
			qu = "下花园区",
		},
		[164]=
		{
			id = 164,
			code = 130722,
			name = "河北省",
			city = "张家口市",
			qu = "张北县",
		},
		[165]=
		{
			id = 165,
			code = 130723,
			name = "河北省",
			city = "张家口市",
			qu = "康保县",
		},
		[166]=
		{
			id = 166,
			code = 130724,
			name = "河北省",
			city = "张家口市",
			qu = "沽源县",
		},
		[167]=
		{
			id = 167,
			code = 130725,
			name = "河北省",
			city = "张家口市",
			qu = "尚义县",
		},
		[168]=
		{
			id = 168,
			code = 130726,
			name = "河北省",
			city = "张家口市",
			qu = "蔚县",
		},
		[169]=
		{
			id = 169,
			code = 130727,
			name = "河北省",
			city = "张家口市",
			qu = "阳原县",
		},
		[170]=
		{
			id = 170,
			code = 130728,
			name = "河北省",
			city = "张家口市",
			qu = "怀安县",
		},
		[171]=
		{
			id = 171,
			code = 130729,
			name = "河北省",
			city = "张家口市",
			qu = "万全区",
		},
		[172]=
		{
			id = 172,
			code = 130730,
			name = "河北省",
			city = "张家口市",
			qu = "怀来县",
		},
		[173]=
		{
			id = 173,
			code = 130731,
			name = "河北省",
			city = "张家口市",
			qu = "涿鹿县",
		},
		[174]=
		{
			id = 174,
			code = 130732,
			name = "河北省",
			city = "张家口市",
			qu = "赤城县",
		},
		[175]=
		{
			id = 175,
			code = 130733,
			name = "河北省",
			city = "张家口市",
			qu = "崇礼区",
		},
		[176]=
		{
			id = 176,
			code = 130800,
			name = "河北省",
			city = "承德市",
		},
		[177]=
		{
			id = 177,
			code = 130801,
			name = "河北省",
			city = "承德市",
			qu = "市辖区",
		},
		[178]=
		{
			id = 178,
			code = 130802,
			name = "河北省",
			city = "承德市",
			qu = "双桥区",
		},
		[179]=
		{
			id = 179,
			code = 130803,
			name = "河北省",
			city = "承德市",
			qu = "双滦区",
		},
		[180]=
		{
			id = 180,
			code = 130804,
			name = "河北省",
			city = "承德市",
			qu = "鹰手营子矿区",
		},
		[181]=
		{
			id = 181,
			code = 130821,
			name = "河北省",
			city = "承德市",
			qu = "承德县",
		},
		[182]=
		{
			id = 182,
			code = 130822,
			name = "河北省",
			city = "承德市",
			qu = "兴隆县",
		},
		[183]=
		{
			id = 183,
			code = 130823,
			name = "河北省",
			city = "承德市",
			qu = "平泉市",
		},
		[184]=
		{
			id = 184,
			code = 130824,
			name = "河北省",
			city = "承德市",
			qu = "滦平县",
		},
		[185]=
		{
			id = 185,
			code = 130825,
			name = "河北省",
			city = "承德市",
			qu = "隆化县",
		},
		[186]=
		{
			id = 186,
			code = 130826,
			name = "河北省",
			city = "承德市",
			qu = "丰宁满族自治县",
		},
		[187]=
		{
			id = 187,
			code = 130827,
			name = "河北省",
			city = "承德市",
			qu = "宽城满族自治县",
		},
		[188]=
		{
			id = 188,
			code = 130828,
			name = "河北省",
			city = "承德市",
			qu = "围场满族蒙古族自治县",
		},
		[189]=
		{
			id = 189,
			code = 130900,
			name = "河北省",
			city = "沧州市",
		},
		[190]=
		{
			id = 190,
			code = 130901,
			name = "河北省",
			city = "沧州市",
			qu = "市辖区",
		},
		[191]=
		{
			id = 191,
			code = 130902,
			name = "河北省",
			city = "沧州市",
			qu = "新华区",
		},
		[192]=
		{
			id = 192,
			code = 130903,
			name = "河北省",
			city = "沧州市",
			qu = "运河区",
		},
		[193]=
		{
			id = 193,
			code = 130921,
			name = "河北省",
			city = "沧州市",
			qu = "沧县",
		},
		[194]=
		{
			id = 194,
			code = 130922,
			name = "河北省",
			city = "沧州市",
			qu = "青县",
		},
		[195]=
		{
			id = 195,
			code = 130923,
			name = "河北省",
			city = "沧州市",
			qu = "东光县",
		},
		[196]=
		{
			id = 196,
			code = 130924,
			name = "河北省",
			city = "沧州市",
			qu = "海兴县",
		},
		[197]=
		{
			id = 197,
			code = 130925,
			name = "河北省",
			city = "沧州市",
			qu = "盐山县",
		},
		[198]=
		{
			id = 198,
			code = 130926,
			name = "河北省",
			city = "沧州市",
			qu = "肃宁县",
		},
		[199]=
		{
			id = 199,
			code = 130927,
			name = "河北省",
			city = "沧州市",
			qu = "南皮县",
		},
		[200]=
		{
			id = 200,
			code = 130928,
			name = "河北省",
			city = "沧州市",
			qu = "吴桥县",
		},
		[201]=
		{
			id = 201,
			code = 130929,
			name = "河北省",
			city = "沧州市",
			qu = "献县",
		},
		[202]=
		{
			id = 202,
			code = 130930,
			name = "河北省",
			city = "沧州市",
			qu = "孟村回族自治县",
		},
		[203]=
		{
			id = 203,
			code = 130981,
			name = "河北省",
			city = "沧州市",
			qu = "泊头市",
		},
		[204]=
		{
			id = 204,
			code = 130982,
			name = "河北省",
			city = "沧州市",
			qu = "任丘市",
		},
		[205]=
		{
			id = 205,
			code = 130983,
			name = "河北省",
			city = "沧州市",
			qu = "黄骅市",
		},
		[206]=
		{
			id = 206,
			code = 130984,
			name = "河北省",
			city = "沧州市",
			qu = "河间市",
		},
		[207]=
		{
			id = 207,
			code = 131000,
			name = "河北省",
			city = "廊坊市",
		},
		[208]=
		{
			id = 208,
			code = 131001,
			name = "河北省",
			city = "廊坊市",
			qu = "市辖区",
		},
		[209]=
		{
			id = 209,
			code = 131002,
			name = "河北省",
			city = "廊坊市",
			qu = "安次区",
		},
		[210]=
		{
			id = 210,
			code = 131003,
			name = "河北省",
			city = "廊坊市",
			qu = "广阳区",
		},
		[211]=
		{
			id = 211,
			code = 131022,
			name = "河北省",
			city = "廊坊市",
			qu = "固安县",
		},
		[212]=
		{
			id = 212,
			code = 131023,
			name = "河北省",
			city = "廊坊市",
			qu = "永清县",
		},
		[213]=
		{
			id = 213,
			code = 131024,
			name = "河北省",
			city = "廊坊市",
			qu = "香河县",
		},
		[214]=
		{
			id = 214,
			code = 131025,
			name = "河北省",
			city = "廊坊市",
			qu = "大城县",
		},
		[215]=
		{
			id = 215,
			code = 131026,
			name = "河北省",
			city = "廊坊市",
			qu = "文安县",
		},
		[216]=
		{
			id = 216,
			code = 131028,
			name = "河北省",
			city = "廊坊市",
			qu = "大厂回族自治县",
		},
		[217]=
		{
			id = 217,
			code = 131081,
			name = "河北省",
			city = "廊坊市",
			qu = "霸州市",
		},
		[218]=
		{
			id = 218,
			code = 131082,
			name = "河北省",
			city = "廊坊市",
			qu = "三河市",
		},
		[219]=
		{
			id = 219,
			code = 131100,
			name = "河北省",
			city = "衡水市",
		},
		[220]=
		{
			id = 220,
			code = 131101,
			name = "河北省",
			city = "衡水市",
			qu = "市辖区",
		},
		[221]=
		{
			id = 221,
			code = 131102,
			name = "河北省",
			city = "衡水市",
			qu = "桃城区",
		},
		[222]=
		{
			id = 222,
			code = 131121,
			name = "河北省",
			city = "衡水市",
			qu = "枣强县",
		},
		[223]=
		{
			id = 223,
			code = 131122,
			name = "河北省",
			city = "衡水市",
			qu = "武邑县",
		},
		[224]=
		{
			id = 224,
			code = 131123,
			name = "河北省",
			city = "衡水市",
			qu = "武强县",
		},
		[225]=
		{
			id = 225,
			code = 131124,
			name = "河北省",
			city = "衡水市",
			qu = "饶阳县",
		},
		[226]=
		{
			id = 226,
			code = 131125,
			name = "河北省",
			city = "衡水市",
			qu = "安平县",
		},
		[227]=
		{
			id = 227,
			code = 131126,
			name = "河北省",
			city = "衡水市",
			qu = "故城县",
		},
		[228]=
		{
			id = 228,
			code = 131127,
			name = "河北省",
			city = "衡水市",
			qu = "景县",
		},
		[229]=
		{
			id = 229,
			code = 131128,
			name = "河北省",
			city = "衡水市",
			qu = "阜城县",
		},
		[230]=
		{
			id = 230,
			code = 131181,
			name = "河北省",
			city = "衡水市",
			qu = "冀州区",
		},
		[231]=
		{
			id = 231,
			code = 131182,
			name = "河北省",
			city = "衡水市",
			qu = "深州市",
		},
		[232]=
		{
			id = 232,
			code = 140000,
			name = "山西省",
		},
		[233]=
		{
			id = 233,
			code = 140100,
			name = "山西省",
			city = "太原市",
		},
		[234]=
		{
			id = 234,
			code = 140101,
			name = "山西省",
			city = "太原市",
			qu = "市辖区",
		},
		[235]=
		{
			id = 235,
			code = 140105,
			name = "山西省",
			city = "太原市",
			qu = "小店区",
		},
		[236]=
		{
			id = 236,
			code = 140106,
			name = "山西省",
			city = "太原市",
			qu = "迎泽区",
		},
		[237]=
		{
			id = 237,
			code = 140107,
			name = "山西省",
			city = "太原市",
			qu = "杏花岭区",
		},
		[238]=
		{
			id = 238,
			code = 140108,
			name = "山西省",
			city = "太原市",
			qu = "尖草坪区",
		},
		[239]=
		{
			id = 239,
			code = 140109,
			name = "山西省",
			city = "太原市",
			qu = "万柏林区",
		},
		[240]=
		{
			id = 240,
			code = 140110,
			name = "山西省",
			city = "太原市",
			qu = "晋源区",
		},
		[241]=
		{
			id = 241,
			code = 140121,
			name = "山西省",
			city = "太原市",
			qu = "清徐县",
		},
		[242]=
		{
			id = 242,
			code = 140122,
			name = "山西省",
			city = "太原市",
			qu = "阳曲县",
		},
		[243]=
		{
			id = 243,
			code = 140123,
			name = "山西省",
			city = "太原市",
			qu = "娄烦县",
		},
		[244]=
		{
			id = 244,
			code = 140181,
			name = "山西省",
			city = "太原市",
			qu = "古交市",
		},
		[245]=
		{
			id = 245,
			code = 140200,
			name = "山西省",
			city = "大同市",
		},
		[246]=
		{
			id = 246,
			code = 140201,
			name = "山西省",
			city = "大同市",
			qu = "市辖区",
		},
		[247]=
		{
			id = 247,
			code = 140202,
			name = "山西省",
			city = "大同市",
			qu = "城区",
		},
		[248]=
		{
			id = 248,
			code = 140203,
			name = "山西省",
			city = "大同市",
			qu = "矿区",
		},
		[249]=
		{
			id = 249,
			code = 140211,
			name = "山西省",
			city = "大同市",
			qu = "南郊区",
		},
		[250]=
		{
			id = 250,
			code = 140212,
			name = "山西省",
			city = "大同市",
			qu = "新荣区",
		},
		[251]=
		{
			id = 251,
			code = 140221,
			name = "山西省",
			city = "大同市",
			qu = "阳高县",
		},
		[252]=
		{
			id = 252,
			code = 140222,
			name = "山西省",
			city = "大同市",
			qu = "天镇县",
		},
		[253]=
		{
			id = 253,
			code = 140223,
			name = "山西省",
			city = "大同市",
			qu = "广灵县",
		},
		[254]=
		{
			id = 254,
			code = 140224,
			name = "山西省",
			city = "大同市",
			qu = "灵丘县",
		},
		[255]=
		{
			id = 255,
			code = 140225,
			name = "山西省",
			city = "大同市",
			qu = "浑源县",
		},
		[256]=
		{
			id = 256,
			code = 140226,
			name = "山西省",
			city = "大同市",
			qu = "左云县",
		},
		[257]=
		{
			id = 257,
			code = 140227,
			name = "山西省",
			city = "大同市",
			qu = "大同县",
		},
		[258]=
		{
			id = 258,
			code = 140300,
			name = "山西省",
			city = "阳泉市",
		},
		[259]=
		{
			id = 259,
			code = 140301,
			name = "山西省",
			city = "阳泉市",
			qu = "市辖区",
		},
		[260]=
		{
			id = 260,
			code = 140302,
			name = "山西省",
			city = "阳泉市",
			qu = "城区",
		},
		[261]=
		{
			id = 261,
			code = 140303,
			name = "山西省",
			city = "阳泉市",
			qu = "矿区",
		},
		[262]=
		{
			id = 262,
			code = 140311,
			name = "山西省",
			city = "阳泉市",
			qu = "郊区",
		},
		[263]=
		{
			id = 263,
			code = 140321,
			name = "山西省",
			city = "阳泉市",
			qu = "平定县",
		},
		[264]=
		{
			id = 264,
			code = 140322,
			name = "山西省",
			city = "阳泉市",
			qu = "盂县",
		},
		[265]=
		{
			id = 265,
			code = 140400,
			name = "山西省",
			city = "长治市",
		},
		[266]=
		{
			id = 266,
			code = 140401,
			name = "山西省",
			city = "长治市",
			qu = "市辖区",
		},
		[267]=
		{
			id = 267,
			code = 140402,
			name = "山西省",
			city = "长治市",
			qu = "城区",
		},
		[268]=
		{
			id = 268,
			code = 140411,
			name = "山西省",
			city = "长治市",
			qu = "郊区",
		},
		[269]=
		{
			id = 269,
			code = 140421,
			name = "山西省",
			city = "长治市",
			qu = "长治县",
		},
		[270]=
		{
			id = 270,
			code = 140423,
			name = "山西省",
			city = "长治市",
			qu = "襄垣县",
		},
		[271]=
		{
			id = 271,
			code = 140424,
			name = "山西省",
			city = "长治市",
			qu = "屯留县",
		},
		[272]=
		{
			id = 272,
			code = 140425,
			name = "山西省",
			city = "长治市",
			qu = "平顺县",
		},
		[273]=
		{
			id = 273,
			code = 140426,
			name = "山西省",
			city = "长治市",
			qu = "黎城县",
		},
		[274]=
		{
			id = 274,
			code = 140427,
			name = "山西省",
			city = "长治市",
			qu = "壶关县",
		},
		[275]=
		{
			id = 275,
			code = 140428,
			name = "山西省",
			city = "长治市",
			qu = "长子县",
		},
		[276]=
		{
			id = 276,
			code = 140429,
			name = "山西省",
			city = "长治市",
			qu = "武乡县",
		},
		[277]=
		{
			id = 277,
			code = 140430,
			name = "山西省",
			city = "长治市",
			qu = "沁县",
		},
		[278]=
		{
			id = 278,
			code = 140431,
			name = "山西省",
			city = "长治市",
			qu = "沁源县",
		},
		[279]=
		{
			id = 279,
			code = 140481,
			name = "山西省",
			city = "长治市",
			qu = "潞城市",
		},
		[280]=
		{
			id = 280,
			code = 140500,
			name = "山西省",
			city = "晋城市",
		},
		[281]=
		{
			id = 281,
			code = 140501,
			name = "山西省",
			city = "晋城市",
			qu = "市辖区",
		},
		[282]=
		{
			id = 282,
			code = 140502,
			name = "山西省",
			city = "晋城市",
			qu = "城区",
		},
		[283]=
		{
			id = 283,
			code = 140521,
			name = "山西省",
			city = "晋城市",
			qu = "沁水县",
		},
		[284]=
		{
			id = 284,
			code = 140522,
			name = "山西省",
			city = "晋城市",
			qu = "阳城县",
		},
		[285]=
		{
			id = 285,
			code = 140524,
			name = "山西省",
			city = "晋城市",
			qu = "陵川县",
		},
		[286]=
		{
			id = 286,
			code = 140525,
			name = "山西省",
			city = "晋城市",
			qu = "泽州县",
		},
		[287]=
		{
			id = 287,
			code = 140581,
			name = "山西省",
			city = "晋城市",
			qu = "高平市",
		},
		[288]=
		{
			id = 288,
			code = 140600,
			name = "山西省",
			city = "朔州市",
		},
		[289]=
		{
			id = 289,
			code = 140601,
			name = "山西省",
			city = "朔州市",
			qu = "市辖区",
		},
		[290]=
		{
			id = 290,
			code = 140602,
			name = "山西省",
			city = "朔州市",
			qu = "朔城区",
		},
		[291]=
		{
			id = 291,
			code = 140603,
			name = "山西省",
			city = "朔州市",
			qu = "平鲁区",
		},
		[292]=
		{
			id = 292,
			code = 140621,
			name = "山西省",
			city = "朔州市",
			qu = "山阴县",
		},
		[293]=
		{
			id = 293,
			code = 140622,
			name = "山西省",
			city = "朔州市",
			qu = "应县",
		},
		[294]=
		{
			id = 294,
			code = 140623,
			name = "山西省",
			city = "朔州市",
			qu = "右玉县",
		},
		[295]=
		{
			id = 295,
			code = 140624,
			name = "山西省",
			city = "朔州市",
			qu = "怀仁县",
		},
		[296]=
		{
			id = 296,
			code = 140700,
			name = "山西省",
			city = "晋中市",
		},
		[297]=
		{
			id = 297,
			code = 140701,
			name = "山西省",
			city = "晋中市",
			qu = "市辖区",
		},
		[298]=
		{
			id = 298,
			code = 140702,
			name = "山西省",
			city = "晋中市",
			qu = "榆次区",
		},
		[299]=
		{
			id = 299,
			code = 140721,
			name = "山西省",
			city = "晋中市",
			qu = "榆社县",
		},
		[300]=
		{
			id = 300,
			code = 140722,
			name = "山西省",
			city = "晋中市",
			qu = "左权县",
		},
		[301]=
		{
			id = 301,
			code = 140723,
			name = "山西省",
			city = "晋中市",
			qu = "和顺县",
		},
		[302]=
		{
			id = 302,
			code = 140724,
			name = "山西省",
			city = "晋中市",
			qu = "昔阳县",
		},
		[303]=
		{
			id = 303,
			code = 140725,
			name = "山西省",
			city = "晋中市",
			qu = "寿阳县",
		},
		[304]=
		{
			id = 304,
			code = 140726,
			name = "山西省",
			city = "晋中市",
			qu = "太谷县",
		},
		[305]=
		{
			id = 305,
			code = 140727,
			name = "山西省",
			city = "晋中市",
			qu = "祁县",
		},
		[306]=
		{
			id = 306,
			code = 140728,
			name = "山西省",
			city = "晋中市",
			qu = "平遥县",
		},
		[307]=
		{
			id = 307,
			code = 140729,
			name = "山西省",
			city = "晋中市",
			qu = "灵石县",
		},
		[308]=
		{
			id = 308,
			code = 140781,
			name = "山西省",
			city = "晋中市",
			qu = "介休市",
		},
		[309]=
		{
			id = 309,
			code = 140800,
			name = "山西省",
			city = "运城市",
		},
		[310]=
		{
			id = 310,
			code = 140801,
			name = "山西省",
			city = "运城市",
			qu = "市辖区",
		},
		[311]=
		{
			id = 311,
			code = 140802,
			name = "山西省",
			city = "运城市",
			qu = "盐湖区",
		},
		[312]=
		{
			id = 312,
			code = 140821,
			name = "山西省",
			city = "运城市",
			qu = "临猗县",
		},
		[313]=
		{
			id = 313,
			code = 140822,
			name = "山西省",
			city = "运城市",
			qu = "万荣县",
		},
		[314]=
		{
			id = 314,
			code = 140823,
			name = "山西省",
			city = "运城市",
			qu = "闻喜县",
		},
		[315]=
		{
			id = 315,
			code = 140824,
			name = "山西省",
			city = "运城市",
			qu = "稷山县",
		},
		[316]=
		{
			id = 316,
			code = 140825,
			name = "山西省",
			city = "运城市",
			qu = "新绛县",
		},
		[317]=
		{
			id = 317,
			code = 140826,
			name = "山西省",
			city = "运城市",
			qu = "绛县",
		},
		[318]=
		{
			id = 318,
			code = 140827,
			name = "山西省",
			city = "运城市",
			qu = "垣曲县",
		},
		[319]=
		{
			id = 319,
			code = 140828,
			name = "山西省",
			city = "运城市",
			qu = "夏县",
		},
		[320]=
		{
			id = 320,
			code = 140829,
			name = "山西省",
			city = "运城市",
			qu = "平陆县",
		},
		[321]=
		{
			id = 321,
			code = 140830,
			name = "山西省",
			city = "运城市",
			qu = "芮城县",
		},
		[322]=
		{
			id = 322,
			code = 140881,
			name = "山西省",
			city = "运城市",
			qu = "永济市",
		},
		[323]=
		{
			id = 323,
			code = 140882,
			name = "山西省",
			city = "运城市",
			qu = "河津市",
		},
		[324]=
		{
			id = 324,
			code = 140900,
			name = "山西省",
			city = "忻州市",
		},
		[325]=
		{
			id = 325,
			code = 140901,
			name = "山西省",
			city = "忻州市",
			qu = "市辖区",
		},
		[326]=
		{
			id = 326,
			code = 140902,
			name = "山西省",
			city = "忻州市",
			qu = "忻府区",
		},
		[327]=
		{
			id = 327,
			code = 140921,
			name = "山西省",
			city = "忻州市",
			qu = "定襄县",
		},
		[328]=
		{
			id = 328,
			code = 140922,
			name = "山西省",
			city = "忻州市",
			qu = "五台县",
		},
		[329]=
		{
			id = 329,
			code = 140923,
			name = "山西省",
			city = "忻州市",
			qu = "代县",
		},
		[330]=
		{
			id = 330,
			code = 140924,
			name = "山西省",
			city = "忻州市",
			qu = "繁峙县",
		},
		[331]=
		{
			id = 331,
			code = 140925,
			name = "山西省",
			city = "忻州市",
			qu = "宁武县",
		},
		[332]=
		{
			id = 332,
			code = 140926,
			name = "山西省",
			city = "忻州市",
			qu = "静乐县",
		},
		[333]=
		{
			id = 333,
			code = 140927,
			name = "山西省",
			city = "忻州市",
			qu = "神池县",
		},
		[334]=
		{
			id = 334,
			code = 140928,
			name = "山西省",
			city = "忻州市",
			qu = "五寨县",
		},
		[335]=
		{
			id = 335,
			code = 140929,
			name = "山西省",
			city = "忻州市",
			qu = "岢岚县",
		},
		[336]=
		{
			id = 336,
			code = 140930,
			name = "山西省",
			city = "忻州市",
			qu = "河曲县",
		},
		[337]=
		{
			id = 337,
			code = 140931,
			name = "山西省",
			city = "忻州市",
			qu = "保德县",
		},
		[338]=
		{
			id = 338,
			code = 140932,
			name = "山西省",
			city = "忻州市",
			qu = "偏关县",
		},
		[339]=
		{
			id = 339,
			code = 140981,
			name = "山西省",
			city = "忻州市",
			qu = "原平市",
		},
		[340]=
		{
			id = 340,
			code = 141000,
			name = "山西省",
			city = "临汾市",
		},
		[341]=
		{
			id = 341,
			code = 141001,
			name = "山西省",
			city = "临汾市",
			qu = "市辖区",
		},
		[342]=
		{
			id = 342,
			code = 141002,
			name = "山西省",
			city = "临汾市",
			qu = "尧都区",
		},
		[343]=
		{
			id = 343,
			code = 141021,
			name = "山西省",
			city = "临汾市",
			qu = "曲沃县",
		},
		[344]=
		{
			id = 344,
			code = 141022,
			name = "山西省",
			city = "临汾市",
			qu = "翼城县",
		},
		[345]=
		{
			id = 345,
			code = 141023,
			name = "山西省",
			city = "临汾市",
			qu = "襄汾县",
		},
		[346]=
		{
			id = 346,
			code = 141024,
			name = "山西省",
			city = "临汾市",
			qu = "洪洞县",
		},
		[347]=
		{
			id = 347,
			code = 141025,
			name = "山西省",
			city = "临汾市",
			qu = "古县",
		},
		[348]=
		{
			id = 348,
			code = 141026,
			name = "山西省",
			city = "临汾市",
			qu = "安泽县",
		},
		[349]=
		{
			id = 349,
			code = 141027,
			name = "山西省",
			city = "临汾市",
			qu = "浮山县",
		},
		[350]=
		{
			id = 350,
			code = 141028,
			name = "山西省",
			city = "临汾市",
			qu = "吉县",
		},
		[351]=
		{
			id = 351,
			code = 141029,
			name = "山西省",
			city = "临汾市",
			qu = "乡宁县",
		},
		[352]=
		{
			id = 352,
			code = 141030,
			name = "山西省",
			city = "临汾市",
			qu = "大宁县",
		},
		[353]=
		{
			id = 353,
			code = 141031,
			name = "山西省",
			city = "临汾市",
			qu = "隰县",
		},
		[354]=
		{
			id = 354,
			code = 141032,
			name = "山西省",
			city = "临汾市",
			qu = "永和县",
		},
		[355]=
		{
			id = 355,
			code = 141033,
			name = "山西省",
			city = "临汾市",
			qu = "蒲县",
		},
		[356]=
		{
			id = 356,
			code = 141034,
			name = "山西省",
			city = "临汾市",
			qu = "汾西县",
		},
		[357]=
		{
			id = 357,
			code = 141081,
			name = "山西省",
			city = "临汾市",
			qu = "侯马市",
		},
		[358]=
		{
			id = 358,
			code = 141082,
			name = "山西省",
			city = "临汾市",
			qu = "霍州市",
		},
		[359]=
		{
			id = 359,
			code = 141100,
			name = "山西省",
			city = "吕梁市",
		},
		[360]=
		{
			id = 360,
			code = 141101,
			name = "山西省",
			city = "吕梁市",
			qu = "市辖区",
		},
		[361]=
		{
			id = 361,
			code = 141102,
			name = "山西省",
			city = "吕梁市",
			qu = "离石区",
		},
		[362]=
		{
			id = 362,
			code = 141121,
			name = "山西省",
			city = "吕梁市",
			qu = "文水县",
		},
		[363]=
		{
			id = 363,
			code = 141122,
			name = "山西省",
			city = "吕梁市",
			qu = "交城县",
		},
		[364]=
		{
			id = 364,
			code = 141123,
			name = "山西省",
			city = "吕梁市",
			qu = "兴县",
		},
		[365]=
		{
			id = 365,
			code = 141124,
			name = "山西省",
			city = "吕梁市",
			qu = "临县",
		},
		[366]=
		{
			id = 366,
			code = 141125,
			name = "山西省",
			city = "吕梁市",
			qu = "柳林县",
		},
		[367]=
		{
			id = 367,
			code = 141126,
			name = "山西省",
			city = "吕梁市",
			qu = "石楼县",
		},
		[368]=
		{
			id = 368,
			code = 141127,
			name = "山西省",
			city = "吕梁市",
			qu = "岚县",
		},
		[369]=
		{
			id = 369,
			code = 141128,
			name = "山西省",
			city = "吕梁市",
			qu = "方山县",
		},
		[370]=
		{
			id = 370,
			code = 141129,
			name = "山西省",
			city = "吕梁市",
			qu = "中阳县",
		},
		[371]=
		{
			id = 371,
			code = 141130,
			name = "山西省",
			city = "吕梁市",
			qu = "交口县",
		},
		[372]=
		{
			id = 372,
			code = 141181,
			name = "山西省",
			city = "吕梁市",
			qu = "孝义市",
		},
		[373]=
		{
			id = 373,
			code = 141182,
			name = "山西省",
			city = "吕梁市",
			qu = "汾阳市",
		},
		[374]=
		{
			id = 374,
			code = 150000,
			name = "内蒙古自治区",
		},
		[375]=
		{
			id = 375,
			code = 150100,
			name = "内蒙古自治区",
			city = "呼和浩特市",
		},
		[376]=
		{
			id = 376,
			code = 150101,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "市辖区",
		},
		[377]=
		{
			id = 377,
			code = 150102,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "新城区",
		},
		[378]=
		{
			id = 378,
			code = 150103,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "回民区",
		},
		[379]=
		{
			id = 379,
			code = 150104,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "玉泉区",
		},
		[380]=
		{
			id = 380,
			code = 150105,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "赛罕区",
		},
		[381]=
		{
			id = 381,
			code = 150121,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "土默特左旗",
		},
		[382]=
		{
			id = 382,
			code = 150122,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "托克托县",
		},
		[383]=
		{
			id = 383,
			code = 150123,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "和林格尔县",
		},
		[384]=
		{
			id = 384,
			code = 150124,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "清水河县",
		},
		[385]=
		{
			id = 385,
			code = 150125,
			name = "内蒙古自治区",
			city = "呼和浩特市",
			qu = "武川县",
		},
		[386]=
		{
			id = 386,
			code = 150200,
			name = "内蒙古自治区",
			city = "包头市",
		},
		[387]=
		{
			id = 387,
			code = 150201,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "市辖区",
		},
		[388]=
		{
			id = 388,
			code = 150202,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "东河区",
		},
		[389]=
		{
			id = 389,
			code = 150203,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "昆都仑区",
		},
		[390]=
		{
			id = 390,
			code = 150204,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "青山区",
		},
		[391]=
		{
			id = 391,
			code = 150205,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "石拐区",
		},
		[392]=
		{
			id = 392,
			code = 150206,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "白云矿区",
		},
		[393]=
		{
			id = 393,
			code = 150207,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "九原区",
		},
		[394]=
		{
			id = 394,
			code = 150221,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "土默特右旗",
		},
		[395]=
		{
			id = 395,
			code = 150222,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "固阳县",
		},
		[396]=
		{
			id = 396,
			code = 150223,
			name = "内蒙古自治区",
			city = "包头市",
			qu = "达尔罕茂明安联合旗",
		},
		[397]=
		{
			id = 397,
			code = 150300,
			name = "内蒙古自治区",
			city = "乌海市",
		},
		[398]=
		{
			id = 398,
			code = 150301,
			name = "内蒙古自治区",
			city = "乌海市",
			qu = "市辖区",
		},
		[399]=
		{
			id = 399,
			code = 150302,
			name = "内蒙古自治区",
			city = "乌海市",
			qu = "海勃湾区",
		},
		[400]=
		{
			id = 400,
			code = 150303,
			name = "内蒙古自治区",
			city = "乌海市",
			qu = "海南区",
		},
		[401]=
		{
			id = 401,
			code = 150304,
			name = "内蒙古自治区",
			city = "乌海市",
			qu = "乌达区",
		},
		[402]=
		{
			id = 402,
			code = 150400,
			name = "内蒙古自治区",
			city = "赤峰市",
		},
		[403]=
		{
			id = 403,
			code = 150401,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "市辖区",
		},
		[404]=
		{
			id = 404,
			code = 150402,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "红山区",
		},
		[405]=
		{
			id = 405,
			code = 150403,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "元宝山区",
		},
		[406]=
		{
			id = 406,
			code = 150404,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "松山区",
		},
		[407]=
		{
			id = 407,
			code = 150421,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "阿鲁科尔沁旗",
		},
		[408]=
		{
			id = 408,
			code = 150422,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "巴林左旗",
		},
		[409]=
		{
			id = 409,
			code = 150423,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "巴林右旗",
		},
		[410]=
		{
			id = 410,
			code = 150424,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "林西县",
		},
		[411]=
		{
			id = 411,
			code = 150425,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "克什克腾旗",
		},
		[412]=
		{
			id = 412,
			code = 150426,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "翁牛特旗",
		},
		[413]=
		{
			id = 413,
			code = 150428,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "喀喇沁旗",
		},
		[414]=
		{
			id = 414,
			code = 150429,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "宁城县",
		},
		[415]=
		{
			id = 415,
			code = 150430,
			name = "内蒙古自治区",
			city = "赤峰市",
			qu = "敖汉旗",
		},
		[416]=
		{
			id = 416,
			code = 150500,
			name = "内蒙古自治区",
			city = "通辽市",
		},
		[417]=
		{
			id = 417,
			code = 150501,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "市辖区",
		},
		[418]=
		{
			id = 418,
			code = 150502,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "科尔沁区",
		},
		[419]=
		{
			id = 419,
			code = 150521,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "科尔沁左翼中旗",
		},
		[420]=
		{
			id = 420,
			code = 150522,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "科尔沁左翼后旗",
		},
		[421]=
		{
			id = 421,
			code = 150523,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "开鲁县",
		},
		[422]=
		{
			id = 422,
			code = 150524,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "库伦旗",
		},
		[423]=
		{
			id = 423,
			code = 150525,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "奈曼旗",
		},
		[424]=
		{
			id = 424,
			code = 150526,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "扎鲁特旗",
		},
		[425]=
		{
			id = 425,
			code = 150581,
			name = "内蒙古自治区",
			city = "通辽市",
			qu = "霍林郭勒市",
		},
		[426]=
		{
			id = 426,
			code = 150600,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
		},
		[427]=
		{
			id = 427,
			code = 150601,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "市辖区",
		},
		[428]=
		{
			id = 428,
			code = 150602,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "东胜区",
		},
		[429]=
		{
			id = 429,
			code = 150603,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "康巴什区",
		},
		[430]=
		{
			id = 430,
			code = 150604,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "达拉特旗",
		},
		[431]=
		{
			id = 431,
			code = 150605,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "准格尔旗",
		},
		[432]=
		{
			id = 432,
			code = 150606,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "鄂托克前旗",
		},
		[433]=
		{
			id = 433,
			code = 150607,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "鄂托克旗",
		},
		[434]=
		{
			id = 434,
			code = 150608,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "杭锦旗",
		},
		[435]=
		{
			id = 435,
			code = 150609,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "乌审旗",
		},
		[436]=
		{
			id = 436,
			code = 150610,
			name = "内蒙古自治区",
			city = "鄂尔多斯市",
			qu = "伊金霍洛旗",
		},
		[437]=
		{
			id = 437,
			code = 150700,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
		},
		[438]=
		{
			id = 438,
			code = 150701,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "市辖区",
		},
		[439]=
		{
			id = 439,
			code = 150702,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "海拉尔区",
		},
		[440]=
		{
			id = 440,
			code = 150721,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "阿荣旗",
		},
		[441]=
		{
			id = 441,
			code = 150722,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "莫力达瓦达斡尔族自治旗",
		},
		[442]=
		{
			id = 442,
			code = 150723,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "鄂伦春自治旗",
		},
		[443]=
		{
			id = 443,
			code = 150724,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "鄂温克族自治旗",
		},
		[444]=
		{
			id = 444,
			code = 150725,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "陈巴尔虎旗",
		},
		[445]=
		{
			id = 445,
			code = 150726,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "新巴尔虎左旗",
		},
		[446]=
		{
			id = 446,
			code = 150727,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "新巴尔虎右旗",
		},
		[447]=
		{
			id = 447,
			code = 150781,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "满洲里市",
		},
		[448]=
		{
			id = 448,
			code = 150782,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "牙克石市",
		},
		[449]=
		{
			id = 449,
			code = 150783,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "扎兰屯市",
		},
		[450]=
		{
			id = 450,
			code = 150784,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "额尔古纳市",
		},
		[451]=
		{
			id = 451,
			code = 150785,
			name = "内蒙古自治区",
			city = "呼伦贝尔市",
			qu = "根河市",
		},
		[452]=
		{
			id = 452,
			code = 150800,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
		},
		[453]=
		{
			id = 453,
			code = 150801,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
			qu = "市辖区",
		},
		[454]=
		{
			id = 454,
			code = 150802,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
			qu = "临河区",
		},
		[455]=
		{
			id = 455,
			code = 150821,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
			qu = "五原县",
		},
		[456]=
		{
			id = 456,
			code = 150822,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
			qu = "磴口县",
		},
		[457]=
		{
			id = 457,
			code = 150823,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
			qu = "乌拉特前旗",
		},
		[458]=
		{
			id = 458,
			code = 150824,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
			qu = "乌拉特中旗",
		},
		[459]=
		{
			id = 459,
			code = 150825,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
			qu = "乌拉特后旗",
		},
		[460]=
		{
			id = 460,
			code = 150826,
			name = "内蒙古自治区",
			city = "巴彦淖尔市",
			qu = "杭锦后旗",
		},
		[461]=
		{
			id = 461,
			code = 150900,
			name = "内蒙古自治区",
			city = "乌兰察布市",
		},
		[462]=
		{
			id = 462,
			code = 150901,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "市辖区",
		},
		[463]=
		{
			id = 463,
			code = 150902,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "集宁区",
		},
		[464]=
		{
			id = 464,
			code = 150921,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "卓资县",
		},
		[465]=
		{
			id = 465,
			code = 150922,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "化德县",
		},
		[466]=
		{
			id = 466,
			code = 150923,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "商都县",
		},
		[467]=
		{
			id = 467,
			code = 150924,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "兴和县",
		},
		[468]=
		{
			id = 468,
			code = 150925,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "凉城县",
		},
		[469]=
		{
			id = 469,
			code = 150926,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "察哈尔右翼前旗",
		},
		[470]=
		{
			id = 470,
			code = 150927,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "察哈尔右翼中旗",
		},
		[471]=
		{
			id = 471,
			code = 150928,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "察哈尔右翼后旗",
		},
		[472]=
		{
			id = 472,
			code = 150929,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "四子王旗",
		},
		[473]=
		{
			id = 473,
			code = 150981,
			name = "内蒙古自治区",
			city = "乌兰察布市",
			qu = "丰镇市",
		},
		[474]=
		{
			id = 474,
			code = 152200,
			name = "内蒙古自治区",
			city = "兴安盟",
		},
		[475]=
		{
			id = 475,
			code = 152201,
			name = "内蒙古自治区",
			city = "兴安盟",
			qu = "乌兰浩特市",
		},
		[476]=
		{
			id = 476,
			code = 152202,
			name = "内蒙古自治区",
			city = "兴安盟",
			qu = "阿尔山市",
		},
		[477]=
		{
			id = 477,
			code = 152221,
			name = "内蒙古自治区",
			city = "兴安盟",
			qu = "科尔沁右翼前旗",
		},
		[478]=
		{
			id = 478,
			code = 152222,
			name = "内蒙古自治区",
			city = "兴安盟",
			qu = "科尔沁右翼中旗",
		},
		[479]=
		{
			id = 479,
			code = 152223,
			name = "内蒙古自治区",
			city = "兴安盟",
			qu = "扎赉特旗",
		},
		[480]=
		{
			id = 480,
			code = 152224,
			name = "内蒙古自治区",
			city = "兴安盟",
			qu = "突泉县",
		},
		[481]=
		{
			id = 481,
			code = 152500,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
		},
		[482]=
		{
			id = 482,
			code = 152501,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "二连浩特市",
		},
		[483]=
		{
			id = 483,
			code = 152502,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "锡林浩特市",
		},
		[484]=
		{
			id = 484,
			code = 152522,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "阿巴嘎旗",
		},
		[485]=
		{
			id = 485,
			code = 152523,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "苏尼特左旗",
		},
		[486]=
		{
			id = 486,
			code = 152524,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "苏尼特右旗",
		},
		[487]=
		{
			id = 487,
			code = 152525,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "东乌珠穆沁旗",
		},
		[488]=
		{
			id = 488,
			code = 152526,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "西乌珠穆沁旗",
		},
		[489]=
		{
			id = 489,
			code = 152527,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "太仆寺旗",
		},
		[490]=
		{
			id = 490,
			code = 152528,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "镶黄旗",
		},
		[491]=
		{
			id = 491,
			code = 152529,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "正镶白旗",
		},
		[492]=
		{
			id = 492,
			code = 152530,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "正蓝旗",
		},
		[493]=
		{
			id = 493,
			code = 152531,
			name = "内蒙古自治区",
			city = "锡林郭勒盟",
			qu = "多伦县",
		},
		[494]=
		{
			id = 494,
			code = 152900,
			name = "内蒙古自治区",
			city = "阿拉善盟",
		},
		[495]=
		{
			id = 495,
			code = 152921,
			name = "内蒙古自治区",
			city = "阿拉善盟",
			qu = "阿拉善左旗",
		},
		[496]=
		{
			id = 496,
			code = 152922,
			name = "内蒙古自治区",
			city = "阿拉善盟",
			qu = "阿拉善右旗",
		},
		[497]=
		{
			id = 497,
			code = 152923,
			name = "内蒙古自治区",
			city = "阿拉善盟",
			qu = "额济纳旗",
		},
		[498]=
		{
			id = 498,
			code = 210000,
			name = "辽宁省",
		},
		[499]=
		{
			id = 499,
			code = 210100,
			name = "辽宁省",
			city = "沈阳市",
		},
		[500]=
		{
			id = 500,
			code = 210101,
			name = "辽宁省",
			city = "沈阳市",
			qu = "市辖区",
		},
		[501]=
		{
			id = 501,
			code = 210102,
			name = "辽宁省",
			city = "沈阳市",
			qu = "和平区",
		},
		[502]=
		{
			id = 502,
			code = 210103,
			name = "辽宁省",
			city = "沈阳市",
			qu = "沈河区",
		},
		[503]=
		{
			id = 503,
			code = 210104,
			name = "辽宁省",
			city = "沈阳市",
			qu = "大东区",
		},
		[504]=
		{
			id = 504,
			code = 210105,
			name = "辽宁省",
			city = "沈阳市",
			qu = "皇姑区",
		},
		[505]=
		{
			id = 505,
			code = 210106,
			name = "辽宁省",
			city = "沈阳市",
			qu = "铁西区",
		},
		[506]=
		{
			id = 506,
			code = 210111,
			name = "辽宁省",
			city = "沈阳市",
			qu = "苏家屯区",
		},
		[507]=
		{
			id = 507,
			code = 210112,
			name = "辽宁省",
			city = "沈阳市",
			qu = "浑南区",
		},
		[508]=
		{
			id = 508,
			code = 210113,
			name = "辽宁省",
			city = "沈阳市",
			qu = "沈北新区",
		},
		[509]=
		{
			id = 509,
			code = 210114,
			name = "辽宁省",
			city = "沈阳市",
			qu = "于洪区",
		},
		[510]=
		{
			id = 510,
			code = 210122,
			name = "辽宁省",
			city = "沈阳市",
			qu = "辽中区",
		},
		[511]=
		{
			id = 511,
			code = 210123,
			name = "辽宁省",
			city = "沈阳市",
			qu = "康平县",
		},
		[512]=
		{
			id = 512,
			code = 210124,
			name = "辽宁省",
			city = "沈阳市",
			qu = "法库县",
		},
		[513]=
		{
			id = 513,
			code = 210181,
			name = "辽宁省",
			city = "沈阳市",
			qu = "新民市",
		},
		[514]=
		{
			id = 514,
			code = 210200,
			name = "辽宁省",
			city = "大连市",
		},
		[515]=
		{
			id = 515,
			code = 210201,
			name = "辽宁省",
			city = "大连市",
			qu = "市辖区",
		},
		[516]=
		{
			id = 516,
			code = 210202,
			name = "辽宁省",
			city = "大连市",
			qu = "中山区",
		},
		[517]=
		{
			id = 517,
			code = 210203,
			name = "辽宁省",
			city = "大连市",
			qu = "西岗区",
		},
		[518]=
		{
			id = 518,
			code = 210204,
			name = "辽宁省",
			city = "大连市",
			qu = "沙河口区",
		},
		[519]=
		{
			id = 519,
			code = 210211,
			name = "辽宁省",
			city = "大连市",
			qu = "甘井子区",
		},
		[520]=
		{
			id = 520,
			code = 210212,
			name = "辽宁省",
			city = "大连市",
			qu = "旅顺口区",
		},
		[521]=
		{
			id = 521,
			code = 210213,
			name = "辽宁省",
			city = "大连市",
			qu = "金州区",
		},
		[522]=
		{
			id = 522,
			code = 210224,
			name = "辽宁省",
			city = "大连市",
			qu = "长海县",
		},
		[523]=
		{
			id = 523,
			code = 210281,
			name = "辽宁省",
			city = "大连市",
			qu = "瓦房店市",
		},
		[524]=
		{
			id = 524,
			code = 210282,
			name = "辽宁省",
			city = "大连市",
			qu = "普兰店市",
		},
		[525]=
		{
			id = 525,
			code = 210283,
			name = "辽宁省",
			city = "大连市",
			qu = "庄河市",
		},
		[526]=
		{
			id = 526,
			code = 210284,
			name = "辽宁省",
			city = "大连市",
			qu = "长兴岛临港工业区",
		},
		[527]=
		{
			id = 527,
			code = 210285,
			name = "辽宁省",
			city = "大连市",
			qu = "高薪技术产业园区",
		},
		[528]=
		{
			id = 528,
			code = 210286,
			name = "辽宁省",
			city = "大连市",
			qu = "经济技术开发区",
		},
		[529]=
		{
			id = 529,
			code = 210287,
			name = "辽宁省",
			city = "大连市",
			qu = "保税区",
		},
		[530]=
		{
			id = 530,
			code = 210300,
			name = "辽宁省",
			city = "鞍山市",
		},
		[531]=
		{
			id = 531,
			code = 210301,
			name = "辽宁省",
			city = "鞍山市",
			qu = "市辖区",
		},
		[532]=
		{
			id = 532,
			code = 210302,
			name = "辽宁省",
			city = "鞍山市",
			qu = "铁东区",
		},
		[533]=
		{
			id = 533,
			code = 210303,
			name = "辽宁省",
			city = "鞍山市",
			qu = "铁西区",
		},
		[534]=
		{
			id = 534,
			code = 210304,
			name = "辽宁省",
			city = "鞍山市",
			qu = "立山区",
		},
		[535]=
		{
			id = 535,
			code = 210311,
			name = "辽宁省",
			city = "鞍山市",
			qu = "千山区",
		},
		[536]=
		{
			id = 536,
			code = 210321,
			name = "辽宁省",
			city = "鞍山市",
			qu = "台安县",
		},
		[537]=
		{
			id = 537,
			code = 210323,
			name = "辽宁省",
			city = "鞍山市",
			qu = "岫岩满族自治县",
		},
		[538]=
		{
			id = 538,
			code = 210381,
			name = "辽宁省",
			city = "鞍山市",
			qu = "海城市",
		},
		[539]=
		{
			id = 539,
			code = 210400,
			name = "辽宁省",
			city = "抚顺市",
		},
		[540]=
		{
			id = 540,
			code = 210401,
			name = "辽宁省",
			city = "抚顺市",
			qu = "市辖区",
		},
		[541]=
		{
			id = 541,
			code = 210402,
			name = "辽宁省",
			city = "抚顺市",
			qu = "新抚区",
		},
		[542]=
		{
			id = 542,
			code = 210403,
			name = "辽宁省",
			city = "抚顺市",
			qu = "东洲区",
		},
		[543]=
		{
			id = 543,
			code = 210404,
			name = "辽宁省",
			city = "抚顺市",
			qu = "望花区",
		},
		[544]=
		{
			id = 544,
			code = 210411,
			name = "辽宁省",
			city = "抚顺市",
			qu = "顺城区",
		},
		[545]=
		{
			id = 545,
			code = 210421,
			name = "辽宁省",
			city = "抚顺市",
			qu = "抚顺县",
		},
		[546]=
		{
			id = 546,
			code = 210422,
			name = "辽宁省",
			city = "抚顺市",
			qu = "新宾满族自治县",
		},
		[547]=
		{
			id = 547,
			code = 210423,
			name = "辽宁省",
			city = "抚顺市",
			qu = "清原满族自治县",
		},
		[548]=
		{
			id = 548,
			code = 210500,
			name = "辽宁省",
			city = "本溪市",
		},
		[549]=
		{
			id = 549,
			code = 210501,
			name = "辽宁省",
			city = "本溪市",
			qu = "市辖区",
		},
		[550]=
		{
			id = 550,
			code = 210502,
			name = "辽宁省",
			city = "本溪市",
			qu = "平山区",
		},
		[551]=
		{
			id = 551,
			code = 210503,
			name = "辽宁省",
			city = "本溪市",
			qu = "溪湖区",
		},
		[552]=
		{
			id = 552,
			code = 210504,
			name = "辽宁省",
			city = "本溪市",
			qu = "明山区",
		},
		[553]=
		{
			id = 553,
			code = 210505,
			name = "辽宁省",
			city = "本溪市",
			qu = "南芬区",
		},
		[554]=
		{
			id = 554,
			code = 210521,
			name = "辽宁省",
			city = "本溪市",
			qu = "本溪满族自治县",
		},
		[555]=
		{
			id = 555,
			code = 210522,
			name = "辽宁省",
			city = "本溪市",
			qu = "桓仁满族自治县",
		},
		[556]=
		{
			id = 556,
			code = 210600,
			name = "辽宁省",
			city = "丹东市",
		},
		[557]=
		{
			id = 557,
			code = 210601,
			name = "辽宁省",
			city = "丹东市",
			qu = "市辖区",
		},
		[558]=
		{
			id = 558,
			code = 210602,
			name = "辽宁省",
			city = "丹东市",
			qu = "元宝区",
		},
		[559]=
		{
			id = 559,
			code = 210603,
			name = "辽宁省",
			city = "丹东市",
			qu = "振兴区",
		},
		[560]=
		{
			id = 560,
			code = 210604,
			name = "辽宁省",
			city = "丹东市",
			qu = "振安区",
		},
		[561]=
		{
			id = 561,
			code = 210624,
			name = "辽宁省",
			city = "丹东市",
			qu = "宽甸满族自治县",
		},
		[562]=
		{
			id = 562,
			code = 210681,
			name = "辽宁省",
			city = "丹东市",
			qu = "东港市",
		},
		[563]=
		{
			id = 563,
			code = 210682,
			name = "辽宁省",
			city = "丹东市",
			qu = "凤城市",
		},
		[564]=
		{
			id = 564,
			code = 210700,
			name = "辽宁省",
			city = "锦州市",
		},
		[565]=
		{
			id = 565,
			code = 210701,
			name = "辽宁省",
			city = "锦州市",
			qu = "市辖区",
		},
		[566]=
		{
			id = 566,
			code = 210702,
			name = "辽宁省",
			city = "锦州市",
			qu = "古塔区",
		},
		[567]=
		{
			id = 567,
			code = 210703,
			name = "辽宁省",
			city = "锦州市",
			qu = "凌河区",
		},
		[568]=
		{
			id = 568,
			code = 210711,
			name = "辽宁省",
			city = "锦州市",
			qu = "太和区",
		},
		[569]=
		{
			id = 569,
			code = 210726,
			name = "辽宁省",
			city = "锦州市",
			qu = "黑山县",
		},
		[570]=
		{
			id = 570,
			code = 210727,
			name = "辽宁省",
			city = "锦州市",
			qu = "义县",
		},
		[571]=
		{
			id = 571,
			code = 210781,
			name = "辽宁省",
			city = "锦州市",
			qu = "凌海市",
		},
		[572]=
		{
			id = 572,
			code = 210782,
			name = "辽宁省",
			city = "锦州市",
			qu = "北镇市",
		},
		[573]=
		{
			id = 573,
			code = 210800,
			name = "辽宁省",
			city = "营口市",
		},
		[574]=
		{
			id = 574,
			code = 210801,
			name = "辽宁省",
			city = "营口市",
			qu = "市辖区",
		},
		[575]=
		{
			id = 575,
			code = 210802,
			name = "辽宁省",
			city = "营口市",
			qu = "站前区",
		},
		[576]=
		{
			id = 576,
			code = 210803,
			name = "辽宁省",
			city = "营口市",
			qu = "西市区",
		},
		[577]=
		{
			id = 577,
			code = 210804,
			name = "辽宁省",
			city = "营口市",
			qu = "鲅鱼圈区",
		},
		[578]=
		{
			id = 578,
			code = 210811,
			name = "辽宁省",
			city = "营口市",
			qu = "老边区",
		},
		[579]=
		{
			id = 579,
			code = 210881,
			name = "辽宁省",
			city = "营口市",
			qu = "盖州市",
		},
		[580]=
		{
			id = 580,
			code = 210882,
			name = "辽宁省",
			city = "营口市",
			qu = "大石桥市",
		},
		[581]=
		{
			id = 581,
			code = 210900,
			name = "辽宁省",
			city = "阜新市",
		},
		[582]=
		{
			id = 582,
			code = 210901,
			name = "辽宁省",
			city = "阜新市",
			qu = "市辖区",
		},
		[583]=
		{
			id = 583,
			code = 210902,
			name = "辽宁省",
			city = "阜新市",
			qu = "海州区",
		},
		[584]=
		{
			id = 584,
			code = 210903,
			name = "辽宁省",
			city = "阜新市",
			qu = "新邱区",
		},
		[585]=
		{
			id = 585,
			code = 210904,
			name = "辽宁省",
			city = "阜新市",
			qu = "太平区",
		},
		[586]=
		{
			id = 586,
			code = 210905,
			name = "辽宁省",
			city = "阜新市",
			qu = "清河门区",
		},
		[587]=
		{
			id = 587,
			code = 210911,
			name = "辽宁省",
			city = "阜新市",
			qu = "细河区",
		},
		[588]=
		{
			id = 588,
			code = 210921,
			name = "辽宁省",
			city = "阜新市",
			qu = "阜新蒙古族自治县",
		},
		[589]=
		{
			id = 589,
			code = 210922,
			name = "辽宁省",
			city = "阜新市",
			qu = "彰武县",
		},
		[590]=
		{
			id = 590,
			code = 211000,
			name = "辽宁省",
			city = "辽阳市",
		},
		[591]=
		{
			id = 591,
			code = 211001,
			name = "辽宁省",
			city = "辽阳市",
			qu = "市辖区",
		},
		[592]=
		{
			id = 592,
			code = 211002,
			name = "辽宁省",
			city = "辽阳市",
			qu = "白塔区",
		},
		[593]=
		{
			id = 593,
			code = 211003,
			name = "辽宁省",
			city = "辽阳市",
			qu = "文圣区",
		},
		[594]=
		{
			id = 594,
			code = 211004,
			name = "辽宁省",
			city = "辽阳市",
			qu = "宏伟区",
		},
		[595]=
		{
			id = 595,
			code = 211005,
			name = "辽宁省",
			city = "辽阳市",
			qu = "弓长岭区",
		},
		[596]=
		{
			id = 596,
			code = 211011,
			name = "辽宁省",
			city = "辽阳市",
			qu = "太子河区",
		},
		[597]=
		{
			id = 597,
			code = 211021,
			name = "辽宁省",
			city = "辽阳市",
			qu = "辽阳县",
		},
		[598]=
		{
			id = 598,
			code = 211081,
			name = "辽宁省",
			city = "辽阳市",
			qu = "灯塔市",
		},
		[599]=
		{
			id = 599,
			code = 211100,
			name = "辽宁省",
			city = "盘锦市",
		},
		[600]=
		{
			id = 600,
			code = 211101,
			name = "辽宁省",
			city = "盘锦市",
			qu = "市辖区",
		},
		[601]=
		{
			id = 601,
			code = 211102,
			name = "辽宁省",
			city = "盘锦市",
			qu = "双台子区",
		},
		[602]=
		{
			id = 602,
			code = 211103,
			name = "辽宁省",
			city = "盘锦市",
			qu = "兴隆台区",
		},
		[603]=
		{
			id = 603,
			code = 211121,
			name = "辽宁省",
			city = "盘锦市",
			qu = "大洼县",
		},
		[604]=
		{
			id = 604,
			code = 211122,
			name = "辽宁省",
			city = "盘锦市",
			qu = "盘山县",
		},
		[605]=
		{
			id = 605,
			code = 211200,
			name = "辽宁省",
			city = "铁岭市",
		},
		[606]=
		{
			id = 606,
			code = 211201,
			name = "辽宁省",
			city = "铁岭市",
			qu = "市辖区",
		},
		[607]=
		{
			id = 607,
			code = 211202,
			name = "辽宁省",
			city = "铁岭市",
			qu = "银州区",
		},
		[608]=
		{
			id = 608,
			code = 211204,
			name = "辽宁省",
			city = "铁岭市",
			qu = "清河区",
		},
		[609]=
		{
			id = 609,
			code = 211221,
			name = "辽宁省",
			city = "铁岭市",
			qu = "铁岭县",
		},
		[610]=
		{
			id = 610,
			code = 211223,
			name = "辽宁省",
			city = "铁岭市",
			qu = "西丰县",
		},
		[611]=
		{
			id = 611,
			code = 211224,
			name = "辽宁省",
			city = "铁岭市",
			qu = "昌图县",
		},
		[612]=
		{
			id = 612,
			code = 211281,
			name = "辽宁省",
			city = "铁岭市",
			qu = "调兵山市",
		},
		[613]=
		{
			id = 613,
			code = 211282,
			name = "辽宁省",
			city = "铁岭市",
			qu = "开原市",
		},
		[614]=
		{
			id = 614,
			code = 211300,
			name = "辽宁省",
			city = "朝阳市",
		},
		[615]=
		{
			id = 615,
			code = 211301,
			name = "辽宁省",
			city = "朝阳市",
			qu = "市辖区",
		},
		[616]=
		{
			id = 616,
			code = 211302,
			name = "辽宁省",
			city = "朝阳市",
			qu = "双塔区",
		},
		[617]=
		{
			id = 617,
			code = 211303,
			name = "辽宁省",
			city = "朝阳市",
			qu = "龙城区",
		},
		[618]=
		{
			id = 618,
			code = 211321,
			name = "辽宁省",
			city = "朝阳市",
			qu = "朝阳县",
		},
		[619]=
		{
			id = 619,
			code = 211322,
			name = "辽宁省",
			city = "朝阳市",
			qu = "建平县",
		},
		[620]=
		{
			id = 620,
			code = 211324,
			name = "辽宁省",
			city = "朝阳市",
			qu = "喀喇沁左翼蒙古族自治县",
		},
		[621]=
		{
			id = 621,
			code = 211381,
			name = "辽宁省",
			city = "朝阳市",
			qu = "北票市",
		},
		[622]=
		{
			id = 622,
			code = 211382,
			name = "辽宁省",
			city = "朝阳市",
			qu = "凌源市",
		},
		[623]=
		{
			id = 623,
			code = 211400,
			name = "辽宁省",
			city = "葫芦岛市",
		},
		[624]=
		{
			id = 624,
			code = 211401,
			name = "辽宁省",
			city = "葫芦岛市",
			qu = "市辖区",
		},
		[625]=
		{
			id = 625,
			code = 211402,
			name = "辽宁省",
			city = "葫芦岛市",
			qu = "连山区",
		},
		[626]=
		{
			id = 626,
			code = 211403,
			name = "辽宁省",
			city = "葫芦岛市",
			qu = "龙港区",
		},
		[627]=
		{
			id = 627,
			code = 211404,
			name = "辽宁省",
			city = "葫芦岛市",
			qu = "南票区",
		},
		[628]=
		{
			id = 628,
			code = 211421,
			name = "辽宁省",
			city = "葫芦岛市",
			qu = "绥中县",
		},
		[629]=
		{
			id = 629,
			code = 211422,
			name = "辽宁省",
			city = "葫芦岛市",
			qu = "建昌县",
		},
		[630]=
		{
			id = 630,
			code = 211481,
			name = "辽宁省",
			city = "葫芦岛市",
			qu = "兴城市",
		},
		[631]=
		{
			id = 631,
			code = 220000,
			name = "吉林省",
		},
		[632]=
		{
			id = 632,
			code = 220100,
			name = "吉林省",
			city = "长春市",
		},
		[633]=
		{
			id = 633,
			code = 220101,
			name = "吉林省",
			city = "长春市",
			qu = "市辖区",
		},
		[634]=
		{
			id = 634,
			code = 220102,
			name = "吉林省",
			city = "长春市",
			qu = "南关区",
		},
		[635]=
		{
			id = 635,
			code = 220103,
			name = "吉林省",
			city = "长春市",
			qu = "宽城区",
		},
		[636]=
		{
			id = 636,
			code = 220104,
			name = "吉林省",
			city = "长春市",
			qu = "朝阳区",
		},
		[637]=
		{
			id = 637,
			code = 220105,
			name = "吉林省",
			city = "长春市",
			qu = "二道区",
		},
		[638]=
		{
			id = 638,
			code = 220106,
			name = "吉林省",
			city = "长春市",
			qu = "绿园区",
		},
		[639]=
		{
			id = 639,
			code = 220112,
			name = "吉林省",
			city = "长春市",
			qu = "双阳区",
		},
		[640]=
		{
			id = 640,
			code = 220122,
			name = "吉林省",
			city = "长春市",
			qu = "农安县",
		},
		[641]=
		{
			id = 641,
			code = 220181,
			name = "吉林省",
			city = "长春市",
			qu = "九台区",
		},
		[642]=
		{
			id = 642,
			code = 220182,
			name = "吉林省",
			city = "长春市",
			qu = "榆树市",
		},
		[643]=
		{
			id = 643,
			code = 220183,
			name = "吉林省",
			city = "长春市",
			qu = "德惠市",
		},
		[644]=
		{
			id = 644,
			code = 220200,
			name = "吉林省",
			city = "吉林市",
		},
		[645]=
		{
			id = 645,
			code = 220201,
			name = "吉林省",
			city = "吉林市",
			qu = "市辖区",
		},
		[646]=
		{
			id = 646,
			code = 220202,
			name = "吉林省",
			city = "吉林市",
			qu = "昌邑区",
		},
		[647]=
		{
			id = 647,
			code = 220203,
			name = "吉林省",
			city = "吉林市",
			qu = "龙潭区",
		},
		[648]=
		{
			id = 648,
			code = 220204,
			name = "吉林省",
			city = "吉林市",
			qu = "船营区",
		},
		[649]=
		{
			id = 649,
			code = 220211,
			name = "吉林省",
			city = "吉林市",
			qu = "丰满区",
		},
		[650]=
		{
			id = 650,
			code = 220221,
			name = "吉林省",
			city = "吉林市",
			qu = "永吉县",
		},
		[651]=
		{
			id = 651,
			code = 220281,
			name = "吉林省",
			city = "吉林市",
			qu = "蛟河市",
		},
		[652]=
		{
			id = 652,
			code = 220282,
			name = "吉林省",
			city = "吉林市",
			qu = "桦甸市",
		},
		[653]=
		{
			id = 653,
			code = 220283,
			name = "吉林省",
			city = "吉林市",
			qu = "舒兰市",
		},
		[654]=
		{
			id = 654,
			code = 220284,
			name = "吉林省",
			city = "吉林市",
			qu = "磐石市",
		},
		[655]=
		{
			id = 655,
			code = 220300,
			name = "吉林省",
			city = "四平市",
		},
		[656]=
		{
			id = 656,
			code = 220301,
			name = "吉林省",
			city = "四平市",
			qu = "市辖区",
		},
		[657]=
		{
			id = 657,
			code = 220302,
			name = "吉林省",
			city = "四平市",
			qu = "铁西区",
		},
		[658]=
		{
			id = 658,
			code = 220303,
			name = "吉林省",
			city = "四平市",
			qu = "铁东区",
		},
		[659]=
		{
			id = 659,
			code = 220322,
			name = "吉林省",
			city = "四平市",
			qu = "梨树县",
		},
		[660]=
		{
			id = 660,
			code = 220323,
			name = "吉林省",
			city = "四平市",
			qu = "伊通满族自治县",
		},
		[661]=
		{
			id = 661,
			code = 220381,
			name = "吉林省",
			city = "四平市",
			qu = "双辽市",
		},
		[662]=
		{
			id = 662,
			code = 220382,
			name = "吉林省",
			city = "公主岭市",
		},
		[663]=
		{
			id = 663,
			code = 220400,
			name = "吉林省",
			city = "辽源市",
		},
		[664]=
		{
			id = 664,
			code = 220401,
			name = "吉林省",
			city = "辽源市",
			qu = "市辖区",
		},
		[665]=
		{
			id = 665,
			code = 220402,
			name = "吉林省",
			city = "辽源市",
			qu = "龙山区",
		},
		[666]=
		{
			id = 666,
			code = 220403,
			name = "吉林省",
			city = "辽源市",
			qu = "西安区",
		},
		[667]=
		{
			id = 667,
			code = 220421,
			name = "吉林省",
			city = "辽源市",
			qu = "东丰县",
		},
		[668]=
		{
			id = 668,
			code = 220422,
			name = "吉林省",
			city = "辽源市",
			qu = "东辽县",
		},
		[669]=
		{
			id = 669,
			code = 220500,
			name = "吉林省",
			city = "通化市",
		},
		[670]=
		{
			id = 670,
			code = 220501,
			name = "吉林省",
			city = "通化市",
			qu = "市辖区",
		},
		[671]=
		{
			id = 671,
			code = 220502,
			name = "吉林省",
			city = "通化市",
			qu = "东昌区",
		},
		[672]=
		{
			id = 672,
			code = 220503,
			name = "吉林省",
			city = "通化市",
			qu = "二道江区",
		},
		[673]=
		{
			id = 673,
			code = 220521,
			name = "吉林省",
			city = "通化市",
			qu = "通化县",
		},
		[674]=
		{
			id = 674,
			code = 220523,
			name = "吉林省",
			city = "通化市",
			qu = "辉南县",
		},
		[675]=
		{
			id = 675,
			code = 220524,
			name = "吉林省",
			city = "通化市",
			qu = "柳河县",
		},
		[676]=
		{
			id = 676,
			code = 220581,
			name = "吉林省",
			city = "通化市",
			qu = "集安市",
		},
		[677]=
		{
			id = 677,
			code = 220582,
			name = "吉林省",
			city = "梅河口市",
		},
		[678]=
		{
			id = 678,
			code = 220600,
			name = "吉林省",
			city = "白山市",
		},
		[679]=
		{
			id = 679,
			code = 220601,
			name = "吉林省",
			city = "白山市",
			qu = "市辖区",
		},
		[680]=
		{
			id = 680,
			code = 220602,
			name = "吉林省",
			city = "白山市",
			qu = "八道江区",
		},
		[681]=
		{
			id = 681,
			code = 220605,
			name = "吉林省",
			city = "白山市",
			qu = "江源区",
		},
		[682]=
		{
			id = 682,
			code = 220621,
			name = "吉林省",
			city = "白山市",
			qu = "抚松县",
		},
		[683]=
		{
			id = 683,
			code = 220622,
			name = "吉林省",
			city = "白山市",
			qu = "靖宇县",
		},
		[684]=
		{
			id = 684,
			code = 220623,
			name = "吉林省",
			city = "白山市",
			qu = "长白朝鲜族自治县",
		},
		[685]=
		{
			id = 685,
			code = 220681,
			name = "吉林省",
			city = "白山市",
			qu = "临江市",
		},
		[686]=
		{
			id = 686,
			code = 220700,
			name = "吉林省",
			city = "松原市",
		},
		[687]=
		{
			id = 687,
			code = 220701,
			name = "吉林省",
			city = "松原市",
			qu = "市辖区",
		},
		[688]=
		{
			id = 688,
			code = 220702,
			name = "吉林省",
			city = "松原市",
			qu = "宁江区",
		},
		[689]=
		{
			id = 689,
			code = 220721,
			name = "吉林省",
			city = "松原市",
			qu = "前郭尔罗斯蒙古族自治县",
		},
		[690]=
		{
			id = 690,
			code = 220722,
			name = "吉林省",
			city = "松原市",
			qu = "长岭县",
		},
		[691]=
		{
			id = 691,
			code = 220723,
			name = "吉林省",
			city = "松原市",
			qu = "乾安县",
		},
		[692]=
		{
			id = 692,
			code = 220724,
			name = "吉林省",
			city = "松原市",
			qu = "扶余市",
		},
		[693]=
		{
			id = 693,
			code = 220800,
			name = "吉林省",
			city = "白城市",
		},
		[694]=
		{
			id = 694,
			code = 220801,
			name = "吉林省",
			city = "白城市",
			qu = "市辖区",
		},
		[695]=
		{
			id = 695,
			code = 220802,
			name = "吉林省",
			city = "白城市",
			qu = "洮北区",
		},
		[696]=
		{
			id = 696,
			code = 220821,
			name = "吉林省",
			city = "白城市",
			qu = "镇赉县",
		},
		[697]=
		{
			id = 697,
			code = 220822,
			name = "吉林省",
			city = "白城市",
			qu = "通榆县",
		},
		[698]=
		{
			id = 698,
			code = 220881,
			name = "吉林省",
			city = "白城市",
			qu = "洮南市",
		},
		[699]=
		{
			id = 699,
			code = 220882,
			name = "吉林省",
			city = "白城市",
			qu = "大安市",
		},
		[700]=
		{
			id = 700,
			code = 222400,
			name = "吉林省",
			city = "延边朝鲜族自治州",
		},
		[701]=
		{
			id = 701,
			code = 222401,
			name = "吉林省",
			city = "延边朝鲜族自治州",
			qu = "延吉市",
		},
		[702]=
		{
			id = 702,
			code = 222402,
			name = "吉林省",
			city = "延边朝鲜族自治州",
			qu = "图们市",
		},
		[703]=
		{
			id = 703,
			code = 222403,
			name = "吉林省",
			city = "延边朝鲜族自治州",
			qu = "敦化市",
		},
		[704]=
		{
			id = 704,
			code = 222404,
			name = "吉林省",
			city = "延边朝鲜族自治州",
			qu = "珲春市",
		},
		[705]=
		{
			id = 705,
			code = 222405,
			name = "吉林省",
			city = "延边朝鲜族自治州",
			qu = "龙井市",
		},
		[706]=
		{
			id = 706,
			code = 222406,
			name = "吉林省",
			city = "延边朝鲜族自治州",
			qu = "和龙市",
		},
		[707]=
		{
			id = 707,
			code = 222424,
			name = "吉林省",
			city = "延边朝鲜族自治州",
			qu = "汪清县",
		},
		[708]=
		{
			id = 708,
			code = 222426,
			name = "吉林省",
			city = "延边朝鲜族自治州",
			qu = "安图县",
		},
		[709]=
		{
			id = 709,
			code = 222427,
			name = "吉林省",
			city = "吉林省长白山保护开发区",
			qu = "池北区",
		},
		[710]=
		{
			id = 710,
			code = 222428,
			name = "吉林省",
			city = "吉林省长白山保护开发区",
			qu = "池西区",
		},
		[711]=
		{
			id = 711,
			code = 222429,
			name = "吉林省",
			city = "吉林省长白山保护开发区",
			qu = "池南区",
		},
		[712]=
		{
			id = 712,
			code = 230000,
			name = "黑龙江省",
		},
		[713]=
		{
			id = 713,
			code = 230100,
			name = "黑龙江省",
			city = "哈尔滨市",
		},
		[714]=
		{
			id = 714,
			code = 230101,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "市辖区",
		},
		[715]=
		{
			id = 715,
			code = 230102,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "道里区",
		},
		[716]=
		{
			id = 716,
			code = 230103,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "南岗区",
		},
		[717]=
		{
			id = 717,
			code = 230104,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "道外区",
		},
		[718]=
		{
			id = 718,
			code = 230108,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "平房区",
		},
		[719]=
		{
			id = 719,
			code = 230109,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "松北区",
		},
		[720]=
		{
			id = 720,
			code = 230110,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "香坊区",
		},
		[721]=
		{
			id = 721,
			code = 230111,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "呼兰区",
		},
		[722]=
		{
			id = 722,
			code = 230112,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "阿城区",
		},
		[723]=
		{
			id = 723,
			code = 230123,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "依兰县",
		},
		[724]=
		{
			id = 724,
			code = 230124,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "方正县",
		},
		[725]=
		{
			id = 725,
			code = 230125,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "宾县",
		},
		[726]=
		{
			id = 726,
			code = 230126,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "巴彦县",
		},
		[727]=
		{
			id = 727,
			code = 230127,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "木兰县",
		},
		[728]=
		{
			id = 728,
			code = 230128,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "通河县",
		},
		[729]=
		{
			id = 729,
			code = 230129,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "延寿县",
		},
		[730]=
		{
			id = 730,
			code = 230182,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "双城市",
		},
		[731]=
		{
			id = 731,
			code = 230183,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "尚志市",
		},
		[732]=
		{
			id = 732,
			code = 230184,
			name = "黑龙江省",
			city = "哈尔滨市",
			qu = "五常市",
		},
		[733]=
		{
			id = 733,
			code = 230200,
			name = "黑龙江省",
			city = "齐齐哈尔市",
		},
		[734]=
		{
			id = 734,
			code = 230201,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "市辖区",
		},
		[735]=
		{
			id = 735,
			code = 230202,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "龙沙区",
		},
		[736]=
		{
			id = 736,
			code = 230203,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "建华区",
		},
		[737]=
		{
			id = 737,
			code = 230204,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "铁锋区",
		},
		[738]=
		{
			id = 738,
			code = 230205,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "昂昂溪区",
		},
		[739]=
		{
			id = 739,
			code = 230206,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "富拉尔基区",
		},
		[740]=
		{
			id = 740,
			code = 230207,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "碾子山区",
		},
		[741]=
		{
			id = 741,
			code = 230208,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "梅里斯达斡尔族区",
		},
		[742]=
		{
			id = 742,
			code = 230221,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "龙江县",
		},
		[743]=
		{
			id = 743,
			code = 230223,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "依安县",
		},
		[744]=
		{
			id = 744,
			code = 230224,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "泰来县",
		},
		[745]=
		{
			id = 745,
			code = 230225,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "甘南县",
		},
		[746]=
		{
			id = 746,
			code = 230227,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "富裕县",
		},
		[747]=
		{
			id = 747,
			code = 230229,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "克山县",
		},
		[748]=
		{
			id = 748,
			code = 230230,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "克东县",
		},
		[749]=
		{
			id = 749,
			code = 230231,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "拜泉县",
		},
		[750]=
		{
			id = 750,
			code = 230281,
			name = "黑龙江省",
			city = "齐齐哈尔市",
			qu = "讷河市",
		},
		[751]=
		{
			id = 751,
			code = 230300,
			name = "黑龙江省",
			city = "鸡西市",
		},
		[752]=
		{
			id = 752,
			code = 230301,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "市辖区",
		},
		[753]=
		{
			id = 753,
			code = 230302,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "鸡冠区",
		},
		[754]=
		{
			id = 754,
			code = 230303,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "恒山区",
		},
		[755]=
		{
			id = 755,
			code = 230304,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "滴道区",
		},
		[756]=
		{
			id = 756,
			code = 230305,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "梨树区",
		},
		[757]=
		{
			id = 757,
			code = 230306,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "城子河区",
		},
		[758]=
		{
			id = 758,
			code = 230307,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "麻山区",
		},
		[759]=
		{
			id = 759,
			code = 230321,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "鸡东县",
		},
		[760]=
		{
			id = 760,
			code = 230381,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "虎林市",
		},
		[761]=
		{
			id = 761,
			code = 230382,
			name = "黑龙江省",
			city = "鸡西市",
			qu = "密山市",
		},
		[762]=
		{
			id = 762,
			code = 230400,
			name = "黑龙江省",
			city = "鹤岗市",
		},
		[763]=
		{
			id = 763,
			code = 230401,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "市辖区",
		},
		[764]=
		{
			id = 764,
			code = 230402,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "向阳区",
		},
		[765]=
		{
			id = 765,
			code = 230403,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "工农区",
		},
		[766]=
		{
			id = 766,
			code = 230404,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "南山区",
		},
		[767]=
		{
			id = 767,
			code = 230405,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "兴安区",
		},
		[768]=
		{
			id = 768,
			code = 230406,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "东山区",
		},
		[769]=
		{
			id = 769,
			code = 230407,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "兴山区",
		},
		[770]=
		{
			id = 770,
			code = 230421,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "萝北县",
		},
		[771]=
		{
			id = 771,
			code = 230422,
			name = "黑龙江省",
			city = "鹤岗市",
			qu = "绥滨县",
		},
		[772]=
		{
			id = 772,
			code = 230500,
			name = "黑龙江省",
			city = "双鸭山市",
		},
		[773]=
		{
			id = 773,
			code = 230501,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "市辖区",
		},
		[774]=
		{
			id = 774,
			code = 230502,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "尖山区",
		},
		[775]=
		{
			id = 775,
			code = 230503,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "岭东区",
		},
		[776]=
		{
			id = 776,
			code = 230505,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "四方台区",
		},
		[777]=
		{
			id = 777,
			code = 230506,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "宝山区",
		},
		[778]=
		{
			id = 778,
			code = 230521,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "集贤县",
		},
		[779]=
		{
			id = 779,
			code = 230522,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "友谊县",
		},
		[780]=
		{
			id = 780,
			code = 230523,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "宝清县",
		},
		[781]=
		{
			id = 781,
			code = 230524,
			name = "黑龙江省",
			city = "双鸭山市",
			qu = "饶河县",
		},
		[782]=
		{
			id = 782,
			code = 230600,
			name = "黑龙江省",
			city = "大庆市",
		},
		[783]=
		{
			id = 783,
			code = 230601,
			name = "黑龙江省",
			city = "大庆市",
			qu = "市辖区",
		},
		[784]=
		{
			id = 784,
			code = 230602,
			name = "黑龙江省",
			city = "大庆市",
			qu = "萨尔图区",
		},
		[785]=
		{
			id = 785,
			code = 230603,
			name = "黑龙江省",
			city = "大庆市",
			qu = "龙凤区",
		},
		[786]=
		{
			id = 786,
			code = 230604,
			name = "黑龙江省",
			city = "大庆市",
			qu = "让胡路区",
		},
		[787]=
		{
			id = 787,
			code = 230605,
			name = "黑龙江省",
			city = "大庆市",
			qu = "红岗区",
		},
		[788]=
		{
			id = 788,
			code = 230606,
			name = "黑龙江省",
			city = "大庆市",
			qu = "大同区",
		},
		[789]=
		{
			id = 789,
			code = 230621,
			name = "黑龙江省",
			city = "大庆市",
			qu = "肇州县",
		},
		[790]=
		{
			id = 790,
			code = 230622,
			name = "黑龙江省",
			city = "大庆市",
			qu = "肇源县",
		},
		[791]=
		{
			id = 791,
			code = 230623,
			name = "黑龙江省",
			city = "大庆市",
			qu = "林甸县",
		},
		[792]=
		{
			id = 792,
			code = 230624,
			name = "黑龙江省",
			city = "大庆市",
			qu = "杜尔伯特蒙古族自治县",
		},
		[793]=
		{
			id = 793,
			code = 230700,
			name = "黑龙江省",
			city = "伊春市",
		},
		[794]=
		{
			id = 794,
			code = 230701,
			name = "黑龙江省",
			city = "伊春市",
			qu = "市辖区",
		},
		[795]=
		{
			id = 795,
			code = 230702,
			name = "黑龙江省",
			city = "伊春市",
			qu = "伊春区",
		},
		[796]=
		{
			id = 796,
			code = 230703,
			name = "黑龙江省",
			city = "伊春市",
			qu = "南岔区",
		},
		[797]=
		{
			id = 797,
			code = 230704,
			name = "黑龙江省",
			city = "伊春市",
			qu = "友好区",
		},
		[798]=
		{
			id = 798,
			code = 230705,
			name = "黑龙江省",
			city = "伊春市",
			qu = "西林区",
		},
		[799]=
		{
			id = 799,
			code = 230706,
			name = "黑龙江省",
			city = "伊春市",
			qu = "翠峦区",
		},
		[800]=
		{
			id = 800,
			code = 230707,
			name = "黑龙江省",
			city = "伊春市",
			qu = "新青区",
		},
		[801]=
		{
			id = 801,
			code = 230708,
			name = "黑龙江省",
			city = "伊春市",
			qu = "美溪区",
		},
		[802]=
		{
			id = 802,
			code = 230709,
			name = "黑龙江省",
			city = "伊春市",
			qu = "金山屯区",
		},
		[803]=
		{
			id = 803,
			code = 230710,
			name = "黑龙江省",
			city = "伊春市",
			qu = "五营区",
		},
		[804]=
		{
			id = 804,
			code = 230711,
			name = "黑龙江省",
			city = "伊春市",
			qu = "乌马河区",
		},
		[805]=
		{
			id = 805,
			code = 230712,
			name = "黑龙江省",
			city = "伊春市",
			qu = "汤旺河区",
		},
		[806]=
		{
			id = 806,
			code = 230713,
			name = "黑龙江省",
			city = "伊春市",
			qu = "带岭区",
		},
		[807]=
		{
			id = 807,
			code = 230714,
			name = "黑龙江省",
			city = "伊春市",
			qu = "乌伊岭区",
		},
		[808]=
		{
			id = 808,
			code = 230715,
			name = "黑龙江省",
			city = "伊春市",
			qu = "红星区",
		},
		[809]=
		{
			id = 809,
			code = 230716,
			name = "黑龙江省",
			city = "伊春市",
			qu = "上甘岭区",
		},
		[810]=
		{
			id = 810,
			code = 230722,
			name = "黑龙江省",
			city = "伊春市",
			qu = "嘉荫县",
		},
		[811]=
		{
			id = 811,
			code = 230781,
			name = "黑龙江省",
			city = "伊春市",
			qu = "铁力市",
		},
		[812]=
		{
			id = 812,
			code = 230800,
			name = "黑龙江省",
			city = "佳木斯市",
		},
		[813]=
		{
			id = 813,
			code = 230801,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "市辖区",
		},
		[814]=
		{
			id = 814,
			code = 230803,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "向阳区",
		},
		[815]=
		{
			id = 815,
			code = 230804,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "前进区",
		},
		[816]=
		{
			id = 816,
			code = 230805,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "东风区",
		},
		[817]=
		{
			id = 817,
			code = 230811,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "永红区",
		},
		[818]=
		{
			id = 818,
			code = 230822,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "桦南县",
		},
		[819]=
		{
			id = 819,
			code = 230826,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "桦川县",
		},
		[820]=
		{
			id = 820,
			code = 230828,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "汤原县",
		},
		[821]=
		{
			id = 821,
			code = 230833,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "抚远市",
		},
		[822]=
		{
			id = 822,
			code = 230881,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "同江市",
		},
		[823]=
		{
			id = 823,
			code = 230882,
			name = "黑龙江省",
			city = "佳木斯市",
			qu = "富锦市",
		},
		[824]=
		{
			id = 824,
			code = 230900,
			name = "黑龙江省",
			city = "七台河市",
		},
		[825]=
		{
			id = 825,
			code = 230901,
			name = "黑龙江省",
			city = "七台河市",
			qu = "市辖区",
		},
		[826]=
		{
			id = 826,
			code = 230902,
			name = "黑龙江省",
			city = "七台河市",
			qu = "新兴区",
		},
		[827]=
		{
			id = 827,
			code = 230903,
			name = "黑龙江省",
			city = "七台河市",
			qu = "桃山区",
		},
		[828]=
		{
			id = 828,
			code = 230904,
			name = "黑龙江省",
			city = "七台河市",
			qu = "茄子河区",
		},
		[829]=
		{
			id = 829,
			code = 230921,
			name = "黑龙江省",
			city = "七台河市",
			qu = "勃利县",
		},
		[830]=
		{
			id = 830,
			code = 230922,
			name = "黑龙江省",
			city = "七台河市",
			qu = "金沙新区",
		},
		[831]=
		{
			id = 831,
			code = 231000,
			name = "黑龙江省",
			city = "牡丹江市",
		},
		[832]=
		{
			id = 832,
			code = 231001,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "市辖区",
		},
		[833]=
		{
			id = 833,
			code = 231002,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "东安区",
		},
		[834]=
		{
			id = 834,
			code = 231003,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "阳明区",
		},
		[835]=
		{
			id = 835,
			code = 231004,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "爱民区",
		},
		[836]=
		{
			id = 836,
			code = 231005,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "西安区",
		},
		[837]=
		{
			id = 837,
			code = 231024,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "东宁市",
		},
		[838]=
		{
			id = 838,
			code = 231025,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "林口县",
		},
		[839]=
		{
			id = 839,
			code = 231081,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "绥芬河市",
		},
		[840]=
		{
			id = 840,
			code = 231083,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "海林市",
		},
		[841]=
		{
			id = 841,
			code = 231084,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "宁安市",
		},
		[842]=
		{
			id = 842,
			code = 231085,
			name = "黑龙江省",
			city = "牡丹江市",
			qu = "穆棱市",
		},
		[843]=
		{
			id = 843,
			code = 231100,
			name = "黑龙江省",
			city = "黑河市",
		},
		[844]=
		{
			id = 844,
			code = 231101,
			name = "黑龙江省",
			city = "黑河市",
			qu = "市辖区",
		},
		[845]=
		{
			id = 845,
			code = 231102,
			name = "黑龙江省",
			city = "黑河市",
			qu = "爱辉区",
		},
		[846]=
		{
			id = 846,
			code = 231121,
			name = "黑龙江省",
			city = "黑河市",
			qu = "嫩江县",
		},
		[847]=
		{
			id = 847,
			code = 231123,
			name = "黑龙江省",
			city = "黑河市",
			qu = "逊克县",
		},
		[848]=
		{
			id = 848,
			code = 231124,
			name = "黑龙江省",
			city = "黑河市",
			qu = "孙吴县",
		},
		[849]=
		{
			id = 849,
			code = 231181,
			name = "黑龙江省",
			city = "黑河市",
			qu = "北安市",
		},
		[850]=
		{
			id = 850,
			code = 231182,
			name = "黑龙江省",
			city = "黑河市",
			qu = "五大连池市",
		},
		[851]=
		{
			id = 851,
			code = 231200,
			name = "黑龙江省",
			city = "绥化市",
		},
		[852]=
		{
			id = 852,
			code = 231201,
			name = "黑龙江省",
			city = "绥化市",
			qu = "市辖区",
		},
		[853]=
		{
			id = 853,
			code = 231202,
			name = "黑龙江省",
			city = "绥化市",
			qu = "北林区",
		},
		[854]=
		{
			id = 854,
			code = 231221,
			name = "黑龙江省",
			city = "绥化市",
			qu = "望奎县",
		},
		[855]=
		{
			id = 855,
			code = 231222,
			name = "黑龙江省",
			city = "绥化市",
			qu = "兰西县",
		},
		[856]=
		{
			id = 856,
			code = 231223,
			name = "黑龙江省",
			city = "绥化市",
			qu = "青冈县",
		},
		[857]=
		{
			id = 857,
			code = 231224,
			name = "黑龙江省",
			city = "绥化市",
			qu = "庆安县",
		},
		[858]=
		{
			id = 858,
			code = 231225,
			name = "黑龙江省",
			city = "绥化市",
			qu = "明水县",
		},
		[859]=
		{
			id = 859,
			code = 231226,
			name = "黑龙江省",
			city = "绥化市",
			qu = "绥棱县",
		},
		[860]=
		{
			id = 860,
			code = 231281,
			name = "黑龙江省",
			city = "绥化市",
			qu = "安达市",
		},
		[861]=
		{
			id = 861,
			code = 231282,
			name = "黑龙江省",
			city = "绥化市",
			qu = "肇东市",
		},
		[862]=
		{
			id = 862,
			code = 231283,
			name = "黑龙江省",
			city = "绥化市",
			qu = "海伦市",
		},
		[863]=
		{
			id = 863,
			code = 232700,
			name = "黑龙江省",
			city = "大兴安岭地区",
		},
		[864]=
		{
			id = 864,
			code = 232701,
			name = "黑龙江省",
			city = "大兴安岭地区",
			qu = "加格达奇区",
		},
		[865]=
		{
			id = 865,
			code = 232702,
			name = "黑龙江省",
			city = "大兴安岭地区",
			qu = "松岭区",
		},
		[866]=
		{
			id = 866,
			code = 232703,
			name = "黑龙江省",
			city = "大兴安岭地区",
			qu = "新林区",
		},
		[867]=
		{
			id = 867,
			code = 232704,
			name = "黑龙江省",
			city = "大兴安岭地区",
			qu = "呼中区",
		},
		[868]=
		{
			id = 868,
			code = 232721,
			name = "黑龙江省",
			city = "大兴安岭地区",
			qu = "呼玛县",
		},
		[869]=
		{
			id = 869,
			code = 232722,
			name = "黑龙江省",
			city = "大兴安岭地区",
			qu = "塔河县",
		},
		[870]=
		{
			id = 870,
			code = 232723,
			name = "黑龙江省",
			city = "大兴安岭地区",
			qu = "漠河县",
		},
		[871]=
		{
			id = 871,
			code = 310000,
			name = "上海市",
		},
		[872]=
		{
			id = 872,
			code = 310100,
			name = "上海市",
			city = "上海市",
		},
		[873]=
		{
			id = 873,
			code = 310101,
			name = "上海市",
			city = "上海市",
			qu = "黄浦区",
		},
		[874]=
		{
			id = 874,
			code = 310104,
			name = "上海市",
			city = "上海市",
			qu = "徐汇区",
		},
		[875]=
		{
			id = 875,
			code = 310105,
			name = "上海市",
			city = "上海市",
			qu = "长宁区",
		},
		[876]=
		{
			id = 876,
			code = 310106,
			name = "上海市",
			city = "上海市",
			qu = "静安区",
		},
		[877]=
		{
			id = 877,
			code = 310107,
			name = "上海市",
			city = "上海市",
			qu = "普陀区",
		},
		[878]=
		{
			id = 878,
			code = 310109,
			name = "上海市",
			city = "上海市",
			qu = "虹口区",
		},
		[879]=
		{
			id = 879,
			code = 310110,
			name = "上海市",
			city = "上海市",
			qu = "杨浦区",
		},
		[880]=
		{
			id = 880,
			code = 310112,
			name = "上海市",
			city = "上海市",
			qu = "闵行区",
		},
		[881]=
		{
			id = 881,
			code = 310113,
			name = "上海市",
			city = "上海市",
			qu = "宝山区",
		},
		[882]=
		{
			id = 882,
			code = 310114,
			name = "上海市",
			city = "上海市",
			qu = "嘉定区",
		},
		[883]=
		{
			id = 883,
			code = 310115,
			name = "上海市",
			city = "上海市",
			qu = "浦东新区",
		},
		[884]=
		{
			id = 884,
			code = 310116,
			name = "上海市",
			city = "上海市",
			qu = "金山区",
		},
		[885]=
		{
			id = 885,
			code = 310117,
			name = "上海市",
			city = "上海市",
			qu = "松江区",
		},
		[886]=
		{
			id = 886,
			code = 310118,
			name = "上海市",
			city = "上海市",
			qu = "青浦区",
		},
		[887]=
		{
			id = 887,
			code = 310120,
			name = "上海市",
			city = "上海市",
			qu = "奉贤区",
		},
		[888]=
		{
			id = 888,
			code = 310230,
			name = "上海市",
			city = "上海市",
			qu = "崇明区",
		},
		[889]=
		{
			id = 889,
			code = 320000,
			name = "江苏省",
		},
		[890]=
		{
			id = 890,
			code = 320100,
			name = "江苏省",
			city = "南京市",
		},
		[891]=
		{
			id = 891,
			code = 320101,
			name = "江苏省",
			city = "南京市",
			qu = "市辖区",
		},
		[892]=
		{
			id = 892,
			code = 320102,
			name = "江苏省",
			city = "南京市",
			qu = "玄武区",
		},
		[893]=
		{
			id = 893,
			code = 320104,
			name = "江苏省",
			city = "南京市",
			qu = "秦淮区",
		},
		[894]=
		{
			id = 894,
			code = 320105,
			name = "江苏省",
			city = "南京市",
			qu = "建邺区",
		},
		[895]=
		{
			id = 895,
			code = 320106,
			name = "江苏省",
			city = "南京市",
			qu = "鼓楼区",
		},
		[896]=
		{
			id = 896,
			code = 320111,
			name = "江苏省",
			city = "南京市",
			qu = "浦口区",
		},
		[897]=
		{
			id = 897,
			code = 320113,
			name = "江苏省",
			city = "南京市",
			qu = "栖霞区",
		},
		[898]=
		{
			id = 898,
			code = 320114,
			name = "江苏省",
			city = "南京市",
			qu = "雨花台区",
		},
		[899]=
		{
			id = 899,
			code = 320115,
			name = "江苏省",
			city = "南京市",
			qu = "江宁区",
		},
		[900]=
		{
			id = 900,
			code = 320116,
			name = "江苏省",
			city = "南京市",
			qu = "六合区",
		},
		[901]=
		{
			id = 901,
			code = 320124,
			name = "江苏省",
			city = "南京市",
			qu = "溧水区",
		},
		[902]=
		{
			id = 902,
			code = 320125,
			name = "江苏省",
			city = "南京市",
			qu = "高淳区",
		},
		[903]=
		{
			id = 903,
			code = 320200,
			name = "江苏省",
			city = "无锡市",
		},
		[904]=
		{
			id = 904,
			code = 320201,
			name = "江苏省",
			city = "无锡市",
			qu = "市辖区",
		},
		[905]=
		{
			id = 905,
			code = 320202,
			name = "江苏省",
			city = "无锡市",
			qu = "梁溪区",
		},
		[906]=
		{
			id = 906,
			code = 320203,
			name = "江苏省",
			city = "无锡市",
			qu = "新吴区",
		},
		[907]=
		{
			id = 907,
			code = 320205,
			name = "江苏省",
			city = "无锡市",
			qu = "锡山区",
		},
		[908]=
		{
			id = 908,
			code = 320206,
			name = "江苏省",
			city = "无锡市",
			qu = "惠山区",
		},
		[909]=
		{
			id = 909,
			code = 320211,
			name = "江苏省",
			city = "无锡市",
			qu = "滨湖区",
		},
		[910]=
		{
			id = 910,
			code = 320281,
			name = "江苏省",
			city = "无锡市",
			qu = "江阴市",
		},
		[911]=
		{
			id = 911,
			code = 320282,
			name = "江苏省",
			city = "无锡市",
			qu = "宜兴市",
		},
		[912]=
		{
			id = 912,
			code = 320300,
			name = "江苏省",
			city = "徐州市",
		},
		[913]=
		{
			id = 913,
			code = 320301,
			name = "江苏省",
			city = "徐州市",
			qu = "市辖区",
		},
		[914]=
		{
			id = 914,
			code = 320302,
			name = "江苏省",
			city = "徐州市",
			qu = "鼓楼区",
		},
		[915]=
		{
			id = 915,
			code = 320303,
			name = "江苏省",
			city = "徐州市",
			qu = "云龙区",
		},
		[916]=
		{
			id = 916,
			code = 320305,
			name = "江苏省",
			city = "徐州市",
			qu = "贾汪区",
		},
		[917]=
		{
			id = 917,
			code = 320311,
			name = "江苏省",
			city = "徐州市",
			qu = "泉山区",
		},
		[918]=
		{
			id = 918,
			code = 320321,
			name = "江苏省",
			city = "徐州市",
			qu = "丰县",
		},
		[919]=
		{
			id = 919,
			code = 320322,
			name = "江苏省",
			city = "徐州市",
			qu = "沛县",
		},
		[920]=
		{
			id = 920,
			code = 320323,
			name = "江苏省",
			city = "徐州市",
			qu = "铜山区",
		},
		[921]=
		{
			id = 921,
			code = 320324,
			name = "江苏省",
			city = "徐州市",
			qu = "睢宁县",
		},
		[922]=
		{
			id = 922,
			code = 320381,
			name = "江苏省",
			city = "徐州市",
			qu = "新沂市",
		},
		[923]=
		{
			id = 923,
			code = 320382,
			name = "江苏省",
			city = "徐州市",
			qu = "邳州市",
		},
		[924]=
		{
			id = 924,
			code = 320400,
			name = "江苏省",
			city = "常州市",
		},
		[925]=
		{
			id = 925,
			code = 320401,
			name = "江苏省",
			city = "常州市",
			qu = "市辖区",
		},
		[926]=
		{
			id = 926,
			code = 320402,
			name = "江苏省",
			city = "常州市",
			qu = "天宁区",
		},
		[927]=
		{
			id = 927,
			code = 320404,
			name = "江苏省",
			city = "常州市",
			qu = "钟楼区",
		},
		[928]=
		{
			id = 928,
			code = 320411,
			name = "江苏省",
			city = "常州市",
			qu = "新北区",
		},
		[929]=
		{
			id = 929,
			code = 320412,
			name = "江苏省",
			city = "常州市",
			qu = "武进区",
		},
		[930]=
		{
			id = 930,
			code = 320481,
			name = "江苏省",
			city = "常州市",
			qu = "溧阳市",
		},
		[931]=
		{
			id = 931,
			code = 320482,
			name = "江苏省",
			city = "常州市",
			qu = "金坛区",
		},
		[932]=
		{
			id = 932,
			code = 320500,
			name = "江苏省",
			city = "苏州市",
		},
		[933]=
		{
			id = 933,
			code = 320501,
			name = "江苏省",
			city = "苏州市",
			qu = "市辖区",
		},
		[934]=
		{
			id = 934,
			code = 320503,
			name = "江苏省",
			city = "苏州市",
			qu = "姑苏区",
		},
		[935]=
		{
			id = 935,
			code = 320505,
			name = "江苏省",
			city = "苏州市",
			qu = "虎丘区",
		},
		[936]=
		{
			id = 936,
			code = 320506,
			name = "江苏省",
			city = "苏州市",
			qu = "吴中区",
		},
		[937]=
		{
			id = 937,
			code = 320507,
			name = "江苏省",
			city = "苏州市",
			qu = "相城区",
		},
		[938]=
		{
			id = 938,
			code = 320581,
			name = "江苏省",
			city = "苏州市",
			qu = "常熟市",
		},
		[939]=
		{
			id = 939,
			code = 320582,
			name = "江苏省",
			city = "苏州市",
			qu = "张家港市",
		},
		[940]=
		{
			id = 940,
			code = 320583,
			name = "江苏省",
			city = "苏州市",
			qu = "昆山市",
		},
		[941]=
		{
			id = 941,
			code = 320584,
			name = "江苏省",
			city = "苏州市",
			qu = "吴江区",
		},
		[942]=
		{
			id = 942,
			code = 320585,
			name = "江苏省",
			city = "苏州市",
			qu = "太仓市",
		},
		[943]=
		{
			id = 943,
			code = 320600,
			name = "江苏省",
			city = "南通市",
		},
		[944]=
		{
			id = 944,
			code = 320601,
			name = "江苏省",
			city = "南通市",
			qu = "市辖区",
		},
		[945]=
		{
			id = 945,
			code = 320602,
			name = "江苏省",
			city = "南通市",
			qu = "崇川区",
		},
		[946]=
		{
			id = 946,
			code = 320611,
			name = "江苏省",
			city = "南通市",
			qu = "港闸区",
		},
		[947]=
		{
			id = 947,
			code = 320621,
			name = "江苏省",
			city = "南通市",
			qu = "海安县",
		},
		[948]=
		{
			id = 948,
			code = 320623,
			name = "江苏省",
			city = "南通市",
			qu = "如东县",
		},
		[949]=
		{
			id = 949,
			code = 320681,
			name = "江苏省",
			city = "南通市",
			qu = "启东市",
		},
		[950]=
		{
			id = 950,
			code = 320682,
			name = "江苏省",
			city = "南通市",
			qu = "如皋市",
		},
		[951]=
		{
			id = 951,
			code = 320683,
			name = "江苏省",
			city = "南通市",
			qu = "通州区",
		},
		[952]=
		{
			id = 952,
			code = 320684,
			name = "江苏省",
			city = "南通市",
			qu = "海门市",
		},
		[953]=
		{
			id = 953,
			code = 320700,
			name = "江苏省",
			city = "连云港市",
		},
		[954]=
		{
			id = 954,
			code = 320701,
			name = "江苏省",
			city = "连云港市",
			qu = "市辖区",
		},
		[955]=
		{
			id = 955,
			code = 320703,
			name = "江苏省",
			city = "连云港市",
			qu = "连云区",
		},
		[956]=
		{
			id = 956,
			code = 320706,
			name = "江苏省",
			city = "连云港市",
			qu = "海州区",
		},
		[957]=
		{
			id = 957,
			code = 320721,
			name = "江苏省",
			city = "连云港市",
			qu = "赣榆区",
		},
		[958]=
		{
			id = 958,
			code = 320722,
			name = "江苏省",
			city = "连云港市",
			qu = "东海县",
		},
		[959]=
		{
			id = 959,
			code = 320723,
			name = "江苏省",
			city = "连云港市",
			qu = "灌云县",
		},
		[960]=
		{
			id = 960,
			code = 320724,
			name = "江苏省",
			city = "连云港市",
			qu = "灌南县",
		},
		[961]=
		{
			id = 961,
			code = 320800,
			name = "江苏省",
			city = "淮安市",
		},
		[962]=
		{
			id = 962,
			code = 320801,
			name = "江苏省",
			city = "淮安市",
			qu = "市辖区",
		},
		[963]=
		{
			id = 963,
			code = 320803,
			name = "江苏省",
			city = "淮安市",
			qu = "淮安区",
		},
		[964]=
		{
			id = 964,
			code = 320804,
			name = "江苏省",
			city = "淮安市",
			qu = "淮阴区",
		},
		[965]=
		{
			id = 965,
			code = 320811,
			name = "江苏省",
			city = "淮安市",
			qu = "清江浦区",
		},
		[966]=
		{
			id = 966,
			code = 320826,
			name = "江苏省",
			city = "淮安市",
			qu = "涟水县",
		},
		[967]=
		{
			id = 967,
			code = 320829,
			name = "江苏省",
			city = "淮安市",
			qu = "洪泽县",
		},
		[968]=
		{
			id = 968,
			code = 320830,
			name = "江苏省",
			city = "淮安市",
			qu = "盱眙县",
		},
		[969]=
		{
			id = 969,
			code = 320831,
			name = "江苏省",
			city = "淮安市",
			qu = "金湖县",
		},
		[970]=
		{
			id = 970,
			code = 320900,
			name = "江苏省",
			city = "盐城市",
		},
		[971]=
		{
			id = 971,
			code = 320901,
			name = "江苏省",
			city = "盐城市",
			qu = "市辖区",
		},
		[972]=
		{
			id = 972,
			code = 320902,
			name = "江苏省",
			city = "盐城市",
			qu = "亭湖区",
		},
		[973]=
		{
			id = 973,
			code = 320903,
			name = "江苏省",
			city = "盐城市",
			qu = "盐都区",
		},
		[974]=
		{
			id = 974,
			code = 320921,
			name = "江苏省",
			city = "盐城市",
			qu = "响水县",
		},
		[975]=
		{
			id = 975,
			code = 320922,
			name = "江苏省",
			city = "盐城市",
			qu = "滨海县",
		},
		[976]=
		{
			id = 976,
			code = 320923,
			name = "江苏省",
			city = "盐城市",
			qu = "阜宁县",
		},
		[977]=
		{
			id = 977,
			code = 320924,
			name = "江苏省",
			city = "盐城市",
			qu = "射阳县",
		},
		[978]=
		{
			id = 978,
			code = 320925,
			name = "江苏省",
			city = "盐城市",
			qu = "建湖县",
		},
		[979]=
		{
			id = 979,
			code = 320981,
			name = "江苏省",
			city = "盐城市",
			qu = "东台市",
		},
		[980]=
		{
			id = 980,
			code = 320982,
			name = "江苏省",
			city = "盐城市",
			qu = "大丰区",
		},
		[981]=
		{
			id = 981,
			code = 321000,
			name = "江苏省",
			city = "扬州市",
		},
		[982]=
		{
			id = 982,
			code = 321001,
			name = "江苏省",
			city = "扬州市",
			qu = "市辖区",
		},
		[983]=
		{
			id = 983,
			code = 321002,
			name = "江苏省",
			city = "扬州市",
			qu = "广陵区",
		},
		[984]=
		{
			id = 984,
			code = 321003,
			name = "江苏省",
			city = "扬州市",
			qu = "邗江区",
		},
		[985]=
		{
			id = 985,
			code = 321023,
			name = "江苏省",
			city = "扬州市",
			qu = "宝应县",
		},
		[986]=
		{
			id = 986,
			code = 321081,
			name = "江苏省",
			city = "扬州市",
			qu = "仪征市",
		},
		[987]=
		{
			id = 987,
			code = 321084,
			name = "江苏省",
			city = "扬州市",
			qu = "高邮市",
		},
		[988]=
		{
			id = 988,
			code = 321088,
			name = "江苏省",
			city = "扬州市",
			qu = "江都区",
		},
		[989]=
		{
			id = 989,
			code = 321100,
			name = "江苏省",
			city = "镇江市",
		},
		[990]=
		{
			id = 990,
			code = 321101,
			name = "江苏省",
			city = "镇江市",
			qu = "市辖区",
		},
		[991]=
		{
			id = 991,
			code = 321102,
			name = "江苏省",
			city = "镇江市",
			qu = "京口区",
		},
		[992]=
		{
			id = 992,
			code = 321111,
			name = "江苏省",
			city = "镇江市",
			qu = "润州区",
		},
		[993]=
		{
			id = 993,
			code = 321112,
			name = "江苏省",
			city = "镇江市",
			qu = "丹徒区",
		},
		[994]=
		{
			id = 994,
			code = 321181,
			name = "江苏省",
			city = "镇江市",
			qu = "丹阳市",
		},
		[995]=
		{
			id = 995,
			code = 321182,
			name = "江苏省",
			city = "镇江市",
			qu = "扬中市",
		},
		[996]=
		{
			id = 996,
			code = 321183,
			name = "江苏省",
			city = "镇江市",
			qu = "句容市",
		},
		[997]=
		{
			id = 997,
			code = 321200,
			name = "江苏省",
			city = "泰州市",
		},
		[998]=
		{
			id = 998,
			code = 321201,
			name = "江苏省",
			city = "泰州市",
			qu = "市辖区",
		},
		[999]=
		{
			id = 999,
			code = 321202,
			name = "江苏省",
			city = "泰州市",
			qu = "海陵区",
		},
		[1000]=
		{
			id = 1000,
			code = 321203,
			name = "江苏省",
			city = "泰州市",
			qu = "高港区",
		},
		[1001]=
		{
			id = 1001,
			code = 321281,
			name = "江苏省",
			city = "泰州市",
			qu = "兴化市",
		},
		[1002]=
		{
			id = 1002,
			code = 321282,
			name = "江苏省",
			city = "泰州市",
			qu = "靖江市",
		},
		[1003]=
		{
			id = 1003,
			code = 321283,
			name = "江苏省",
			city = "泰州市",
			qu = "泰兴市",
		},
		[1004]=
		{
			id = 1004,
			code = 321284,
			name = "江苏省",
			city = "泰州市",
			qu = "姜堰区",
		},
		[1005]=
		{
			id = 1005,
			code = 321300,
			name = "江苏省",
			city = "宿迁市",
		},
		[1006]=
		{
			id = 1006,
			code = 321301,
			name = "江苏省",
			city = "宿迁市",
			qu = "市辖区",
		},
		[1007]=
		{
			id = 1007,
			code = 321302,
			name = "江苏省",
			city = "宿迁市",
			qu = "宿城区",
		},
		[1008]=
		{
			id = 1008,
			code = 321311,
			name = "江苏省",
			city = "宿迁市",
			qu = "宿豫区",
		},
		[1009]=
		{
			id = 1009,
			code = 321322,
			name = "江苏省",
			city = "宿迁市",
			qu = "沭阳县",
		},
		[1010]=
		{
			id = 1010,
			code = 321323,
			name = "江苏省",
			city = "宿迁市",
			qu = "泗阳县",
		},
		[1011]=
		{
			id = 1011,
			code = 321324,
			name = "江苏省",
			city = "宿迁市",
			qu = "泗洪县",
		},
		[1012]=
		{
			id = 1012,
			code = 330000,
			name = "浙江省",
		},
		[1013]=
		{
			id = 1013,
			code = 330100,
			name = "浙江省",
			city = "杭州市",
		},
		[1014]=
		{
			id = 1014,
			code = 330101,
			name = "浙江省",
			city = "杭州市",
			qu = "市辖区",
		},
		[1015]=
		{
			id = 1015,
			code = 330102,
			name = "浙江省",
			city = "杭州市",
			qu = "上城区",
		},
		[1016]=
		{
			id = 1016,
			code = 330103,
			name = "浙江省",
			city = "杭州市",
			qu = "下城区",
		},
		[1017]=
		{
			id = 1017,
			code = 330104,
			name = "浙江省",
			city = "杭州市",
			qu = "江干区",
		},
		[1018]=
		{
			id = 1018,
			code = 330105,
			name = "浙江省",
			city = "杭州市",
			qu = "拱墅区",
		},
		[1019]=
		{
			id = 1019,
			code = 330106,
			name = "浙江省",
			city = "杭州市",
			qu = "西湖区",
		},
		[1020]=
		{
			id = 1020,
			code = 330108,
			name = "浙江省",
			city = "杭州市",
			qu = "滨江区",
		},
		[1021]=
		{
			id = 1021,
			code = 330109,
			name = "浙江省",
			city = "杭州市",
			qu = "萧山区",
		},
		[1022]=
		{
			id = 1022,
			code = 330110,
			name = "浙江省",
			city = "杭州市",
			qu = "余杭区",
		},
		[1023]=
		{
			id = 1023,
			code = 330122,
			name = "浙江省",
			city = "杭州市",
			qu = "桐庐县",
		},
		[1024]=
		{
			id = 1024,
			code = 330127,
			name = "浙江省",
			city = "杭州市",
			qu = "淳安县",
		},
		[1025]=
		{
			id = 1025,
			code = 330182,
			name = "浙江省",
			city = "杭州市",
			qu = "建德市",
		},
		[1026]=
		{
			id = 1026,
			code = 330183,
			name = "浙江省",
			city = "杭州市",
			qu = "富阳市",
		},
		[1027]=
		{
			id = 1027,
			code = 330185,
			name = "浙江省",
			city = "杭州市",
			qu = "临安市",
		},
		[1028]=
		{
			id = 1028,
			code = 330200,
			name = "浙江省",
			city = "宁波市",
		},
		[1029]=
		{
			id = 1029,
			code = 330201,
			name = "浙江省",
			city = "宁波市",
			qu = "市辖区",
		},
		[1030]=
		{
			id = 1030,
			code = 330203,
			name = "浙江省",
			city = "宁波市",
			qu = "海曙区",
		},
		[1031]=
		{
			id = 1031,
			code = 330204,
			name = "浙江省",
			city = "宁波市",
			qu = "江东区",
		},
		[1032]=
		{
			id = 1032,
			code = 330205,
			name = "浙江省",
			city = "宁波市",
			qu = "江北区",
		},
		[1033]=
		{
			id = 1033,
			code = 330206,
			name = "浙江省",
			city = "宁波市",
			qu = "北仑区",
		},
		[1034]=
		{
			id = 1034,
			code = 330211,
			name = "浙江省",
			city = "宁波市",
			qu = "镇海区",
		},
		[1035]=
		{
			id = 1035,
			code = 330212,
			name = "浙江省",
			city = "宁波市",
			qu = "鄞州区",
		},
		[1036]=
		{
			id = 1036,
			code = 330225,
			name = "浙江省",
			city = "宁波市",
			qu = "象山县",
		},
		[1037]=
		{
			id = 1037,
			code = 330226,
			name = "浙江省",
			city = "宁波市",
			qu = "宁海县",
		},
		[1038]=
		{
			id = 1038,
			code = 330281,
			name = "浙江省",
			city = "宁波市",
			qu = "余姚市",
		},
		[1039]=
		{
			id = 1039,
			code = 330282,
			name = "浙江省",
			city = "宁波市",
			qu = "慈溪市",
		},
		[1040]=
		{
			id = 1040,
			code = 330283,
			name = "浙江省",
			city = "宁波市",
			qu = "奉化市",
		},
		[1041]=
		{
			id = 1041,
			code = 330300,
			name = "浙江省",
			city = "温州市",
		},
		[1042]=
		{
			id = 1042,
			code = 330301,
			name = "浙江省",
			city = "温州市",
			qu = "市辖区",
		},
		[1043]=
		{
			id = 1043,
			code = 330302,
			name = "浙江省",
			city = "温州市",
			qu = " ",
		},
		[1044]=
		{
			id = 1044,
			code = 330303,
			name = "浙江省",
			city = "温州市",
			qu = "龙湾区",
		},
		[1045]=
		{
			id = 1045,
			code = 330304,
			name = "浙江省",
			city = "温州市",
			qu = "瓯海区",
		},
		[1046]=
		{
			id = 1046,
			code = 330322,
			name = "浙江省",
			city = "温州市",
			qu = "洞头区",
		},
		[1047]=
		{
			id = 1047,
			code = 330324,
			name = "浙江省",
			city = "温州市",
			qu = "永嘉县",
		},
		[1048]=
		{
			id = 1048,
			code = 330326,
			name = "浙江省",
			city = "温州市",
			qu = "平阳县",
		},
		[1049]=
		{
			id = 1049,
			code = 330327,
			name = "浙江省",
			city = "温州市",
			qu = "苍南县",
		},
		[1050]=
		{
			id = 1050,
			code = 330328,
			name = "浙江省",
			city = "温州市",
			qu = "文成县",
		},
		[1051]=
		{
			id = 1051,
			code = 330329,
			name = "浙江省",
			city = "温州市",
			qu = "泰顺县",
		},
		[1052]=
		{
			id = 1052,
			code = 330381,
			name = "浙江省",
			city = "温州市",
			qu = "瑞安市",
		},
		[1053]=
		{
			id = 1053,
			code = 330382,
			name = "浙江省",
			city = "温州市",
			qu = "乐清市",
		},
		[1054]=
		{
			id = 1054,
			code = 330400,
			name = "浙江省",
			city = "嘉兴市",
		},
		[1055]=
		{
			id = 1055,
			code = 330401,
			name = "浙江省",
			city = "嘉兴市",
			qu = "市辖区",
		},
		[1056]=
		{
			id = 1056,
			code = 330402,
			name = "浙江省",
			city = "嘉兴市",
			qu = "南湖区",
		},
		[1057]=
		{
			id = 1057,
			code = 330411,
			name = "浙江省",
			city = "嘉兴市",
			qu = "秀洲区",
		},
		[1058]=
		{
			id = 1058,
			code = 330421,
			name = "浙江省",
			city = "嘉兴市",
			qu = "嘉善县",
		},
		[1059]=
		{
			id = 1059,
			code = 330424,
			name = "浙江省",
			city = "嘉兴市",
			qu = "海盐县",
		},
		[1060]=
		{
			id = 1060,
			code = 330481,
			name = "浙江省",
			city = "嘉兴市",
			qu = "海宁市",
		},
		[1061]=
		{
			id = 1061,
			code = 330482,
			name = "浙江省",
			city = "嘉兴市",
			qu = "平湖市",
		},
		[1062]=
		{
			id = 1062,
			code = 330483,
			name = "浙江省",
			city = "嘉兴市",
			qu = "桐乡市",
		},
		[1063]=
		{
			id = 1063,
			code = 330500,
			name = "浙江省",
			city = "湖州市",
		},
		[1064]=
		{
			id = 1064,
			code = 330501,
			name = "浙江省",
			city = "湖州市",
			qu = "市辖区",
		},
		[1065]=
		{
			id = 1065,
			code = 330502,
			name = "浙江省",
			city = "湖州市",
			qu = "吴兴区",
		},
		[1066]=
		{
			id = 1066,
			code = 330503,
			name = "浙江省",
			city = "湖州市",
			qu = "南浔区",
		},
		[1067]=
		{
			id = 1067,
			code = 330521,
			name = "浙江省",
			city = "湖州市",
			qu = "德清县",
		},
		[1068]=
		{
			id = 1068,
			code = 330522,
			name = "浙江省",
			city = "湖州市",
			qu = "长兴县",
		},
		[1069]=
		{
			id = 1069,
			code = 330523,
			name = "浙江省",
			city = "湖州市",
			qu = "安吉县",
		},
		[1070]=
		{
			id = 1070,
			code = 330600,
			name = "浙江省",
			city = "绍兴市",
		},
		[1071]=
		{
			id = 1071,
			code = 330601,
			name = "浙江省",
			city = "绍兴市",
			qu = "市辖区",
		},
		[1072]=
		{
			id = 1072,
			code = 330602,
			name = "浙江省",
			city = "绍兴市",
			qu = "越城区",
		},
		[1073]=
		{
			id = 1073,
			code = 330621,
			name = "浙江省",
			city = "绍兴市",
			qu = "柯桥区",
		},
		[1074]=
		{
			id = 1074,
			code = 330624,
			name = "浙江省",
			city = "绍兴市",
			qu = "新昌县",
		},
		[1075]=
		{
			id = 1075,
			code = 330681,
			name = "浙江省",
			city = "绍兴市",
			qu = "诸暨市",
		},
		[1076]=
		{
			id = 1076,
			code = 330682,
			name = "浙江省",
			city = "绍兴市",
			qu = "上虞区",
		},
		[1077]=
		{
			id = 1077,
			code = 330683,
			name = "浙江省",
			city = "绍兴市",
			qu = "嵊州市",
		},
		[1078]=
		{
			id = 1078,
			code = 330700,
			name = "浙江省",
			city = "金华市",
		},
		[1079]=
		{
			id = 1079,
			code = 330701,
			name = "浙江省",
			city = "金华市",
			qu = "市辖区",
		},
		[1080]=
		{
			id = 1080,
			code = 330702,
			name = "浙江省",
			city = "金华市",
			qu = "婺城区",
		},
		[1081]=
		{
			id = 1081,
			code = 330703,
			name = "浙江省",
			city = "金华市",
			qu = "金东区",
		},
		[1082]=
		{
			id = 1082,
			code = 330723,
			name = "浙江省",
			city = "金华市",
			qu = "武义县",
		},
		[1083]=
		{
			id = 1083,
			code = 330726,
			name = "浙江省",
			city = "金华市",
			qu = "浦江县",
		},
		[1084]=
		{
			id = 1084,
			code = 330727,
			name = "浙江省",
			city = "金华市",
			qu = "磐安县",
		},
		[1085]=
		{
			id = 1085,
			code = 330781,
			name = "浙江省",
			city = "金华市",
			qu = "兰溪市",
		},
		[1086]=
		{
			id = 1086,
			code = 330782,
			name = "浙江省",
			city = "金华市",
			qu = "义乌市",
		},
		[1087]=
		{
			id = 1087,
			code = 330783,
			name = "浙江省",
			city = "金华市",
			qu = "东阳市",
		},
		[1088]=
		{
			id = 1088,
			code = 330784,
			name = "浙江省",
			city = "金华市",
			qu = "永康市",
		},
		[1089]=
		{
			id = 1089,
			code = 330800,
			name = "浙江省",
			city = "衢州市",
		},
		[1090]=
		{
			id = 1090,
			code = 330801,
			name = "浙江省",
			city = "衢州市",
			qu = "市辖区",
		},
		[1091]=
		{
			id = 1091,
			code = 330802,
			name = "浙江省",
			city = "衢州市",
			qu = "柯城区",
		},
		[1092]=
		{
			id = 1092,
			code = 330803,
			name = "浙江省",
			city = "衢州市",
			qu = "衢江区",
		},
		[1093]=
		{
			id = 1093,
			code = 330822,
			name = "浙江省",
			city = "衢州市",
			qu = "常山县",
		},
		[1094]=
		{
			id = 1094,
			code = 330824,
			name = "浙江省",
			city = "衢州市",
			qu = "开化县",
		},
		[1095]=
		{
			id = 1095,
			code = 330825,
			name = "浙江省",
			city = "衢州市",
			qu = "龙游县",
		},
		[1096]=
		{
			id = 1096,
			code = 330881,
			name = "浙江省",
			city = "衢州市",
			qu = "江山市",
		},
		[1097]=
		{
			id = 1097,
			code = 330900,
			name = "浙江省",
			city = "舟山市",
		},
		[1098]=
		{
			id = 1098,
			code = 330901,
			name = "浙江省",
			city = "舟山市",
			qu = "市辖区",
		},
		[1099]=
		{
			id = 1099,
			code = 330902,
			name = "浙江省",
			city = "舟山市",
			qu = "定海区",
		},
		[1100]=
		{
			id = 1100,
			code = 330903,
			name = "浙江省",
			city = "舟山市",
			qu = "普陀区",
		},
		[1101]=
		{
			id = 1101,
			code = 330921,
			name = "浙江省",
			city = "舟山市",
			qu = "岱山县",
		},
		[1102]=
		{
			id = 1102,
			code = 330922,
			name = "浙江省",
			city = "舟山市",
			qu = "嵊泗县",
		},
		[1103]=
		{
			id = 1103,
			code = 331000,
			name = "浙江省",
			city = "台州市",
		},
		[1104]=
		{
			id = 1104,
			code = 331001,
			name = "浙江省",
			city = "台州市",
			qu = "市辖区",
		},
		[1105]=
		{
			id = 1105,
			code = 331002,
			name = "浙江省",
			city = "台州市",
			qu = "椒江区",
		},
		[1106]=
		{
			id = 1106,
			code = 331003,
			name = "浙江省",
			city = "台州市",
			qu = "黄岩区",
		},
		[1107]=
		{
			id = 1107,
			code = 331004,
			name = "浙江省",
			city = "台州市",
			qu = "路桥区",
		},
		[1108]=
		{
			id = 1108,
			code = 331021,
			name = "浙江省",
			city = "台州市",
			qu = "玉环县",
		},
		[1109]=
		{
			id = 1109,
			code = 331022,
			name = "浙江省",
			city = "台州市",
			qu = "三门县",
		},
		[1110]=
		{
			id = 1110,
			code = 331023,
			name = "浙江省",
			city = "台州市",
			qu = "天台县",
		},
		[1111]=
		{
			id = 1111,
			code = 331024,
			name = "浙江省",
			city = "台州市",
			qu = "仙居县",
		},
		[1112]=
		{
			id = 1112,
			code = 331081,
			name = "浙江省",
			city = "台州市",
			qu = "温岭市",
		},
		[1113]=
		{
			id = 1113,
			code = 331082,
			name = "浙江省",
			city = "台州市",
			qu = "临海市",
		},
		[1114]=
		{
			id = 1114,
			code = 331100,
			name = "浙江省",
			city = "丽水市",
		},
		[1115]=
		{
			id = 1115,
			code = 331101,
			name = "浙江省",
			city = "丽水市",
			qu = "市辖区",
		},
		[1116]=
		{
			id = 1116,
			code = 331102,
			name = "浙江省",
			city = "丽水市",
			qu = "莲都区",
		},
		[1117]=
		{
			id = 1117,
			code = 331121,
			name = "浙江省",
			city = "丽水市",
			qu = "青田县",
		},
		[1118]=
		{
			id = 1118,
			code = 331122,
			name = "浙江省",
			city = "丽水市",
			qu = "缙云县",
		},
		[1119]=
		{
			id = 1119,
			code = 331123,
			name = "浙江省",
			city = "丽水市",
			qu = "遂昌县",
		},
		[1120]=
		{
			id = 1120,
			code = 331124,
			name = "浙江省",
			city = "丽水市",
			qu = "松阳县",
		},
		[1121]=
		{
			id = 1121,
			code = 331125,
			name = "浙江省",
			city = "丽水市",
			qu = "云和县",
		},
		[1122]=
		{
			id = 1122,
			code = 331126,
			name = "浙江省",
			city = "丽水市",
			qu = "庆元县",
		},
		[1123]=
		{
			id = 1123,
			code = 331127,
			name = "浙江省",
			city = "丽水市",
			qu = "景宁畲族自治县",
		},
		[1124]=
		{
			id = 1124,
			code = 331181,
			name = "浙江省",
			city = "丽水市",
			qu = "龙泉市",
		},
		[1125]=
		{
			id = 1125,
			code = 340000,
			name = "安徽省",
		},
		[1126]=
		{
			id = 1126,
			code = 340100,
			name = "安徽省",
			city = "合肥市",
		},
		[1127]=
		{
			id = 1127,
			code = 340101,
			name = "安徽省",
			city = "合肥市",
			qu = "市辖区",
		},
		[1128]=
		{
			id = 1128,
			code = 340102,
			name = "安徽省",
			city = "合肥市",
			qu = "瑶海区",
		},
		[1129]=
		{
			id = 1129,
			code = 340103,
			name = "安徽省",
			city = "合肥市",
			qu = "庐阳区",
		},
		[1130]=
		{
			id = 1130,
			code = 340104,
			name = "安徽省",
			city = "合肥市",
			qu = "蜀山区",
		},
		[1131]=
		{
			id = 1131,
			code = 340111,
			name = "安徽省",
			city = "合肥市",
			qu = "包河区",
		},
		[1132]=
		{
			id = 1132,
			code = 340121,
			name = "安徽省",
			city = "合肥市",
			qu = "长丰县",
		},
		[1133]=
		{
			id = 1133,
			code = 340122,
			name = "安徽省",
			city = "合肥市",
			qu = "肥东县",
		},
		[1134]=
		{
			id = 1134,
			code = 340123,
			name = "安徽省",
			city = "合肥市",
			qu = "肥西县",
		},
		[1135]=
		{
			id = 1135,
			code = 340200,
			name = "安徽省",
			city = "芜湖市",
		},
		[1136]=
		{
			id = 1136,
			code = 340201,
			name = "安徽省",
			city = "芜湖市",
			qu = "市辖区",
		},
		[1137]=
		{
			id = 1137,
			code = 340202,
			name = "安徽省",
			city = "芜湖市",
			qu = "镜湖区",
		},
		[1138]=
		{
			id = 1138,
			code = 340203,
			name = "安徽省",
			city = "芜湖市",
			qu = "弋江区",
		},
		[1139]=
		{
			id = 1139,
			code = 340207,
			name = "安徽省",
			city = "芜湖市",
			qu = "鸠江区",
		},
		[1140]=
		{
			id = 1140,
			code = 340208,
			name = "安徽省",
			city = "芜湖市",
			qu = "三山区",
		},
		[1141]=
		{
			id = 1141,
			code = 340221,
			name = "安徽省",
			city = "芜湖市",
			qu = "芜湖县",
		},
		[1142]=
		{
			id = 1142,
			code = 340222,
			name = "安徽省",
			city = "芜湖市",
			qu = "繁昌县",
		},
		[1143]=
		{
			id = 1143,
			code = 340223,
			name = "安徽省",
			city = "芜湖市",
			qu = "南陵县",
		},
		[1144]=
		{
			id = 1144,
			code = 340300,
			name = "安徽省",
			city = "蚌埠市",
		},
		[1145]=
		{
			id = 1145,
			code = 340301,
			name = "安徽省",
			city = "蚌埠市",
			qu = "市辖区",
		},
		[1146]=
		{
			id = 1146,
			code = 340302,
			name = "安徽省",
			city = "蚌埠市",
			qu = "龙子湖区",
		},
		[1147]=
		{
			id = 1147,
			code = 340303,
			name = "安徽省",
			city = "蚌埠市",
			qu = "蚌山区",
		},
		[1148]=
		{
			id = 1148,
			code = 340304,
			name = "安徽省",
			city = "蚌埠市",
			qu = "禹会区",
		},
		[1149]=
		{
			id = 1149,
			code = 340311,
			name = "安徽省",
			city = "蚌埠市",
			qu = "淮上区",
		},
		[1150]=
		{
			id = 1150,
			code = 340321,
			name = "安徽省",
			city = "蚌埠市",
			qu = "怀远县",
		},
		[1151]=
		{
			id = 1151,
			code = 340322,
			name = "安徽省",
			city = "蚌埠市",
			qu = "五河县",
		},
		[1152]=
		{
			id = 1152,
			code = 340323,
			name = "安徽省",
			city = "蚌埠市",
			qu = "固镇县",
		},
		[1153]=
		{
			id = 1153,
			code = 340400,
			name = "安徽省",
			city = "淮南市",
		},
		[1154]=
		{
			id = 1154,
			code = 340401,
			name = "安徽省",
			city = "淮南市",
			qu = "市辖区",
		},
		[1155]=
		{
			id = 1155,
			code = 340402,
			name = "安徽省",
			city = "淮南市",
			qu = "大通区",
		},
		[1156]=
		{
			id = 1156,
			code = 340403,
			name = "安徽省",
			city = "淮南市",
			qu = "田家庵区",
		},
		[1157]=
		{
			id = 1157,
			code = 340404,
			name = "安徽省",
			city = "淮南市",
			qu = "谢家集区",
		},
		[1158]=
		{
			id = 1158,
			code = 340405,
			name = "安徽省",
			city = "淮南市",
			qu = "八公山区",
		},
		[1159]=
		{
			id = 1159,
			code = 340406,
			name = "安徽省",
			city = "淮南市",
			qu = "潘集区",
		},
		[1160]=
		{
			id = 1160,
			code = 340421,
			name = "安徽省",
			city = "淮南市",
			qu = "凤台县",
		},
		[1161]=
		{
			id = 1161,
			code = 340500,
			name = "安徽省",
			city = "马鞍山市",
		},
		[1162]=
		{
			id = 1162,
			code = 340501,
			name = "安徽省",
			city = "马鞍山市",
			qu = "市辖区",
		},
		[1163]=
		{
			id = 1163,
			code = 340502,
			name = "安徽省",
			city = "马鞍山市",
			qu = "金家庄区",
		},
		[1164]=
		{
			id = 1164,
			code = 340503,
			name = "安徽省",
			city = "马鞍山市",
			qu = "花山区",
		},
		[1165]=
		{
			id = 1165,
			code = 340504,
			name = "安徽省",
			city = "马鞍山市",
			qu = "雨山区",
		},
		[1166]=
		{
			id = 1166,
			code = 340521,
			name = "安徽省",
			city = "马鞍山市",
			qu = "当涂县",
		},
		[1167]=
		{
			id = 1167,
			code = 340600,
			name = "安徽省",
			city = "淮北市",
		},
		[1168]=
		{
			id = 1168,
			code = 340601,
			name = "安徽省",
			city = "淮北市",
			qu = "市辖区",
		},
		[1169]=
		{
			id = 1169,
			code = 340602,
			name = "安徽省",
			city = "淮北市",
			qu = "杜集区",
		},
		[1170]=
		{
			id = 1170,
			code = 340603,
			name = "安徽省",
			city = "淮北市",
			qu = "相山区",
		},
		[1171]=
		{
			id = 1171,
			code = 340604,
			name = "安徽省",
			city = "淮北市",
			qu = "烈山区",
		},
		[1172]=
		{
			id = 1172,
			code = 340621,
			name = "安徽省",
			city = "淮北市",
			qu = "濉溪县",
		},
		[1173]=
		{
			id = 1173,
			code = 340700,
			name = "安徽省",
			city = "铜陵市",
		},
		[1174]=
		{
			id = 1174,
			code = 340701,
			name = "安徽省",
			city = "铜陵市",
			qu = "市辖区",
		},
		[1175]=
		{
			id = 1175,
			code = 340702,
			name = "安徽省",
			city = "铜陵市",
			qu = "铜官山区",
		},
		[1176]=
		{
			id = 1176,
			code = 340703,
			name = "安徽省",
			city = "铜陵市",
			qu = "狮子山区",
		},
		[1177]=
		{
			id = 1177,
			code = 340711,
			name = "安徽省",
			city = "铜陵市",
			qu = "郊区",
		},
		[1178]=
		{
			id = 1178,
			code = 340721,
			name = "安徽省",
			city = "铜陵市",
			qu = "铜陵县",
		},
		[1179]=
		{
			id = 1179,
			code = 340800,
			name = "安徽省",
			city = "安庆市",
		},
		[1180]=
		{
			id = 1180,
			code = 340801,
			name = "安徽省",
			city = "安庆市",
			qu = "市辖区",
		},
		[1181]=
		{
			id = 1181,
			code = 340802,
			name = "安徽省",
			city = "安庆市",
			qu = "迎江区",
		},
		[1182]=
		{
			id = 1182,
			code = 340803,
			name = "安徽省",
			city = "安庆市",
			qu = "大观区",
		},
		[1183]=
		{
			id = 1183,
			code = 340811,
			name = "安徽省",
			city = "安庆市",
			qu = "宜秀区",
		},
		[1184]=
		{
			id = 1184,
			code = 340822,
			name = "安徽省",
			city = "安庆市",
			qu = "怀宁县",
		},
		[1185]=
		{
			id = 1185,
			code = 340823,
			name = "安徽省",
			city = "安庆市",
			qu = "枞阳县",
		},
		[1186]=
		{
			id = 1186,
			code = 340824,
			name = "安徽省",
			city = "安庆市",
			qu = "潜山县",
		},
		[1187]=
		{
			id = 1187,
			code = 340825,
			name = "安徽省",
			city = "安庆市",
			qu = "太湖县",
		},
		[1188]=
		{
			id = 1188,
			code = 340826,
			name = "安徽省",
			city = "安庆市",
			qu = "宿松县",
		},
		[1189]=
		{
			id = 1189,
			code = 340827,
			name = "安徽省",
			city = "安庆市",
			qu = "望江县",
		},
		[1190]=
		{
			id = 1190,
			code = 340828,
			name = "安徽省",
			city = "安庆市",
			qu = "岳西县",
		},
		[1191]=
		{
			id = 1191,
			code = 340881,
			name = "安徽省",
			city = "安庆市",
			qu = "桐城市",
		},
		[1192]=
		{
			id = 1192,
			code = 341000,
			name = "安徽省",
			city = "黄山市",
		},
		[1193]=
		{
			id = 1193,
			code = 341001,
			name = "安徽省",
			city = "黄山市",
			qu = "市辖区",
		},
		[1194]=
		{
			id = 1194,
			code = 341002,
			name = "安徽省",
			city = "黄山市",
			qu = "屯溪区",
		},
		[1195]=
		{
			id = 1195,
			code = 341003,
			name = "安徽省",
			city = "黄山市",
			qu = "黄山区",
		},
		[1196]=
		{
			id = 1196,
			code = 341004,
			name = "安徽省",
			city = "黄山市",
			qu = "徽州区",
		},
		[1197]=
		{
			id = 1197,
			code = 341021,
			name = "安徽省",
			city = "黄山市",
			qu = "歙县",
		},
		[1198]=
		{
			id = 1198,
			code = 341022,
			name = "安徽省",
			city = "黄山市",
			qu = "休宁县",
		},
		[1199]=
		{
			id = 1199,
			code = 341023,
			name = "安徽省",
			city = "黄山市",
			qu = "黟县",
		},
		[1200]=
		{
			id = 1200,
			code = 341024,
			name = "安徽省",
			city = "黄山市",
			qu = "祁门县",
		},
		[1201]=
		{
			id = 1201,
			code = 341100,
			name = "安徽省",
			city = "滁州市",
		},
		[1202]=
		{
			id = 1202,
			code = 341101,
			name = "安徽省",
			city = "滁州市",
			qu = "市辖区",
		},
		[1203]=
		{
			id = 1203,
			code = 341102,
			name = "安徽省",
			city = "滁州市",
			qu = "琅琊区",
		},
		[1204]=
		{
			id = 1204,
			code = 341103,
			name = "安徽省",
			city = "滁州市",
			qu = "南谯区",
		},
		[1205]=
		{
			id = 1205,
			code = 341122,
			name = "安徽省",
			city = "滁州市",
			qu = "来安县",
		},
		[1206]=
		{
			id = 1206,
			code = 341124,
			name = "安徽省",
			city = "滁州市",
			qu = "全椒县",
		},
		[1207]=
		{
			id = 1207,
			code = 341125,
			name = "安徽省",
			city = "滁州市",
			qu = "定远县",
		},
		[1208]=
		{
			id = 1208,
			code = 341126,
			name = "安徽省",
			city = "滁州市",
			qu = "凤阳县",
		},
		[1209]=
		{
			id = 1209,
			code = 341181,
			name = "安徽省",
			city = "滁州市",
			qu = "天长市",
		},
		[1210]=
		{
			id = 1210,
			code = 341182,
			name = "安徽省",
			city = "滁州市",
			qu = "明光市",
		},
		[1211]=
		{
			id = 1211,
			code = 341200,
			name = "安徽省",
			city = "阜阳市",
		},
		[1212]=
		{
			id = 1212,
			code = 341201,
			name = "安徽省",
			city = "阜阳市",
			qu = "市辖区",
		},
		[1213]=
		{
			id = 1213,
			code = 341202,
			name = "安徽省",
			city = "阜阳市",
			qu = "颍州区",
		},
		[1214]=
		{
			id = 1214,
			code = 341203,
			name = "安徽省",
			city = "阜阳市",
			qu = "颍东区",
		},
		[1215]=
		{
			id = 1215,
			code = 341204,
			name = "安徽省",
			city = "阜阳市",
			qu = "颍泉区",
		},
		[1216]=
		{
			id = 1216,
			code = 341221,
			name = "安徽省",
			city = "阜阳市",
			qu = "临泉县",
		},
		[1217]=
		{
			id = 1217,
			code = 341222,
			name = "安徽省",
			city = "阜阳市",
			qu = "太和县",
		},
		[1218]=
		{
			id = 1218,
			code = 341225,
			name = "安徽省",
			city = "阜阳市",
			qu = "阜南县",
		},
		[1219]=
		{
			id = 1219,
			code = 341226,
			name = "安徽省",
			city = "阜阳市",
			qu = "颍上县",
		},
		[1220]=
		{
			id = 1220,
			code = 341282,
			name = "安徽省",
			city = "阜阳市",
			qu = "界首市",
		},
		[1221]=
		{
			id = 1221,
			code = 341300,
			name = "安徽省",
			city = "宿州市",
		},
		[1222]=
		{
			id = 1222,
			code = 341301,
			name = "安徽省",
			city = "宿州市",
			qu = "市辖区",
		},
		[1223]=
		{
			id = 1223,
			code = 341302,
			name = "安徽省",
			city = "宿州市",
			qu = "埇桥区",
		},
		[1224]=
		{
			id = 1224,
			code = 341321,
			name = "安徽省",
			city = "宿州市",
			qu = "砀山县",
		},
		[1225]=
		{
			id = 1225,
			code = 341322,
			name = "安徽省",
			city = "宿州市",
			qu = "萧县",
		},
		[1226]=
		{
			id = 1226,
			code = 341323,
			name = "安徽省",
			city = "宿州市",
			qu = "灵璧县",
		},
		[1227]=
		{
			id = 1227,
			code = 341324,
			name = "安徽省",
			city = "宿州市",
			qu = "泗县",
		},
		[1228]=
		{
			id = 1228,
			code = 341400,
			name = "安徽省",
			city = "巢湖市",
		},
		[1229]=
		{
			id = 1229,
			code = 341401,
			name = "安徽省",
			city = "巢湖市",
			qu = "市辖区",
		},
		[1230]=
		{
			id = 1230,
			code = 341402,
			name = "安徽省",
			city = "巢湖市",
			qu = "居巢区",
		},
		[1231]=
		{
			id = 1231,
			code = 341421,
			name = "安徽省",
			city = "巢湖市",
			qu = "庐江县",
		},
		[1232]=
		{
			id = 1232,
			code = 341422,
			name = "安徽省",
			city = "巢湖市",
			qu = "无为县",
		},
		[1233]=
		{
			id = 1233,
			code = 341423,
			name = "安徽省",
			city = "巢湖市",
			qu = "含山县",
		},
		[1234]=
		{
			id = 1234,
			code = 341424,
			name = "安徽省",
			city = "巢湖市",
			qu = "和县",
		},
		[1235]=
		{
			id = 1235,
			code = 341500,
			name = "安徽省",
			city = "六安市",
		},
		[1236]=
		{
			id = 1236,
			code = 341501,
			name = "安徽省",
			city = "六安市",
			qu = "市辖区",
		},
		[1237]=
		{
			id = 1237,
			code = 341502,
			name = "安徽省",
			city = "六安市",
			qu = "金安区",
		},
		[1238]=
		{
			id = 1238,
			code = 341503,
			name = "安徽省",
			city = "六安市",
			qu = "裕安区",
		},
		[1239]=
		{
			id = 1239,
			code = 341521,
			name = "安徽省",
			city = "六安市",
			qu = "寿县",
		},
		[1240]=
		{
			id = 1240,
			code = 341522,
			name = "安徽省",
			city = "六安市",
			qu = "霍邱县",
		},
		[1241]=
		{
			id = 1241,
			code = 341523,
			name = "安徽省",
			city = "六安市",
			qu = "舒城县",
		},
		[1242]=
		{
			id = 1242,
			code = 341524,
			name = "安徽省",
			city = "六安市",
			qu = "金寨县",
		},
		[1243]=
		{
			id = 1243,
			code = 341525,
			name = "安徽省",
			city = "六安市",
			qu = "霍山县",
		},
		[1244]=
		{
			id = 1244,
			code = 341600,
			name = "安徽省",
			city = "亳州市",
		},
		[1245]=
		{
			id = 1245,
			code = 341601,
			name = "安徽省",
			city = "亳州市",
			qu = "市辖区",
		},
		[1246]=
		{
			id = 1246,
			code = 341602,
			name = "安徽省",
			city = "亳州市",
			qu = "谯城区",
		},
		[1247]=
		{
			id = 1247,
			code = 341621,
			name = "安徽省",
			city = "亳州市",
			qu = "涡阳县",
		},
		[1248]=
		{
			id = 1248,
			code = 341622,
			name = "安徽省",
			city = "亳州市",
			qu = "蒙城县",
		},
		[1249]=
		{
			id = 1249,
			code = 341623,
			name = "安徽省",
			city = "亳州市",
			qu = "利辛县",
		},
		[1250]=
		{
			id = 1250,
			code = 341700,
			name = "安徽省",
			city = "池州市",
		},
		[1251]=
		{
			id = 1251,
			code = 341701,
			name = "安徽省",
			city = "池州市",
			qu = "市辖区",
		},
		[1252]=
		{
			id = 1252,
			code = 341702,
			name = "安徽省",
			city = "池州市",
			qu = "贵池区",
		},
		[1253]=
		{
			id = 1253,
			code = 341721,
			name = "安徽省",
			city = "池州市",
			qu = "东至县",
		},
		[1254]=
		{
			id = 1254,
			code = 341722,
			name = "安徽省",
			city = "池州市",
			qu = "石台县",
		},
		[1255]=
		{
			id = 1255,
			code = 341723,
			name = "安徽省",
			city = "池州市",
			qu = "青阳县",
		},
		[1256]=
		{
			id = 1256,
			code = 341800,
			name = "安徽省",
			city = "宣城市",
		},
		[1257]=
		{
			id = 1257,
			code = 341801,
			name = "安徽省",
			city = "宣城市",
			qu = "市辖区",
		},
		[1258]=
		{
			id = 1258,
			code = 341802,
			name = "安徽省",
			city = "宣城市",
			qu = "宣州区",
		},
		[1259]=
		{
			id = 1259,
			code = 341821,
			name = "安徽省",
			city = "宣城市",
			qu = "郎溪县",
		},
		[1260]=
		{
			id = 1260,
			code = 341822,
			name = "安徽省",
			city = "宣城市",
			qu = "广德县",
		},
		[1261]=
		{
			id = 1261,
			code = 341823,
			name = "安徽省",
			city = "宣城市",
			qu = "泾县",
		},
		[1262]=
		{
			id = 1262,
			code = 341824,
			name = "安徽省",
			city = "宣城市",
			qu = "绩溪县",
		},
		[1263]=
		{
			id = 1263,
			code = 341825,
			name = "安徽省",
			city = "宣城市",
			qu = "旌德县",
		},
		[1264]=
		{
			id = 1264,
			code = 341881,
			name = "安徽省",
			city = "宣城市",
			qu = "宁国市",
		},
		[1265]=
		{
			id = 1265,
			code = 350000,
			name = "福建省",
		},
		[1266]=
		{
			id = 1266,
			code = 350100,
			name = "福建省",
			city = "福州市",
		},
		[1267]=
		{
			id = 1267,
			code = 350101,
			name = "福建省",
			city = "福州市",
			qu = "市辖区",
		},
		[1268]=
		{
			id = 1268,
			code = 350102,
			name = "福建省",
			city = "福州市",
			qu = "鼓楼区",
		},
		[1269]=
		{
			id = 1269,
			code = 350103,
			name = "福建省",
			city = "福州市",
			qu = "台江区",
		},
		[1270]=
		{
			id = 1270,
			code = 350104,
			name = "福建省",
			city = "福州市",
			qu = "仓山区",
		},
		[1271]=
		{
			id = 1271,
			code = 350105,
			name = "福建省",
			city = "福州市",
			qu = "马尾区",
		},
		[1272]=
		{
			id = 1272,
			code = 350111,
			name = "福建省",
			city = "福州市",
			qu = "晋安区",
		},
		[1273]=
		{
			id = 1273,
			code = 350121,
			name = "福建省",
			city = "福州市",
			qu = "闽侯县",
		},
		[1274]=
		{
			id = 1274,
			code = 350122,
			name = "福建省",
			city = "福州市",
			qu = "连江县",
		},
		[1275]=
		{
			id = 1275,
			code = 350123,
			name = "福建省",
			city = "福州市",
			qu = "罗源县",
		},
		[1276]=
		{
			id = 1276,
			code = 350124,
			name = "福建省",
			city = "福州市",
			qu = "闽清县",
		},
		[1277]=
		{
			id = 1277,
			code = 350125,
			name = "福建省",
			city = "福州市",
			qu = "永泰县",
		},
		[1278]=
		{
			id = 1278,
			code = 350128,
			name = "福建省",
			city = "福州市",
			qu = "平潭县",
		},
		[1279]=
		{
			id = 1279,
			code = 350181,
			name = "福建省",
			city = "福州市",
			qu = "福清市",
		},
		[1280]=
		{
			id = 1280,
			code = 350182,
			name = "福建省",
			city = "福州市",
			qu = "长乐市",
		},
		[1281]=
		{
			id = 1281,
			code = 350200,
			name = "福建省",
			city = "厦门市",
		},
		[1282]=
		{
			id = 1282,
			code = 350201,
			name = "福建省",
			city = "厦门市",
			qu = "市辖区",
		},
		[1283]=
		{
			id = 1283,
			code = 350203,
			name = "福建省",
			city = "厦门市",
			qu = "思明区",
		},
		[1284]=
		{
			id = 1284,
			code = 350205,
			name = "福建省",
			city = "厦门市",
			qu = "海沧区",
		},
		[1285]=
		{
			id = 1285,
			code = 350206,
			name = "福建省",
			city = "厦门市",
			qu = "湖里区",
		},
		[1286]=
		{
			id = 1286,
			code = 350211,
			name = "福建省",
			city = "厦门市",
			qu = "集美区",
		},
		[1287]=
		{
			id = 1287,
			code = 350212,
			name = "福建省",
			city = "厦门市",
			qu = "同安区",
		},
		[1288]=
		{
			id = 1288,
			code = 350213,
			name = "福建省",
			city = "厦门市",
			qu = "翔安区",
		},
		[1289]=
		{
			id = 1289,
			code = 350300,
			name = "福建省",
			city = "莆田市",
		},
		[1290]=
		{
			id = 1290,
			code = 350301,
			name = "福建省",
			city = "莆田市",
			qu = "市辖区",
		},
		[1291]=
		{
			id = 1291,
			code = 350302,
			name = "福建省",
			city = "莆田市",
			qu = "城厢区",
		},
		[1292]=
		{
			id = 1292,
			code = 350303,
			name = "福建省",
			city = "莆田市",
			qu = "涵江区",
		},
		[1293]=
		{
			id = 1293,
			code = 350304,
			name = "福建省",
			city = "莆田市",
			qu = "荔城区",
		},
		[1294]=
		{
			id = 1294,
			code = 350305,
			name = "福建省",
			city = "莆田市",
			qu = "秀屿区",
		},
		[1295]=
		{
			id = 1295,
			code = 350322,
			name = "福建省",
			city = "莆田市",
			qu = "仙游县",
		},
		[1296]=
		{
			id = 1296,
			code = 350400,
			name = "福建省",
			city = "三明市",
		},
		[1297]=
		{
			id = 1297,
			code = 350401,
			name = "福建省",
			city = "三明市",
			qu = "市辖区",
		},
		[1298]=
		{
			id = 1298,
			code = 350402,
			name = "福建省",
			city = "三明市",
			qu = "梅列区",
		},
		[1299]=
		{
			id = 1299,
			code = 350403,
			name = "福建省",
			city = "三明市",
			qu = "三元区",
		},
		[1300]=
		{
			id = 1300,
			code = 350421,
			name = "福建省",
			city = "三明市",
			qu = "明溪县",
		},
		[1301]=
		{
			id = 1301,
			code = 350423,
			name = "福建省",
			city = "三明市",
			qu = "清流县",
		},
		[1302]=
		{
			id = 1302,
			code = 350424,
			name = "福建省",
			city = "三明市",
			qu = "宁化县",
		},
		[1303]=
		{
			id = 1303,
			code = 350425,
			name = "福建省",
			city = "三明市",
			qu = "大田县",
		},
		[1304]=
		{
			id = 1304,
			code = 350426,
			name = "福建省",
			city = "三明市",
			qu = "尤溪县",
		},
		[1305]=
		{
			id = 1305,
			code = 350427,
			name = "福建省",
			city = "三明市",
			qu = "沙县",
		},
		[1306]=
		{
			id = 1306,
			code = 350428,
			name = "福建省",
			city = "三明市",
			qu = "将乐县",
		},
		[1307]=
		{
			id = 1307,
			code = 350429,
			name = "福建省",
			city = "三明市",
			qu = "泰宁县",
		},
		[1308]=
		{
			id = 1308,
			code = 350430,
			name = "福建省",
			city = "三明市",
			qu = "建宁县",
		},
		[1309]=
		{
			id = 1309,
			code = 350481,
			name = "福建省",
			city = "三明市",
			qu = "永安市",
		},
		[1310]=
		{
			id = 1310,
			code = 350500,
			name = "福建省",
			city = "泉州市",
		},
		[1311]=
		{
			id = 1311,
			code = 350501,
			name = "福建省",
			city = "泉州市",
			qu = "市辖区",
		},
		[1312]=
		{
			id = 1312,
			code = 350502,
			name = "福建省",
			city = "泉州市",
			qu = "鲤城区",
		},
		[1313]=
		{
			id = 1313,
			code = 350503,
			name = "福建省",
			city = "泉州市",
			qu = "丰泽区",
		},
		[1314]=
		{
			id = 1314,
			code = 350504,
			name = "福建省",
			city = "泉州市",
			qu = "洛江区",
		},
		[1315]=
		{
			id = 1315,
			code = 350505,
			name = "福建省",
			city = "泉州市",
			qu = "泉港区",
		},
		[1316]=
		{
			id = 1316,
			code = 350521,
			name = "福建省",
			city = "泉州市",
			qu = "惠安县",
		},
		[1317]=
		{
			id = 1317,
			code = 350524,
			name = "福建省",
			city = "泉州市",
			qu = "安溪县",
		},
		[1318]=
		{
			id = 1318,
			code = 350525,
			name = "福建省",
			city = "泉州市",
			qu = "永春县",
		},
		[1319]=
		{
			id = 1319,
			code = 350526,
			name = "福建省",
			city = "泉州市",
			qu = "德化县",
		},
		[1320]=
		{
			id = 1320,
			code = 350527,
			name = "福建省",
			city = "泉州市",
			qu = "金门县",
		},
		[1321]=
		{
			id = 1321,
			code = 350581,
			name = "福建省",
			city = "泉州市",
			qu = "石狮市",
		},
		[1322]=
		{
			id = 1322,
			code = 350582,
			name = "福建省",
			city = "泉州市",
			qu = "晋江市",
		},
		[1323]=
		{
			id = 1323,
			code = 350583,
			name = "福建省",
			city = "泉州市",
			qu = "南安市",
		},
		[1324]=
		{
			id = 1324,
			code = 350600,
			name = "福建省",
			city = "漳州市",
		},
		[1325]=
		{
			id = 1325,
			code = 350601,
			name = "福建省",
			city = "漳州市",
			qu = "市辖区",
		},
		[1326]=
		{
			id = 1326,
			code = 350602,
			name = "福建省",
			city = "漳州市",
			qu = "芗城区",
		},
		[1327]=
		{
			id = 1327,
			code = 350603,
			name = "福建省",
			city = "漳州市",
			qu = "龙文区",
		},
		[1328]=
		{
			id = 1328,
			code = 350622,
			name = "福建省",
			city = "漳州市",
			qu = "云霄县",
		},
		[1329]=
		{
			id = 1329,
			code = 350623,
			name = "福建省",
			city = "漳州市",
			qu = "漳浦县",
		},
		[1330]=
		{
			id = 1330,
			code = 350624,
			name = "福建省",
			city = "漳州市",
			qu = "诏安县",
		},
		[1331]=
		{
			id = 1331,
			code = 350625,
			name = "福建省",
			city = "漳州市",
			qu = "长泰县",
		},
		[1332]=
		{
			id = 1332,
			code = 350626,
			name = "福建省",
			city = "漳州市",
			qu = "东山县",
		},
		[1333]=
		{
			id = 1333,
			code = 350627,
			name = "福建省",
			city = "漳州市",
			qu = "南靖县",
		},
		[1334]=
		{
			id = 1334,
			code = 350628,
			name = "福建省",
			city = "漳州市",
			qu = "平和县",
		},
		[1335]=
		{
			id = 1335,
			code = 350629,
			name = "福建省",
			city = "漳州市",
			qu = "华安县",
		},
		[1336]=
		{
			id = 1336,
			code = 350681,
			name = "福建省",
			city = "漳州市",
			qu = "龙海市",
		},
		[1337]=
		{
			id = 1337,
			code = 350700,
			name = "福建省",
			city = "南平市",
		},
		[1338]=
		{
			id = 1338,
			code = 350701,
			name = "福建省",
			city = "南平市",
			qu = "市辖区",
		},
		[1339]=
		{
			id = 1339,
			code = 350702,
			name = "福建省",
			city = "南平市",
			qu = "延平区",
		},
		[1340]=
		{
			id = 1340,
			code = 350721,
			name = "福建省",
			city = "南平市",
			qu = "顺昌县",
		},
		[1341]=
		{
			id = 1341,
			code = 350722,
			name = "福建省",
			city = "南平市",
			qu = "浦城县",
		},
		[1342]=
		{
			id = 1342,
			code = 350723,
			name = "福建省",
			city = "南平市",
			qu = "光泽县",
		},
		[1343]=
		{
			id = 1343,
			code = 350724,
			name = "福建省",
			city = "南平市",
			qu = "松溪县",
		},
		[1344]=
		{
			id = 1344,
			code = 350725,
			name = "福建省",
			city = "南平市",
			qu = "政和县",
		},
		[1345]=
		{
			id = 1345,
			code = 350781,
			name = "福建省",
			city = "南平市",
			qu = "邵武市",
		},
		[1346]=
		{
			id = 1346,
			code = 350782,
			name = "福建省",
			city = "南平市",
			qu = "武夷山市",
		},
		[1347]=
		{
			id = 1347,
			code = 350783,
			name = "福建省",
			city = "南平市",
			qu = "建瓯市",
		},
		[1348]=
		{
			id = 1348,
			code = 350784,
			name = "福建省",
			city = "南平市",
			qu = "建阳市",
		},
		[1349]=
		{
			id = 1349,
			code = 350800,
			name = "福建省",
			city = "龙岩市",
		},
		[1350]=
		{
			id = 1350,
			code = 350801,
			name = "福建省",
			city = "龙岩市",
			qu = "市辖区",
		},
		[1351]=
		{
			id = 1351,
			code = 350802,
			name = "福建省",
			city = "龙岩市",
			qu = "新罗区",
		},
		[1352]=
		{
			id = 1352,
			code = 350821,
			name = "福建省",
			city = "龙岩市",
			qu = "长汀县",
		},
		[1353]=
		{
			id = 1353,
			code = 350822,
			name = "福建省",
			city = "龙岩市",
			qu = "永定县",
		},
		[1354]=
		{
			id = 1354,
			code = 350823,
			name = "福建省",
			city = "龙岩市",
			qu = "上杭县",
		},
		[1355]=
		{
			id = 1355,
			code = 350824,
			name = "福建省",
			city = "龙岩市",
			qu = "武平县",
		},
		[1356]=
		{
			id = 1356,
			code = 350825,
			name = "福建省",
			city = "龙岩市",
			qu = "连城县",
		},
		[1357]=
		{
			id = 1357,
			code = 350881,
			name = "福建省",
			city = "龙岩市",
			qu = "漳平市",
		},
		[1358]=
		{
			id = 1358,
			code = 350900,
			name = "福建省",
			city = "宁德市",
		},
		[1359]=
		{
			id = 1359,
			code = 350901,
			name = "福建省",
			city = "宁德市",
			qu = "市辖区",
		},
		[1360]=
		{
			id = 1360,
			code = 350902,
			name = "福建省",
			city = "宁德市",
			qu = "蕉城区",
		},
		[1361]=
		{
			id = 1361,
			code = 350921,
			name = "福建省",
			city = "宁德市",
			qu = "霞浦县",
		},
		[1362]=
		{
			id = 1362,
			code = 350922,
			name = "福建省",
			city = "宁德市",
			qu = "古田县",
		},
		[1363]=
		{
			id = 1363,
			code = 350923,
			name = "福建省",
			city = "宁德市",
			qu = "屏南县",
		},
		[1364]=
		{
			id = 1364,
			code = 350924,
			name = "福建省",
			city = "宁德市",
			qu = "寿宁县",
		},
		[1365]=
		{
			id = 1365,
			code = 350925,
			name = "福建省",
			city = "宁德市",
			qu = "周宁县",
		},
		[1366]=
		{
			id = 1366,
			code = 350926,
			name = "福建省",
			city = "宁德市",
			qu = "柘荣县",
		},
		[1367]=
		{
			id = 1367,
			code = 350981,
			name = "福建省",
			city = "宁德市",
			qu = "福安市",
		},
		[1368]=
		{
			id = 1368,
			code = 350982,
			name = "福建省",
			city = "宁德市",
			qu = "福鼎市",
		},
		[1369]=
		{
			id = 1369,
			code = 360000,
			name = "江西省",
		},
		[1370]=
		{
			id = 1370,
			code = 360100,
			name = "江西省",
			city = "南昌市",
		},
		[1371]=
		{
			id = 1371,
			code = 360101,
			name = "江西省",
			city = "南昌市",
			qu = "市辖区",
		},
		[1372]=
		{
			id = 1372,
			code = 360102,
			name = "江西省",
			city = "南昌市",
			qu = "东湖区",
		},
		[1373]=
		{
			id = 1373,
			code = 360103,
			name = "江西省",
			city = "南昌市",
			qu = "西湖区",
		},
		[1374]=
		{
			id = 1374,
			code = 360104,
			name = "江西省",
			city = "南昌市",
			qu = "青云谱区",
		},
		[1375]=
		{
			id = 1375,
			code = 360105,
			name = "江西省",
			city = "南昌市",
			qu = "湾里区",
		},
		[1376]=
		{
			id = 1376,
			code = 360111,
			name = "江西省",
			city = "南昌市",
			qu = "青山湖区",
		},
		[1377]=
		{
			id = 1377,
			code = 360121,
			name = "江西省",
			city = "南昌市",
			qu = "南昌县",
		},
		[1378]=
		{
			id = 1378,
			code = 360122,
			name = "江西省",
			city = "南昌市",
			qu = "新建县",
		},
		[1379]=
		{
			id = 1379,
			code = 360123,
			name = "江西省",
			city = "南昌市",
			qu = "安义县",
		},
		[1380]=
		{
			id = 1380,
			code = 360124,
			name = "江西省",
			city = "南昌市",
			qu = "进贤县",
		},
		[1381]=
		{
			id = 1381,
			code = 360200,
			name = "江西省",
			city = "景德镇市",
		},
		[1382]=
		{
			id = 1382,
			code = 360201,
			name = "江西省",
			city = "景德镇市",
			qu = "市辖区",
		},
		[1383]=
		{
			id = 1383,
			code = 360202,
			name = "江西省",
			city = "景德镇市",
			qu = "昌江区",
		},
		[1384]=
		{
			id = 1384,
			code = 360203,
			name = "江西省",
			city = "景德镇市",
			qu = "珠山区",
		},
		[1385]=
		{
			id = 1385,
			code = 360222,
			name = "江西省",
			city = "景德镇市",
			qu = "浮梁县",
		},
		[1386]=
		{
			id = 1386,
			code = 360281,
			name = "江西省",
			city = "景德镇市",
			qu = "乐平市",
		},
		[1387]=
		{
			id = 1387,
			code = 360300,
			name = "江西省",
			city = "萍乡市",
		},
		[1388]=
		{
			id = 1388,
			code = 360301,
			name = "江西省",
			city = "萍乡市",
			qu = "市辖区",
		},
		[1389]=
		{
			id = 1389,
			code = 360302,
			name = "江西省",
			city = "萍乡市",
			qu = "安源区",
		},
		[1390]=
		{
			id = 1390,
			code = 360313,
			name = "江西省",
			city = "萍乡市",
			qu = "湘东区",
		},
		[1391]=
		{
			id = 1391,
			code = 360321,
			name = "江西省",
			city = "萍乡市",
			qu = "莲花县",
		},
		[1392]=
		{
			id = 1392,
			code = 360322,
			name = "江西省",
			city = "萍乡市",
			qu = "上栗县",
		},
		[1393]=
		{
			id = 1393,
			code = 360323,
			name = "江西省",
			city = "萍乡市",
			qu = "芦溪县",
		},
		[1394]=
		{
			id = 1394,
			code = 360400,
			name = "江西省",
			city = "九江市",
		},
		[1395]=
		{
			id = 1395,
			code = 360401,
			name = "江西省",
			city = "九江市",
			qu = "市辖区",
		},
		[1396]=
		{
			id = 1396,
			code = 360402,
			name = "江西省",
			city = "九江市",
			qu = "庐山区",
		},
		[1397]=
		{
			id = 1397,
			code = 360403,
			name = "江西省",
			city = "九江市",
			qu = "浔阳区",
		},
		[1398]=
		{
			id = 1398,
			code = 360421,
			name = "江西省",
			city = "九江市",
			qu = "九江县",
		},
		[1399]=
		{
			id = 1399,
			code = 360423,
			name = "江西省",
			city = "九江市",
			qu = "武宁县",
		},
		[1400]=
		{
			id = 1400,
			code = 360424,
			name = "江西省",
			city = "九江市",
			qu = "修水县",
		},
		[1401]=
		{
			id = 1401,
			code = 360425,
			name = "江西省",
			city = "九江市",
			qu = "永修县",
		},
		[1402]=
		{
			id = 1402,
			code = 360426,
			name = "江西省",
			city = "九江市",
			qu = "德安县",
		},
		[1403]=
		{
			id = 1403,
			code = 360427,
			name = "江西省",
			city = "九江市",
			qu = "星子县",
		},
		[1404]=
		{
			id = 1404,
			code = 360428,
			name = "江西省",
			city = "九江市",
			qu = "都昌县",
		},
		[1405]=
		{
			id = 1405,
			code = 360429,
			name = "江西省",
			city = "九江市",
			qu = "湖口县",
		},
		[1406]=
		{
			id = 1406,
			code = 360430,
			name = "江西省",
			city = "九江市",
			qu = "彭泽县",
		},
		[1407]=
		{
			id = 1407,
			code = 360481,
			name = "江西省",
			city = "九江市",
			qu = "瑞昌市",
		},
		[1408]=
		{
			id = 1408,
			code = 360500,
			name = "江西省",
			city = "新余市",
		},
		[1409]=
		{
			id = 1409,
			code = 360501,
			name = "江西省",
			city = "新余市",
			qu = "市辖区",
		},
		[1410]=
		{
			id = 1410,
			code = 360502,
			name = "江西省",
			city = "新余市",
			qu = "渝水区",
		},
		[1411]=
		{
			id = 1411,
			code = 360521,
			name = "江西省",
			city = "新余市",
			qu = "分宜县",
		},
		[1412]=
		{
			id = 1412,
			code = 360600,
			name = "江西省",
			city = "鹰潭市",
		},
		[1413]=
		{
			id = 1413,
			code = 360601,
			name = "江西省",
			city = "鹰潭市",
			qu = "市辖区",
		},
		[1414]=
		{
			id = 1414,
			code = 360602,
			name = "江西省",
			city = "鹰潭市",
			qu = "月湖区",
		},
		[1415]=
		{
			id = 1415,
			code = 360622,
			name = "江西省",
			city = "鹰潭市",
			qu = "余江县",
		},
		[1416]=
		{
			id = 1416,
			code = 360681,
			name = "江西省",
			city = "鹰潭市",
			qu = "贵溪市",
		},
		[1417]=
		{
			id = 1417,
			code = 360700,
			name = "江西省",
			city = "赣州市",
		},
		[1418]=
		{
			id = 1418,
			code = 360701,
			name = "江西省",
			city = "赣州市",
			qu = "市辖区",
		},
		[1419]=
		{
			id = 1419,
			code = 360702,
			name = "江西省",
			city = "赣州市",
			qu = "章贡区",
		},
		[1420]=
		{
			id = 1420,
			code = 360721,
			name = "江西省",
			city = "赣州市",
			qu = "赣县",
		},
		[1421]=
		{
			id = 1421,
			code = 360722,
			name = "江西省",
			city = "赣州市",
			qu = "信丰县",
		},
		[1422]=
		{
			id = 1422,
			code = 360723,
			name = "江西省",
			city = "赣州市",
			qu = "大余县",
		},
		[1423]=
		{
			id = 1423,
			code = 360724,
			name = "江西省",
			city = "赣州市",
			qu = "上犹县",
		},
		[1424]=
		{
			id = 1424,
			code = 360725,
			name = "江西省",
			city = "赣州市",
			qu = "崇义县",
		},
		[1425]=
		{
			id = 1425,
			code = 360726,
			name = "江西省",
			city = "赣州市",
			qu = "安远县",
		},
		[1426]=
		{
			id = 1426,
			code = 360727,
			name = "江西省",
			city = "赣州市",
			qu = "龙南县",
		},
		[1427]=
		{
			id = 1427,
			code = 360728,
			name = "江西省",
			city = "赣州市",
			qu = "定南县",
		},
		[1428]=
		{
			id = 1428,
			code = 360729,
			name = "江西省",
			city = "赣州市",
			qu = "全南县",
		},
		[1429]=
		{
			id = 1429,
			code = 360730,
			name = "江西省",
			city = "赣州市",
			qu = "宁都县",
		},
		[1430]=
		{
			id = 1430,
			code = 360731,
			name = "江西省",
			city = "赣州市",
			qu = "于都县",
		},
		[1431]=
		{
			id = 1431,
			code = 360732,
			name = "江西省",
			city = "赣州市",
			qu = "兴国县",
		},
		[1432]=
		{
			id = 1432,
			code = 360733,
			name = "江西省",
			city = "赣州市",
			qu = "会昌县",
		},
		[1433]=
		{
			id = 1433,
			code = 360734,
			name = "江西省",
			city = "赣州市",
			qu = "寻乌县",
		},
		[1434]=
		{
			id = 1434,
			code = 360735,
			name = "江西省",
			city = "赣州市",
			qu = "石城县",
		},
		[1435]=
		{
			id = 1435,
			code = 360781,
			name = "江西省",
			city = "赣州市",
			qu = "瑞金市",
		},
		[1436]=
		{
			id = 1436,
			code = 360782,
			name = "江西省",
			city = "赣州市",
			qu = "南康市",
		},
		[1437]=
		{
			id = 1437,
			code = 360800,
			name = "江西省",
			city = "吉安市",
		},
		[1438]=
		{
			id = 1438,
			code = 360801,
			name = "江西省",
			city = "吉安市",
			qu = "市辖区",
		},
		[1439]=
		{
			id = 1439,
			code = 360802,
			name = "江西省",
			city = "吉安市",
			qu = "吉州区",
		},
		[1440]=
		{
			id = 1440,
			code = 360803,
			name = "江西省",
			city = "吉安市",
			qu = "青原区",
		},
		[1441]=
		{
			id = 1441,
			code = 360821,
			name = "江西省",
			city = "吉安市",
			qu = "吉安县",
		},
		[1442]=
		{
			id = 1442,
			code = 360822,
			name = "江西省",
			city = "吉安市",
			qu = "吉水县",
		},
		[1443]=
		{
			id = 1443,
			code = 360823,
			name = "江西省",
			city = "吉安市",
			qu = "峡江县",
		},
		[1444]=
		{
			id = 1444,
			code = 360824,
			name = "江西省",
			city = "吉安市",
			qu = "新干县",
		},
		[1445]=
		{
			id = 1445,
			code = 360825,
			name = "江西省",
			city = "吉安市",
			qu = "永丰县",
		},
		[1446]=
		{
			id = 1446,
			code = 360826,
			name = "江西省",
			city = "吉安市",
			qu = "泰和县",
		},
		[1447]=
		{
			id = 1447,
			code = 360827,
			name = "江西省",
			city = "吉安市",
			qu = "遂川县",
		},
		[1448]=
		{
			id = 1448,
			code = 360828,
			name = "江西省",
			city = "吉安市",
			qu = "万安县",
		},
		[1449]=
		{
			id = 1449,
			code = 360829,
			name = "江西省",
			city = "吉安市",
			qu = "安福县",
		},
		[1450]=
		{
			id = 1450,
			code = 360830,
			name = "江西省",
			city = "吉安市",
			qu = "永新县",
		},
		[1451]=
		{
			id = 1451,
			code = 360881,
			name = "江西省",
			city = "吉安市",
			qu = "井冈山市",
		},
		[1452]=
		{
			id = 1452,
			code = 360900,
			name = "江西省",
			city = "宜春市",
		},
		[1453]=
		{
			id = 1453,
			code = 360901,
			name = "江西省",
			city = "宜春市",
			qu = "市辖区",
		},
		[1454]=
		{
			id = 1454,
			code = 360902,
			name = "江西省",
			city = "宜春市",
			qu = "袁州区",
		},
		[1455]=
		{
			id = 1455,
			code = 360921,
			name = "江西省",
			city = "宜春市",
			qu = "奉新县",
		},
		[1456]=
		{
			id = 1456,
			code = 360922,
			name = "江西省",
			city = "宜春市",
			qu = "万载县",
		},
		[1457]=
		{
			id = 1457,
			code = 360923,
			name = "江西省",
			city = "宜春市",
			qu = "上高县",
		},
		[1458]=
		{
			id = 1458,
			code = 360924,
			name = "江西省",
			city = "宜春市",
			qu = "宜丰县",
		},
		[1459]=
		{
			id = 1459,
			code = 360925,
			name = "江西省",
			city = "宜春市",
			qu = "靖安县",
		},
		[1460]=
		{
			id = 1460,
			code = 360926,
			name = "江西省",
			city = "宜春市",
			qu = "铜鼓县",
		},
		[1461]=
		{
			id = 1461,
			code = 360981,
			name = "江西省",
			city = "宜春市",
			qu = "丰城市",
		},
		[1462]=
		{
			id = 1462,
			code = 360982,
			name = "江西省",
			city = "宜春市",
			qu = "樟树市",
		},
		[1463]=
		{
			id = 1463,
			code = 360983,
			name = "江西省",
			city = "宜春市",
			qu = "高安市",
		},
		[1464]=
		{
			id = 1464,
			code = 361000,
			name = "江西省",
			city = "抚州市",
		},
		[1465]=
		{
			id = 1465,
			code = 361001,
			name = "江西省",
			city = "抚州市",
			qu = "市辖区",
		},
		[1466]=
		{
			id = 1466,
			code = 361002,
			name = "江西省",
			city = "抚州市",
			qu = "临川区",
		},
		[1467]=
		{
			id = 1467,
			code = 361021,
			name = "江西省",
			city = "抚州市",
			qu = "南城县",
		},
		[1468]=
		{
			id = 1468,
			code = 361022,
			name = "江西省",
			city = "抚州市",
			qu = "黎川县",
		},
		[1469]=
		{
			id = 1469,
			code = 361023,
			name = "江西省",
			city = "抚州市",
			qu = "南丰县",
		},
		[1470]=
		{
			id = 1470,
			code = 361024,
			name = "江西省",
			city = "抚州市",
			qu = "崇仁县",
		},
		[1471]=
		{
			id = 1471,
			code = 361025,
			name = "江西省",
			city = "抚州市",
			qu = "乐安县",
		},
		[1472]=
		{
			id = 1472,
			code = 361026,
			name = "江西省",
			city = "抚州市",
			qu = "宜黄县",
		},
		[1473]=
		{
			id = 1473,
			code = 361027,
			name = "江西省",
			city = "抚州市",
			qu = "金溪县",
		},
		[1474]=
		{
			id = 1474,
			code = 361028,
			name = "江西省",
			city = "抚州市",
			qu = "资溪县",
		},
		[1475]=
		{
			id = 1475,
			code = 361029,
			name = "江西省",
			city = "抚州市",
			qu = "东乡县",
		},
		[1476]=
		{
			id = 1476,
			code = 361030,
			name = "江西省",
			city = "抚州市",
			qu = "广昌县",
		},
		[1477]=
		{
			id = 1477,
			code = 361100,
			name = "江西省",
			city = "上饶市",
		},
		[1478]=
		{
			id = 1478,
			code = 361101,
			name = "江西省",
			city = "上饶市",
			qu = "市辖区",
		},
		[1479]=
		{
			id = 1479,
			code = 361102,
			name = "江西省",
			city = "上饶市",
			qu = "信州区",
		},
		[1480]=
		{
			id = 1480,
			code = 361121,
			name = "江西省",
			city = "上饶市",
			qu = "上饶县",
		},
		[1481]=
		{
			id = 1481,
			code = 361122,
			name = "江西省",
			city = "上饶市",
			qu = "广丰县",
		},
		[1482]=
		{
			id = 1482,
			code = 361123,
			name = "江西省",
			city = "上饶市",
			qu = "玉山县",
		},
		[1483]=
		{
			id = 1483,
			code = 361124,
			name = "江西省",
			city = "上饶市",
			qu = "铅山县",
		},
		[1484]=
		{
			id = 1484,
			code = 361125,
			name = "江西省",
			city = "上饶市",
			qu = "横峰县",
		},
		[1485]=
		{
			id = 1485,
			code = 361126,
			name = "江西省",
			city = "上饶市",
			qu = "弋阳县",
		},
		[1486]=
		{
			id = 1486,
			code = 361127,
			name = "江西省",
			city = "上饶市",
			qu = "余干县",
		},
		[1487]=
		{
			id = 1487,
			code = 361128,
			name = "江西省",
			city = "上饶市",
			qu = "鄱阳县",
		},
		[1488]=
		{
			id = 1488,
			code = 361129,
			name = "江西省",
			city = "上饶市",
			qu = "万年县",
		},
		[1489]=
		{
			id = 1489,
			code = 361130,
			name = "江西省",
			city = "上饶市",
			qu = "婺源县",
		},
		[1490]=
		{
			id = 1490,
			code = 361181,
			name = "江西省",
			city = "上饶市",
			qu = "德兴市",
		},
		[1491]=
		{
			id = 1491,
			code = 370000,
			name = "山东省",
		},
		[1492]=
		{
			id = 1492,
			code = 370100,
			name = "山东省",
			city = "济南市",
		},
		[1493]=
		{
			id = 1493,
			code = 370101,
			name = "山东省",
			city = "济南市",
			qu = "市辖区",
		},
		[1494]=
		{
			id = 1494,
			code = 370102,
			name = "山东省",
			city = "济南市",
			qu = "历下区",
		},
		[1495]=
		{
			id = 1495,
			code = 370103,
			name = "山东省",
			city = "济南市",
			qu = "市中区",
		},
		[1496]=
		{
			id = 1496,
			code = 370104,
			name = "山东省",
			city = "济南市",
			qu = "槐荫区",
		},
		[1497]=
		{
			id = 1497,
			code = 370105,
			name = "山东省",
			city = "济南市",
			qu = "天桥区",
		},
		[1498]=
		{
			id = 1498,
			code = 370112,
			name = "山东省",
			city = "济南市",
			qu = "历城区",
		},
		[1499]=
		{
			id = 1499,
			code = 370113,
			name = "山东省",
			city = "济南市",
			qu = "长清区",
		},
		[1500]=
		{
			id = 1500,
			code = 370124,
			name = "山东省",
			city = "济南市",
			qu = "平阴县",
		},
		[1501]=
		{
			id = 1501,
			code = 370125,
			name = "山东省",
			city = "济南市",
			qu = "济阳县",
		},
		[1502]=
		{
			id = 1502,
			code = 370126,
			name = "山东省",
			city = "济南市",
			qu = "商河县",
		},
		[1503]=
		{
			id = 1503,
			code = 370181,
			name = "山东省",
			city = "济南市",
			qu = "章丘市",
		},
		[1504]=
		{
			id = 1504,
			code = 370200,
			name = "山东省",
			city = "青岛市",
		},
		[1505]=
		{
			id = 1505,
			code = 370201,
			name = "山东省",
			city = "青岛市",
			qu = "市辖区",
		},
		[1506]=
		{
			id = 1506,
			code = 370202,
			name = "山东省",
			city = "青岛市",
			qu = "市南区",
		},
		[1507]=
		{
			id = 1507,
			code = 370203,
			name = "山东省",
			city = "青岛市",
			qu = "市北区",
		},
		[1508]=
		{
			id = 1508,
			code = 370205,
			name = "山东省",
			city = "青岛市",
			qu = "四方区",
		},
		[1509]=
		{
			id = 1509,
			code = 370211,
			name = "山东省",
			city = "青岛市",
			qu = "黄岛区",
		},
		[1510]=
		{
			id = 1510,
			code = 370212,
			name = "山东省",
			city = "青岛市",
			qu = "崂山区",
		},
		[1511]=
		{
			id = 1511,
			code = 370213,
			name = "山东省",
			city = "青岛市",
			qu = "李沧区",
		},
		[1512]=
		{
			id = 1512,
			code = 370214,
			name = "山东省",
			city = "青岛市",
			qu = "城阳区",
		},
		[1513]=
		{
			id = 1513,
			code = 370281,
			name = "山东省",
			city = "青岛市",
			qu = "胶州市",
		},
		[1514]=
		{
			id = 1514,
			code = 370282,
			name = "山东省",
			city = "青岛市",
			qu = "即墨市",
		},
		[1515]=
		{
			id = 1515,
			code = 370283,
			name = "山东省",
			city = "青岛市",
			qu = "平度市",
		},
		[1516]=
		{
			id = 1516,
			code = 370284,
			name = "山东省",
			city = "青岛市",
			qu = "胶南市",
		},
		[1517]=
		{
			id = 1517,
			code = 370285,
			name = "山东省",
			city = "青岛市",
			qu = "莱西市",
		},
		[1518]=
		{
			id = 1518,
			code = 370300,
			name = "山东省",
			city = "淄博市",
		},
		[1519]=
		{
			id = 1519,
			code = 370301,
			name = "山东省",
			city = "淄博市",
			qu = "市辖区",
		},
		[1520]=
		{
			id = 1520,
			code = 370302,
			name = "山东省",
			city = "淄博市",
			qu = "淄川区",
		},
		[1521]=
		{
			id = 1521,
			code = 370303,
			name = "山东省",
			city = "淄博市",
			qu = "张店区",
		},
		[1522]=
		{
			id = 1522,
			code = 370304,
			name = "山东省",
			city = "淄博市",
			qu = "博山区",
		},
		[1523]=
		{
			id = 1523,
			code = 370305,
			name = "山东省",
			city = "淄博市",
			qu = "临淄区",
		},
		[1524]=
		{
			id = 1524,
			code = 370306,
			name = "山东省",
			city = "淄博市",
			qu = "周村区",
		},
		[1525]=
		{
			id = 1525,
			code = 370321,
			name = "山东省",
			city = "淄博市",
			qu = "桓台县",
		},
		[1526]=
		{
			id = 1526,
			code = 370322,
			name = "山东省",
			city = "淄博市",
			qu = "高青县",
		},
		[1527]=
		{
			id = 1527,
			code = 370323,
			name = "山东省",
			city = "淄博市",
			qu = "沂源县",
		},
		[1528]=
		{
			id = 1528,
			code = 370400,
			name = "山东省",
			city = "枣庄市",
		},
		[1529]=
		{
			id = 1529,
			code = 370401,
			name = "山东省",
			city = "枣庄市",
			qu = "市辖区",
		},
		[1530]=
		{
			id = 1530,
			code = 370402,
			name = "山东省",
			city = "枣庄市",
			qu = "市中区",
		},
		[1531]=
		{
			id = 1531,
			code = 370403,
			name = "山东省",
			city = "枣庄市",
			qu = "薛城区",
		},
		[1532]=
		{
			id = 1532,
			code = 370404,
			name = "山东省",
			city = "枣庄市",
			qu = "峄城区",
		},
		[1533]=
		{
			id = 1533,
			code = 370405,
			name = "山东省",
			city = "枣庄市",
			qu = "台儿庄区",
		},
		[1534]=
		{
			id = 1534,
			code = 370406,
			name = "山东省",
			city = "枣庄市",
			qu = "山亭区",
		},
		[1535]=
		{
			id = 1535,
			code = 370481,
			name = "山东省",
			city = "枣庄市",
			qu = "滕州市",
		},
		[1536]=
		{
			id = 1536,
			code = 370500,
			name = "山东省",
			city = "东营市",
		},
		[1537]=
		{
			id = 1537,
			code = 370501,
			name = "山东省",
			city = "东营市",
			qu = "市辖区",
		},
		[1538]=
		{
			id = 1538,
			code = 370502,
			name = "山东省",
			city = "东营市",
			qu = "东营区",
		},
		[1539]=
		{
			id = 1539,
			code = 370503,
			name = "山东省",
			city = "东营市",
			qu = "河口区",
		},
		[1540]=
		{
			id = 1540,
			code = 370521,
			name = "山东省",
			city = "东营市",
			qu = "垦利县",
		},
		[1541]=
		{
			id = 1541,
			code = 370522,
			name = "山东省",
			city = "东营市",
			qu = "利津县",
		},
		[1542]=
		{
			id = 1542,
			code = 370523,
			name = "山东省",
			city = "东营市",
			qu = "广饶县",
		},
		[1543]=
		{
			id = 1543,
			code = 370600,
			name = "山东省",
			city = "烟台市",
		},
		[1544]=
		{
			id = 1544,
			code = 370601,
			name = "山东省",
			city = "烟台市",
			qu = "市辖区",
		},
		[1545]=
		{
			id = 1545,
			code = 370602,
			name = "山东省",
			city = "烟台市",
			qu = "芝罘区",
		},
		[1546]=
		{
			id = 1546,
			code = 370611,
			name = "山东省",
			city = "烟台市",
			qu = "福山区",
		},
		[1547]=
		{
			id = 1547,
			code = 370612,
			name = "山东省",
			city = "烟台市",
			qu = "牟平区",
		},
		[1548]=
		{
			id = 1548,
			code = 370613,
			name = "山东省",
			city = "烟台市",
			qu = "莱山区",
		},
		[1549]=
		{
			id = 1549,
			code = 370634,
			name = "山东省",
			city = "烟台市",
			qu = "长岛县",
		},
		[1550]=
		{
			id = 1550,
			code = 370681,
			name = "山东省",
			city = "烟台市",
			qu = "龙口市",
		},
		[1551]=
		{
			id = 1551,
			code = 370682,
			name = "山东省",
			city = "烟台市",
			qu = "莱阳市",
		},
		[1552]=
		{
			id = 1552,
			code = 370683,
			name = "山东省",
			city = "烟台市",
			qu = "莱州市",
		},
		[1553]=
		{
			id = 1553,
			code = 370684,
			name = "山东省",
			city = "烟台市",
			qu = "蓬莱市",
		},
		[1554]=
		{
			id = 1554,
			code = 370685,
			name = "山东省",
			city = "烟台市",
			qu = "招远市",
		},
		[1555]=
		{
			id = 1555,
			code = 370686,
			name = "山东省",
			city = "烟台市",
			qu = "栖霞市",
		},
		[1556]=
		{
			id = 1556,
			code = 370687,
			name = "山东省",
			city = "烟台市",
			qu = "海阳市",
		},
		[1557]=
		{
			id = 1557,
			code = 370700,
			name = "山东省",
			city = "潍坊市",
		},
		[1558]=
		{
			id = 1558,
			code = 370701,
			name = "山东省",
			city = "潍坊市",
			qu = "市辖区",
		},
		[1559]=
		{
			id = 1559,
			code = 370702,
			name = "山东省",
			city = "潍坊市",
			qu = "潍城区",
		},
		[1560]=
		{
			id = 1560,
			code = 370703,
			name = "山东省",
			city = "潍坊市",
			qu = "寒亭区",
		},
		[1561]=
		{
			id = 1561,
			code = 370704,
			name = "山东省",
			city = "潍坊市",
			qu = "坊子区",
		},
		[1562]=
		{
			id = 1562,
			code = 370705,
			name = "山东省",
			city = "潍坊市",
			qu = "奎文区",
		},
		[1563]=
		{
			id = 1563,
			code = 370724,
			name = "山东省",
			city = "潍坊市",
			qu = "临朐县",
		},
		[1564]=
		{
			id = 1564,
			code = 370725,
			name = "山东省",
			city = "潍坊市",
			qu = "昌乐县",
		},
		[1565]=
		{
			id = 1565,
			code = 370781,
			name = "山东省",
			city = "潍坊市",
			qu = "青州市",
		},
		[1566]=
		{
			id = 1566,
			code = 370782,
			name = "山东省",
			city = "潍坊市",
			qu = "诸城市",
		},
		[1567]=
		{
			id = 1567,
			code = 370783,
			name = "山东省",
			city = "潍坊市",
			qu = "寿光市",
		},
		[1568]=
		{
			id = 1568,
			code = 370784,
			name = "山东省",
			city = "潍坊市",
			qu = "安丘市",
		},
		[1569]=
		{
			id = 1569,
			code = 370785,
			name = "山东省",
			city = "潍坊市",
			qu = "高密市",
		},
		[1570]=
		{
			id = 1570,
			code = 370786,
			name = "山东省",
			city = "潍坊市",
			qu = "昌邑市",
		},
		[1571]=
		{
			id = 1571,
			code = 370800,
			name = "山东省",
			city = "济宁市",
		},
		[1572]=
		{
			id = 1572,
			code = 370801,
			name = "山东省",
			city = "济宁市",
			qu = "市辖区",
		},
		[1573]=
		{
			id = 1573,
			code = 370802,
			name = "山东省",
			city = "济宁市",
			qu = "市中区",
		},
		[1574]=
		{
			id = 1574,
			code = 370811,
			name = "山东省",
			city = "济宁市",
			qu = "任城区",
		},
		[1575]=
		{
			id = 1575,
			code = 370826,
			name = "山东省",
			city = "济宁市",
			qu = "微山县",
		},
		[1576]=
		{
			id = 1576,
			code = 370827,
			name = "山东省",
			city = "济宁市",
			qu = "鱼台县",
		},
		[1577]=
		{
			id = 1577,
			code = 370828,
			name = "山东省",
			city = "济宁市",
			qu = "金乡县",
		},
		[1578]=
		{
			id = 1578,
			code = 370829,
			name = "山东省",
			city = "济宁市",
			qu = "嘉祥县",
		},
		[1579]=
		{
			id = 1579,
			code = 370830,
			name = "山东省",
			city = "济宁市",
			qu = "汶上县",
		},
		[1580]=
		{
			id = 1580,
			code = 370831,
			name = "山东省",
			city = "济宁市",
			qu = "泗水县",
		},
		[1581]=
		{
			id = 1581,
			code = 370832,
			name = "山东省",
			city = "济宁市",
			qu = "梁山县",
		},
		[1582]=
		{
			id = 1582,
			code = 370881,
			name = "山东省",
			city = "济宁市",
			qu = "曲阜市",
		},
		[1583]=
		{
			id = 1583,
			code = 370882,
			name = "山东省",
			city = "济宁市",
			qu = "兖州市",
		},
		[1584]=
		{
			id = 1584,
			code = 370883,
			name = "山东省",
			city = "济宁市",
			qu = "邹城市",
		},
		[1585]=
		{
			id = 1585,
			code = 370900,
			name = "山东省",
			city = "泰安市",
		},
		[1586]=
		{
			id = 1586,
			code = 370901,
			name = "山东省",
			city = "泰安市",
			qu = "市辖区",
		},
		[1587]=
		{
			id = 1587,
			code = 370902,
			name = "山东省",
			city = "泰安市",
			qu = "泰山区",
		},
		[1588]=
		{
			id = 1588,
			code = 370911,
			name = "山东省",
			city = "泰安市",
			qu = "岱岳区",
		},
		[1589]=
		{
			id = 1589,
			code = 370921,
			name = "山东省",
			city = "泰安市",
			qu = "宁阳县",
		},
		[1590]=
		{
			id = 1590,
			code = 370923,
			name = "山东省",
			city = "泰安市",
			qu = "东平县",
		},
		[1591]=
		{
			id = 1591,
			code = 370982,
			name = "山东省",
			city = "泰安市",
			qu = "新泰市",
		},
		[1592]=
		{
			id = 1592,
			code = 370983,
			name = "山东省",
			city = "泰安市",
			qu = "肥城市",
		},
		[1593]=
		{
			id = 1593,
			code = 371000,
			name = "山东省",
			city = "威海市",
		},
		[1594]=
		{
			id = 1594,
			code = 371001,
			name = "山东省",
			city = "威海市",
			qu = "市辖区",
		},
		[1595]=
		{
			id = 1595,
			code = 371002,
			name = "山东省",
			city = "威海市",
			qu = "环翠区",
		},
		[1596]=
		{
			id = 1596,
			code = 371081,
			name = "山东省",
			city = "威海市",
			qu = "文登市",
		},
		[1597]=
		{
			id = 1597,
			code = 371082,
			name = "山东省",
			city = "威海市",
			qu = "荣成市",
		},
		[1598]=
		{
			id = 1598,
			code = 371083,
			name = "山东省",
			city = "威海市",
			qu = "乳山市",
		},
		[1599]=
		{
			id = 1599,
			code = 371100,
			name = "山东省",
			city = "日照市",
		},
		[1600]=
		{
			id = 1600,
			code = 371101,
			name = "山东省",
			city = "日照市",
			qu = "市辖区",
		},
		[1601]=
		{
			id = 1601,
			code = 371102,
			name = "山东省",
			city = "日照市",
			qu = "东港区",
		},
		[1602]=
		{
			id = 1602,
			code = 371103,
			name = "山东省",
			city = "日照市",
			qu = "岚山区",
		},
		[1603]=
		{
			id = 1603,
			code = 371121,
			name = "山东省",
			city = "日照市",
			qu = "五莲县",
		},
		[1604]=
		{
			id = 1604,
			code = 371122,
			name = "山东省",
			city = "日照市",
			qu = "莒县",
		},
		[1605]=
		{
			id = 1605,
			code = 371200,
			name = "山东省",
			city = "莱芜市",
		},
		[1606]=
		{
			id = 1606,
			code = 371201,
			name = "山东省",
			city = "莱芜市",
			qu = "市辖区",
		},
		[1607]=
		{
			id = 1607,
			code = 371202,
			name = "山东省",
			city = "莱芜市",
			qu = "莱城区",
		},
		[1608]=
		{
			id = 1608,
			code = 371203,
			name = "山东省",
			city = "莱芜市",
			qu = "钢城区",
		},
		[1609]=
		{
			id = 1609,
			code = 371300,
			name = "山东省",
			city = "临沂市",
		},
		[1610]=
		{
			id = 1610,
			code = 371301,
			name = "山东省",
			city = "临沂市",
			qu = "市辖区",
		},
		[1611]=
		{
			id = 1611,
			code = 371302,
			name = "山东省",
			city = "临沂市",
			qu = "兰山区",
		},
		[1612]=
		{
			id = 1612,
			code = 371311,
			name = "山东省",
			city = "临沂市",
			qu = "罗庄区",
		},
		[1613]=
		{
			id = 1613,
			code = 371312,
			name = "山东省",
			city = "临沂市",
			qu = "河东区",
		},
		[1614]=
		{
			id = 1614,
			code = 371321,
			name = "山东省",
			city = "临沂市",
			qu = "沂南县",
		},
		[1615]=
		{
			id = 1615,
			code = 371322,
			name = "山东省",
			city = "临沂市",
			qu = "郯城县",
		},
		[1616]=
		{
			id = 1616,
			code = 371323,
			name = "山东省",
			city = "临沂市",
			qu = "沂水县",
		},
		[1617]=
		{
			id = 1617,
			code = 371324,
			name = "山东省",
			city = "临沂市",
			qu = "苍山县",
		},
		[1618]=
		{
			id = 1618,
			code = 371325,
			name = "山东省",
			city = "临沂市",
			qu = "费县",
		},
		[1619]=
		{
			id = 1619,
			code = 371326,
			name = "山东省",
			city = "临沂市",
			qu = "平邑县",
		},
		[1620]=
		{
			id = 1620,
			code = 371327,
			name = "山东省",
			city = "临沂市",
			qu = "莒南县",
		},
		[1621]=
		{
			id = 1621,
			code = 371328,
			name = "山东省",
			city = "临沂市",
			qu = "蒙阴县",
		},
		[1622]=
		{
			id = 1622,
			code = 371329,
			name = "山东省",
			city = "临沂市",
			qu = "临沭县",
		},
		[1623]=
		{
			id = 1623,
			code = 371400,
			name = "山东省",
			city = "德州市",
		},
		[1624]=
		{
			id = 1624,
			code = 371401,
			name = "山东省",
			city = "德州市",
			qu = "市辖区",
		},
		[1625]=
		{
			id = 1625,
			code = 371402,
			name = "山东省",
			city = "德州市",
			qu = "德城区",
		},
		[1626]=
		{
			id = 1626,
			code = 371421,
			name = "山东省",
			city = "德州市",
			qu = "陵县",
		},
		[1627]=
		{
			id = 1627,
			code = 371422,
			name = "山东省",
			city = "德州市",
			qu = "宁津县",
		},
		[1628]=
		{
			id = 1628,
			code = 371423,
			name = "山东省",
			city = "德州市",
			qu = "庆云县",
		},
		[1629]=
		{
			id = 1629,
			code = 371424,
			name = "山东省",
			city = "德州市",
			qu = "临邑县",
		},
		[1630]=
		{
			id = 1630,
			code = 371425,
			name = "山东省",
			city = "德州市",
			qu = "齐河县",
		},
		[1631]=
		{
			id = 1631,
			code = 371426,
			name = "山东省",
			city = "德州市",
			qu = "平原县",
		},
		[1632]=
		{
			id = 1632,
			code = 371427,
			name = "山东省",
			city = "德州市",
			qu = "夏津县",
		},
		[1633]=
		{
			id = 1633,
			code = 371428,
			name = "山东省",
			city = "德州市",
			qu = "武城县",
		},
		[1634]=
		{
			id = 1634,
			code = 371481,
			name = "山东省",
			city = "德州市",
			qu = "乐陵市",
		},
		[1635]=
		{
			id = 1635,
			code = 371482,
			name = "山东省",
			city = "德州市",
			qu = "禹城市",
		},
		[1636]=
		{
			id = 1636,
			code = 371500,
			name = "山东省",
			city = "聊城市",
		},
		[1637]=
		{
			id = 1637,
			code = 371501,
			name = "山东省",
			city = "聊城市",
			qu = "市辖区",
		},
		[1638]=
		{
			id = 1638,
			code = 371502,
			name = "山东省",
			city = "聊城市",
			qu = "东昌府区",
		},
		[1639]=
		{
			id = 1639,
			code = 371521,
			name = "山东省",
			city = "聊城市",
			qu = "阳谷县",
		},
		[1640]=
		{
			id = 1640,
			code = 371522,
			name = "山东省",
			city = "聊城市",
			qu = "莘县",
		},
		[1641]=
		{
			id = 1641,
			code = 371523,
			name = "山东省",
			city = "聊城市",
			qu = "茌平县",
		},
		[1642]=
		{
			id = 1642,
			code = 371524,
			name = "山东省",
			city = "聊城市",
			qu = "东阿县",
		},
		[1643]=
		{
			id = 1643,
			code = 371525,
			name = "山东省",
			city = "聊城市",
			qu = "冠县",
		},
		[1644]=
		{
			id = 1644,
			code = 371526,
			name = "山东省",
			city = "聊城市",
			qu = "高唐县",
		},
		[1645]=
		{
			id = 1645,
			code = 371581,
			name = "山东省",
			city = "聊城市",
			qu = "临清市",
		},
		[1646]=
		{
			id = 1646,
			code = 371600,
			name = "山东省",
			city = "滨州市",
		},
		[1647]=
		{
			id = 1647,
			code = 371601,
			name = "山东省",
			city = "滨州市",
			qu = "市辖区",
		},
		[1648]=
		{
			id = 1648,
			code = 371602,
			name = "山东省",
			city = "滨州市",
			qu = "滨城区",
		},
		[1649]=
		{
			id = 1649,
			code = 371621,
			name = "山东省",
			city = "滨州市",
			qu = "惠民县",
		},
		[1650]=
		{
			id = 1650,
			code = 371622,
			name = "山东省",
			city = "滨州市",
			qu = "阳信县",
		},
		[1651]=
		{
			id = 1651,
			code = 371623,
			name = "山东省",
			city = "滨州市",
			qu = "无棣县",
		},
		[1652]=
		{
			id = 1652,
			code = 371624,
			name = "山东省",
			city = "滨州市",
			qu = "沾化县",
		},
		[1653]=
		{
			id = 1653,
			code = 371625,
			name = "山东省",
			city = "滨州市",
			qu = "博兴县",
		},
		[1654]=
		{
			id = 1654,
			code = 371626,
			name = "山东省",
			city = "滨州市",
			qu = "邹平县",
		},
		[1655]=
		{
			id = 1655,
			code = 371700,
			name = "山东省",
			city = "菏泽市",
		},
		[1656]=
		{
			id = 1656,
			code = 371701,
			name = "山东省",
			city = "菏泽市",
			qu = "市辖区",
		},
		[1657]=
		{
			id = 1657,
			code = 371702,
			name = "山东省",
			city = "菏泽市",
			qu = "牡丹区",
		},
		[1658]=
		{
			id = 1658,
			code = 371721,
			name = "山东省",
			city = "菏泽市",
			qu = "曹县",
		},
		[1659]=
		{
			id = 1659,
			code = 371722,
			name = "山东省",
			city = "菏泽市",
			qu = "单县",
		},
		[1660]=
		{
			id = 1660,
			code = 371723,
			name = "山东省",
			city = "菏泽市",
			qu = "成武县",
		},
		[1661]=
		{
			id = 1661,
			code = 371724,
			name = "山东省",
			city = "菏泽市",
			qu = "巨野县",
		},
		[1662]=
		{
			id = 1662,
			code = 371725,
			name = "山东省",
			city = "菏泽市",
			qu = "郓城县",
		},
		[1663]=
		{
			id = 1663,
			code = 371726,
			name = "山东省",
			city = "菏泽市",
			qu = "鄄城县",
		},
		[1664]=
		{
			id = 1664,
			code = 371727,
			name = "山东省",
			city = "菏泽市",
			qu = "定陶县",
		},
		[1665]=
		{
			id = 1665,
			code = 371728,
			name = "山东省",
			city = "菏泽市",
			qu = "东明县",
		},
		[1666]=
		{
			id = 1666,
			code = 410000,
			name = "河南省",
		},
		[1667]=
		{
			id = 1667,
			code = 410100,
			name = "河南省",
			city = "郑州市",
		},
		[1668]=
		{
			id = 1668,
			code = 410101,
			name = "河南省",
			city = "郑州市",
			qu = "市辖区",
		},
		[1669]=
		{
			id = 1669,
			code = 410102,
			name = "河南省",
			city = "郑州市",
			qu = "中原区",
		},
		[1670]=
		{
			id = 1670,
			code = 410103,
			name = "河南省",
			city = "郑州市",
			qu = "二七区",
		},
		[1671]=
		{
			id = 1671,
			code = 410104,
			name = "河南省",
			city = "郑州市",
			qu = "管城回族区",
		},
		[1672]=
		{
			id = 1672,
			code = 410105,
			name = "河南省",
			city = "郑州市",
			qu = "金水区",
		},
		[1673]=
		{
			id = 1673,
			code = 410106,
			name = "河南省",
			city = "郑州市",
			qu = "上街区",
		},
		[1674]=
		{
			id = 1674,
			code = 410108,
			name = "河南省",
			city = "郑州市",
			qu = "惠济区",
		},
		[1675]=
		{
			id = 1675,
			code = 410122,
			name = "河南省",
			city = "郑州市",
			qu = "中牟县",
		},
		[1676]=
		{
			id = 1676,
			code = 410181,
			name = "河南省",
			city = "郑州市",
			qu = "巩义市",
		},
		[1677]=
		{
			id = 1677,
			code = 410182,
			name = "河南省",
			city = "郑州市",
			qu = "荥阳市",
		},
		[1678]=
		{
			id = 1678,
			code = 410183,
			name = "河南省",
			city = "郑州市",
			qu = "新密市",
		},
		[1679]=
		{
			id = 1679,
			code = 410184,
			name = "河南省",
			city = "郑州市",
			qu = "新郑市",
		},
		[1680]=
		{
			id = 1680,
			code = 410185,
			name = "河南省",
			city = "郑州市",
			qu = "登封市",
		},
		[1681]=
		{
			id = 1681,
			code = 410200,
			name = "河南省",
			city = "开封市",
		},
		[1682]=
		{
			id = 1682,
			code = 410201,
			name = "河南省",
			city = "开封市",
			qu = "市辖区",
		},
		[1683]=
		{
			id = 1683,
			code = 410202,
			name = "河南省",
			city = "开封市",
			qu = "龙亭区",
		},
		[1684]=
		{
			id = 1684,
			code = 410203,
			name = "河南省",
			city = "开封市",
			qu = "顺河回族区",
		},
		[1685]=
		{
			id = 1685,
			code = 410204,
			name = "河南省",
			city = "开封市",
			qu = "鼓楼区",
		},
		[1686]=
		{
			id = 1686,
			code = 410205,
			name = "河南省",
			city = "开封市",
			qu = "禹王台区",
		},
		[1687]=
		{
			id = 1687,
			code = 410211,
			name = "河南省",
			city = "开封市",
			qu = "金明区",
		},
		[1688]=
		{
			id = 1688,
			code = 410221,
			name = "河南省",
			city = "开封市",
			qu = "杞县",
		},
		[1689]=
		{
			id = 1689,
			code = 410222,
			name = "河南省",
			city = "开封市",
			qu = "通许县",
		},
		[1690]=
		{
			id = 1690,
			code = 410223,
			name = "河南省",
			city = "开封市",
			qu = "尉氏县",
		},
		[1691]=
		{
			id = 1691,
			code = 410224,
			name = "河南省",
			city = "开封市",
			qu = "开封县",
		},
		[1692]=
		{
			id = 1692,
			code = 410225,
			name = "河南省",
			city = "开封市",
			qu = "兰考县",
		},
		[1693]=
		{
			id = 1693,
			code = 410300,
			name = "河南省",
			city = "洛阳市",
		},
		[1694]=
		{
			id = 1694,
			code = 410301,
			name = "河南省",
			city = "洛阳市",
			qu = "市辖区",
		},
		[1695]=
		{
			id = 1695,
			code = 410302,
			name = "河南省",
			city = "洛阳市",
			qu = "老城区",
		},
		[1696]=
		{
			id = 1696,
			code = 410303,
			name = "河南省",
			city = "洛阳市",
			qu = "西工区",
		},
		[1697]=
		{
			id = 1697,
			code = 410304,
			name = "河南省",
			city = "洛阳市",
			qu = "瀍河回族区",
		},
		[1698]=
		{
			id = 1698,
			code = 410305,
			name = "河南省",
			city = "洛阳市",
			qu = "涧西区",
		},
		[1699]=
		{
			id = 1699,
			code = 410306,
			name = "河南省",
			city = "洛阳市",
			qu = "吉利区",
		},
		[1700]=
		{
			id = 1700,
			code = 410311,
			name = "河南省",
			city = "洛阳市",
			qu = "洛龙区",
		},
		[1701]=
		{
			id = 1701,
			code = 410322,
			name = "河南省",
			city = "洛阳市",
			qu = "孟津县",
		},
		[1702]=
		{
			id = 1702,
			code = 410323,
			name = "河南省",
			city = "洛阳市",
			qu = "新安县",
		},
		[1703]=
		{
			id = 1703,
			code = 410324,
			name = "河南省",
			city = "洛阳市",
			qu = "栾川县",
		},
		[1704]=
		{
			id = 1704,
			code = 410325,
			name = "河南省",
			city = "洛阳市",
			qu = "嵩县",
		},
		[1705]=
		{
			id = 1705,
			code = 410326,
			name = "河南省",
			city = "洛阳市",
			qu = "汝阳县",
		},
		[1706]=
		{
			id = 1706,
			code = 410327,
			name = "河南省",
			city = "洛阳市",
			qu = "宜阳县",
		},
		[1707]=
		{
			id = 1707,
			code = 410328,
			name = "河南省",
			city = "洛阳市",
			qu = "洛宁县",
		},
		[1708]=
		{
			id = 1708,
			code = 410329,
			name = "河南省",
			city = "洛阳市",
			qu = "伊川县",
		},
		[1709]=
		{
			id = 1709,
			code = 410381,
			name = "河南省",
			city = "洛阳市",
			qu = "偃师市",
		},
		[1710]=
		{
			id = 1710,
			code = 410400,
			name = "河南省",
			city = "平顶山市",
		},
		[1711]=
		{
			id = 1711,
			code = 410401,
			name = "河南省",
			city = "平顶山市",
			qu = "市辖区",
		},
		[1712]=
		{
			id = 1712,
			code = 410402,
			name = "河南省",
			city = "平顶山市",
			qu = "新华区",
		},
		[1713]=
		{
			id = 1713,
			code = 410403,
			name = "河南省",
			city = "平顶山市",
			qu = "卫东区",
		},
		[1714]=
		{
			id = 1714,
			code = 410404,
			name = "河南省",
			city = "平顶山市",
			qu = "石龙区",
		},
		[1715]=
		{
			id = 1715,
			code = 410411,
			name = "河南省",
			city = "平顶山市",
			qu = "湛河区",
		},
		[1716]=
		{
			id = 1716,
			code = 410421,
			name = "河南省",
			city = "平顶山市",
			qu = "宝丰县",
		},
		[1717]=
		{
			id = 1717,
			code = 410422,
			name = "河南省",
			city = "平顶山市",
			qu = "叶县",
		},
		[1718]=
		{
			id = 1718,
			code = 410423,
			name = "河南省",
			city = "平顶山市",
			qu = "鲁山县",
		},
		[1719]=
		{
			id = 1719,
			code = 410425,
			name = "河南省",
			city = "平顶山市",
			qu = "郏县",
		},
		[1720]=
		{
			id = 1720,
			code = 410481,
			name = "河南省",
			city = "平顶山市",
			qu = "舞钢市",
		},
		[1721]=
		{
			id = 1721,
			code = 410482,
			name = "河南省",
			city = "平顶山市",
			qu = "汝州市",
		},
		[1722]=
		{
			id = 1722,
			code = 410500,
			name = "河南省",
			city = "安阳市",
		},
		[1723]=
		{
			id = 1723,
			code = 410501,
			name = "河南省",
			city = "安阳市",
			qu = "市辖区",
		},
		[1724]=
		{
			id = 1724,
			code = 410502,
			name = "河南省",
			city = "安阳市",
			qu = "文峰区",
		},
		[1725]=
		{
			id = 1725,
			code = 410503,
			name = "河南省",
			city = "安阳市",
			qu = "北关区",
		},
		[1726]=
		{
			id = 1726,
			code = 410505,
			name = "河南省",
			city = "安阳市",
			qu = "殷都区",
		},
		[1727]=
		{
			id = 1727,
			code = 410506,
			name = "河南省",
			city = "安阳市",
			qu = "龙安区",
		},
		[1728]=
		{
			id = 1728,
			code = 410522,
			name = "河南省",
			city = "安阳市",
			qu = "安阳县",
		},
		[1729]=
		{
			id = 1729,
			code = 410523,
			name = "河南省",
			city = "安阳市",
			qu = "汤阴县",
		},
		[1730]=
		{
			id = 1730,
			code = 410526,
			name = "河南省",
			city = "安阳市",
			qu = "滑县",
		},
		[1731]=
		{
			id = 1731,
			code = 410527,
			name = "河南省",
			city = "安阳市",
			qu = "内黄县",
		},
		[1732]=
		{
			id = 1732,
			code = 410581,
			name = "河南省",
			city = "安阳市",
			qu = "林州市",
		},
		[1733]=
		{
			id = 1733,
			code = 410600,
			name = "河南省",
			city = "鹤壁市",
		},
		[1734]=
		{
			id = 1734,
			code = 410601,
			name = "河南省",
			city = "鹤壁市",
			qu = "市辖区",
		},
		[1735]=
		{
			id = 1735,
			code = 410602,
			name = "河南省",
			city = "鹤壁市",
			qu = "鹤山区",
		},
		[1736]=
		{
			id = 1736,
			code = 410603,
			name = "河南省",
			city = "鹤壁市",
			qu = "山城区",
		},
		[1737]=
		{
			id = 1737,
			code = 410611,
			name = "河南省",
			city = "鹤壁市",
			qu = "淇滨区",
		},
		[1738]=
		{
			id = 1738,
			code = 410621,
			name = "河南省",
			city = "鹤壁市",
			qu = "浚县",
		},
		[1739]=
		{
			id = 1739,
			code = 410622,
			name = "河南省",
			city = "鹤壁市",
			qu = "淇县",
		},
		[1740]=
		{
			id = 1740,
			code = 410700,
			name = "河南省",
			city = "新乡市",
		},
		[1741]=
		{
			id = 1741,
			code = 410701,
			name = "河南省",
			city = "新乡市",
			qu = "市辖区",
		},
		[1742]=
		{
			id = 1742,
			code = 410702,
			name = "河南省",
			city = "新乡市",
			qu = "红旗区",
		},
		[1743]=
		{
			id = 1743,
			code = 410703,
			name = "河南省",
			city = "新乡市",
			qu = "卫滨区",
		},
		[1744]=
		{
			id = 1744,
			code = 410704,
			name = "河南省",
			city = "新乡市",
			qu = "凤泉区",
		},
		[1745]=
		{
			id = 1745,
			code = 410711,
			name = "河南省",
			city = "新乡市",
			qu = "牧野区",
		},
		[1746]=
		{
			id = 1746,
			code = 410721,
			name = "河南省",
			city = "新乡市",
			qu = "新乡县",
		},
		[1747]=
		{
			id = 1747,
			code = 410724,
			name = "河南省",
			city = "新乡市",
			qu = "获嘉县",
		},
		[1748]=
		{
			id = 1748,
			code = 410725,
			name = "河南省",
			city = "新乡市",
			qu = "原阳县",
		},
		[1749]=
		{
			id = 1749,
			code = 410726,
			name = "河南省",
			city = "新乡市",
			qu = "延津县",
		},
		[1750]=
		{
			id = 1750,
			code = 410727,
			name = "河南省",
			city = "新乡市",
			qu = "封丘县",
		},
		[1751]=
		{
			id = 1751,
			code = 410728,
			name = "河南省",
			city = "新乡市",
			qu = "长垣县",
		},
		[1752]=
		{
			id = 1752,
			code = 410781,
			name = "河南省",
			city = "新乡市",
			qu = "卫辉市",
		},
		[1753]=
		{
			id = 1753,
			code = 410782,
			name = "河南省",
			city = "新乡市",
			qu = "辉县市",
		},
		[1754]=
		{
			id = 1754,
			code = 410800,
			name = "河南省",
			city = "焦作市",
		},
		[1755]=
		{
			id = 1755,
			code = 410801,
			name = "河南省",
			city = "焦作市",
			qu = "市辖区",
		},
		[1756]=
		{
			id = 1756,
			code = 410802,
			name = "河南省",
			city = "焦作市",
			qu = "解放区",
		},
		[1757]=
		{
			id = 1757,
			code = 410803,
			name = "河南省",
			city = "焦作市",
			qu = "中站区",
		},
		[1758]=
		{
			id = 1758,
			code = 410804,
			name = "河南省",
			city = "焦作市",
			qu = "马村区",
		},
		[1759]=
		{
			id = 1759,
			code = 410811,
			name = "河南省",
			city = "焦作市",
			qu = "山阳区",
		},
		[1760]=
		{
			id = 1760,
			code = 410821,
			name = "河南省",
			city = "焦作市",
			qu = "修武县",
		},
		[1761]=
		{
			id = 1761,
			code = 410822,
			name = "河南省",
			city = "焦作市",
			qu = "博爱县",
		},
		[1762]=
		{
			id = 1762,
			code = 410823,
			name = "河南省",
			city = "焦作市",
			qu = "武陟县",
		},
		[1763]=
		{
			id = 1763,
			code = 410825,
			name = "河南省",
			city = "焦作市",
			qu = "温县",
		},
		[1764]=
		{
			id = 1764,
			code = 410881,
			name = "河南省",
			city = "焦作市",
			qu = "济源市",
		},
		[1765]=
		{
			id = 1765,
			code = 410882,
			name = "河南省",
			city = "焦作市",
			qu = "沁阳市",
		},
		[1766]=
		{
			id = 1766,
			code = 410883,
			name = "河南省",
			city = "焦作市",
			qu = "孟州市",
		},
		[1767]=
		{
			id = 1767,
			code = 410900,
			name = "河南省",
			city = "濮阳市",
		},
		[1768]=
		{
			id = 1768,
			code = 410901,
			name = "河南省",
			city = "濮阳市",
			qu = "市辖区",
		},
		[1769]=
		{
			id = 1769,
			code = 410902,
			name = "河南省",
			city = "濮阳市",
			qu = "华龙区",
		},
		[1770]=
		{
			id = 1770,
			code = 410922,
			name = "河南省",
			city = "濮阳市",
			qu = "清丰县",
		},
		[1771]=
		{
			id = 1771,
			code = 410923,
			name = "河南省",
			city = "濮阳市",
			qu = "南乐县",
		},
		[1772]=
		{
			id = 1772,
			code = 410926,
			name = "河南省",
			city = "濮阳市",
			qu = "范县",
		},
		[1773]=
		{
			id = 1773,
			code = 410927,
			name = "河南省",
			city = "濮阳市",
			qu = "台前县",
		},
		[1774]=
		{
			id = 1774,
			code = 410928,
			name = "河南省",
			city = "濮阳市",
			qu = "濮阳县",
		},
		[1775]=
		{
			id = 1775,
			code = 411000,
			name = "河南省",
			city = "许昌市",
		},
		[1776]=
		{
			id = 1776,
			code = 411001,
			name = "河南省",
			city = "许昌市",
			qu = "市辖区",
		},
		[1777]=
		{
			id = 1777,
			code = 411002,
			name = "河南省",
			city = "许昌市",
			qu = "魏都区",
		},
		[1778]=
		{
			id = 1778,
			code = 411023,
			name = "河南省",
			city = "许昌市",
			qu = "许昌县",
		},
		[1779]=
		{
			id = 1779,
			code = 411024,
			name = "河南省",
			city = "许昌市",
			qu = "鄢陵县",
		},
		[1780]=
		{
			id = 1780,
			code = 411025,
			name = "河南省",
			city = "许昌市",
			qu = "襄城县",
		},
		[1781]=
		{
			id = 1781,
			code = 411081,
			name = "河南省",
			city = "许昌市",
			qu = "禹州市",
		},
		[1782]=
		{
			id = 1782,
			code = 411082,
			name = "河南省",
			city = "许昌市",
			qu = "长葛市",
		},
		[1783]=
		{
			id = 1783,
			code = 411100,
			name = "河南省",
			city = "漯河市",
		},
		[1784]=
		{
			id = 1784,
			code = 411101,
			name = "河南省",
			city = "漯河市",
			qu = "市辖区",
		},
		[1785]=
		{
			id = 1785,
			code = 411102,
			name = "河南省",
			city = "漯河市",
			qu = "源汇区",
		},
		[1786]=
		{
			id = 1786,
			code = 411103,
			name = "河南省",
			city = "漯河市",
			qu = "郾城区",
		},
		[1787]=
		{
			id = 1787,
			code = 411104,
			name = "河南省",
			city = "漯河市",
			qu = "召陵区",
		},
		[1788]=
		{
			id = 1788,
			code = 411121,
			name = "河南省",
			city = "漯河市",
			qu = "舞阳县",
		},
		[1789]=
		{
			id = 1789,
			code = 411122,
			name = "河南省",
			city = "漯河市",
			qu = "临颍县",
		},
		[1790]=
		{
			id = 1790,
			code = 411200,
			name = "河南省",
			city = "三门峡市",
		},
		[1791]=
		{
			id = 1791,
			code = 411201,
			name = "河南省",
			city = "三门峡市",
			qu = "市辖区",
		},
		[1792]=
		{
			id = 1792,
			code = 411202,
			name = "河南省",
			city = "三门峡市",
			qu = "湖滨区",
		},
		[1793]=
		{
			id = 1793,
			code = 411221,
			name = "河南省",
			city = "三门峡市",
			qu = "渑池县",
		},
		[1794]=
		{
			id = 1794,
			code = 411222,
			name = "河南省",
			city = "三门峡市",
			qu = "陕县",
		},
		[1795]=
		{
			id = 1795,
			code = 411224,
			name = "河南省",
			city = "三门峡市",
			qu = "卢氏县",
		},
		[1796]=
		{
			id = 1796,
			code = 411281,
			name = "河南省",
			city = "三门峡市",
			qu = "义马市",
		},
		[1797]=
		{
			id = 1797,
			code = 411282,
			name = "河南省",
			city = "三门峡市",
			qu = "灵宝市",
		},
		[1798]=
		{
			id = 1798,
			code = 411300,
			name = "河南省",
			city = "南阳市",
		},
		[1799]=
		{
			id = 1799,
			code = 411301,
			name = "河南省",
			city = "南阳市",
			qu = "市辖区",
		},
		[1800]=
		{
			id = 1800,
			code = 411302,
			name = "河南省",
			city = "南阳市",
			qu = "宛城区",
		},
		[1801]=
		{
			id = 1801,
			code = 411303,
			name = "河南省",
			city = "南阳市",
			qu = "卧龙区",
		},
		[1802]=
		{
			id = 1802,
			code = 411321,
			name = "河南省",
			city = "南阳市",
			qu = "南召县",
		},
		[1803]=
		{
			id = 1803,
			code = 411322,
			name = "河南省",
			city = "南阳市",
			qu = "方城县",
		},
		[1804]=
		{
			id = 1804,
			code = 411323,
			name = "河南省",
			city = "南阳市",
			qu = "西峡县",
		},
		[1805]=
		{
			id = 1805,
			code = 411324,
			name = "河南省",
			city = "南阳市",
			qu = "镇平县",
		},
		[1806]=
		{
			id = 1806,
			code = 411325,
			name = "河南省",
			city = "南阳市",
			qu = "内乡县",
		},
		[1807]=
		{
			id = 1807,
			code = 411326,
			name = "河南省",
			city = "南阳市",
			qu = "淅川县",
		},
		[1808]=
		{
			id = 1808,
			code = 411327,
			name = "河南省",
			city = "南阳市",
			qu = "社旗县",
		},
		[1809]=
		{
			id = 1809,
			code = 411328,
			name = "河南省",
			city = "南阳市",
			qu = "唐河县",
		},
		[1810]=
		{
			id = 1810,
			code = 411329,
			name = "河南省",
			city = "南阳市",
			qu = "新野县",
		},
		[1811]=
		{
			id = 1811,
			code = 411330,
			name = "河南省",
			city = "南阳市",
			qu = "桐柏县",
		},
		[1812]=
		{
			id = 1812,
			code = 411381,
			name = "河南省",
			city = "南阳市",
			qu = "邓州市",
		},
		[1813]=
		{
			id = 1813,
			code = 411400,
			name = "河南省",
			city = "商丘市",
		},
		[1814]=
		{
			id = 1814,
			code = 411401,
			name = "河南省",
			city = "商丘市",
			qu = "市辖区",
		},
		[1815]=
		{
			id = 1815,
			code = 411402,
			name = "河南省",
			city = "商丘市",
			qu = "梁园区",
		},
		[1816]=
		{
			id = 1816,
			code = 411403,
			name = "河南省",
			city = "商丘市",
			qu = "睢阳区",
		},
		[1817]=
		{
			id = 1817,
			code = 411421,
			name = "河南省",
			city = "商丘市",
			qu = "民权县",
		},
		[1818]=
		{
			id = 1818,
			code = 411422,
			name = "河南省",
			city = "商丘市",
			qu = "睢县",
		},
		[1819]=
		{
			id = 1819,
			code = 411423,
			name = "河南省",
			city = "商丘市",
			qu = "宁陵县",
		},
		[1820]=
		{
			id = 1820,
			code = 411424,
			name = "河南省",
			city = "商丘市",
			qu = "柘城县",
		},
		[1821]=
		{
			id = 1821,
			code = 411425,
			name = "河南省",
			city = "商丘市",
			qu = "虞城县",
		},
		[1822]=
		{
			id = 1822,
			code = 411426,
			name = "河南省",
			city = "商丘市",
			qu = "夏邑县",
		},
		[1823]=
		{
			id = 1823,
			code = 411481,
			name = "河南省",
			city = "商丘市",
			qu = "永城市",
		},
		[1824]=
		{
			id = 1824,
			code = 411500,
			name = "河南省",
			city = "信阳市",
		},
		[1825]=
		{
			id = 1825,
			code = 411501,
			name = "河南省",
			city = "信阳市",
			qu = "市辖区",
		},
		[1826]=
		{
			id = 1826,
			code = 411502,
			name = "河南省",
			city = "信阳市",
			qu = "浉河区",
		},
		[1827]=
		{
			id = 1827,
			code = 411503,
			name = "河南省",
			city = "信阳市",
			qu = "平桥区",
		},
		[1828]=
		{
			id = 1828,
			code = 411521,
			name = "河南省",
			city = "信阳市",
			qu = "罗山县",
		},
		[1829]=
		{
			id = 1829,
			code = 411522,
			name = "河南省",
			city = "信阳市",
			qu = "光山县",
		},
		[1830]=
		{
			id = 1830,
			code = 411523,
			name = "河南省",
			city = "信阳市",
			qu = "新县",
		},
		[1831]=
		{
			id = 1831,
			code = 411524,
			name = "河南省",
			city = "信阳市",
			qu = "商城县",
		},
		[1832]=
		{
			id = 1832,
			code = 411525,
			name = "河南省",
			city = "信阳市",
			qu = "固始县",
		},
		[1833]=
		{
			id = 1833,
			code = 411526,
			name = "河南省",
			city = "信阳市",
			qu = "潢川县",
		},
		[1834]=
		{
			id = 1834,
			code = 411527,
			name = "河南省",
			city = "信阳市",
			qu = "淮滨县",
		},
		[1835]=
		{
			id = 1835,
			code = 411528,
			name = "河南省",
			city = "信阳市",
			qu = "息县",
		},
		[1836]=
		{
			id = 1836,
			code = 411600,
			name = "河南省",
			city = "周口市",
		},
		[1837]=
		{
			id = 1837,
			code = 411601,
			name = "河南省",
			city = "周口市",
			qu = "市辖区",
		},
		[1838]=
		{
			id = 1838,
			code = 411602,
			name = "河南省",
			city = "周口市",
			qu = "川汇区",
		},
		[1839]=
		{
			id = 1839,
			code = 411621,
			name = "河南省",
			city = "周口市",
			qu = "扶沟县",
		},
		[1840]=
		{
			id = 1840,
			code = 411622,
			name = "河南省",
			city = "周口市",
			qu = "西华县",
		},
		[1841]=
		{
			id = 1841,
			code = 411623,
			name = "河南省",
			city = "周口市",
			qu = "商水县",
		},
		[1842]=
		{
			id = 1842,
			code = 411624,
			name = "河南省",
			city = "周口市",
			qu = "沈丘县",
		},
		[1843]=
		{
			id = 1843,
			code = 411625,
			name = "河南省",
			city = "周口市",
			qu = "郸城县",
		},
		[1844]=
		{
			id = 1844,
			code = 411626,
			name = "河南省",
			city = "周口市",
			qu = "淮阳县",
		},
		[1845]=
		{
			id = 1845,
			code = 411627,
			name = "河南省",
			city = "周口市",
			qu = "太康县",
		},
		[1846]=
		{
			id = 1846,
			code = 411628,
			name = "河南省",
			city = "周口市",
			qu = "鹿邑县",
		},
		[1847]=
		{
			id = 1847,
			code = 411681,
			name = "河南省",
			city = "周口市",
			qu = "项城市",
		},
		[1848]=
		{
			id = 1848,
			code = 411700,
			name = "河南省",
			city = "驻马店市",
		},
		[1849]=
		{
			id = 1849,
			code = 411701,
			name = "河南省",
			city = "驻马店市",
			qu = "市辖区",
		},
		[1850]=
		{
			id = 1850,
			code = 411702,
			name = "河南省",
			city = "驻马店市",
			qu = "驿城区",
		},
		[1851]=
		{
			id = 1851,
			code = 411721,
			name = "河南省",
			city = "驻马店市",
			qu = "西平县",
		},
		[1852]=
		{
			id = 1852,
			code = 411722,
			name = "河南省",
			city = "驻马店市",
			qu = "上蔡县",
		},
		[1853]=
		{
			id = 1853,
			code = 411723,
			name = "河南省",
			city = "驻马店市",
			qu = "平舆县",
		},
		[1854]=
		{
			id = 1854,
			code = 411724,
			name = "河南省",
			city = "驻马店市",
			qu = "正阳县",
		},
		[1855]=
		{
			id = 1855,
			code = 411725,
			name = "河南省",
			city = "驻马店市",
			qu = "确山县",
		},
		[1856]=
		{
			id = 1856,
			code = 411726,
			name = "河南省",
			city = "驻马店市",
			qu = "泌阳县",
		},
		[1857]=
		{
			id = 1857,
			code = 411727,
			name = "河南省",
			city = "驻马店市",
			qu = "汝南县",
		},
		[1858]=
		{
			id = 1858,
			code = 411728,
			name = "河南省",
			city = "驻马店市",
			qu = "遂平县",
		},
		[1859]=
		{
			id = 1859,
			code = 411729,
			name = "河南省",
			city = "驻马店市",
			qu = "新蔡县",
		},
		[1860]=
		{
			id = 1860,
			code = 420000,
			name = "湖北省",
		},
		[1861]=
		{
			id = 1861,
			code = 420100,
			name = "湖北省",
			city = "武汉市",
		},
		[1862]=
		{
			id = 1862,
			code = 420101,
			name = "湖北省",
			city = "武汉市",
			qu = "市辖区",
		},
		[1863]=
		{
			id = 1863,
			code = 420102,
			name = "湖北省",
			city = "武汉市",
			qu = "江岸区",
		},
		[1864]=
		{
			id = 1864,
			code = 420103,
			name = "湖北省",
			city = "武汉市",
			qu = "江汉区",
		},
		[1865]=
		{
			id = 1865,
			code = 420104,
			name = "湖北省",
			city = "武汉市",
			qu = "硚口区",
		},
		[1866]=
		{
			id = 1866,
			code = 420105,
			name = "湖北省",
			city = "武汉市",
			qu = "汉阳区",
		},
		[1867]=
		{
			id = 1867,
			code = 420106,
			name = "湖北省",
			city = "武汉市",
			qu = "武昌区",
		},
		[1868]=
		{
			id = 1868,
			code = 420107,
			name = "湖北省",
			city = "武汉市",
			qu = "青山区",
		},
		[1869]=
		{
			id = 1869,
			code = 420111,
			name = "湖北省",
			city = "武汉市",
			qu = "洪山区",
		},
		[1870]=
		{
			id = 1870,
			code = 420112,
			name = "湖北省",
			city = "武汉市",
			qu = "东西湖区",
		},
		[1871]=
		{
			id = 1871,
			code = 420113,
			name = "湖北省",
			city = "武汉市",
			qu = "汉南区",
		},
		[1872]=
		{
			id = 1872,
			code = 420114,
			name = "湖北省",
			city = "武汉市",
			qu = "蔡甸区",
		},
		[1873]=
		{
			id = 1873,
			code = 420115,
			name = "湖北省",
			city = "武汉市",
			qu = "江夏区",
		},
		[1874]=
		{
			id = 1874,
			code = 420116,
			name = "湖北省",
			city = "武汉市",
			qu = "黄陂区",
		},
		[1875]=
		{
			id = 1875,
			code = 420117,
			name = "湖北省",
			city = "武汉市",
			qu = "新洲区",
		},
		[1876]=
		{
			id = 1876,
			code = 420200,
			name = "湖北省",
			city = "黄石市",
		},
		[1877]=
		{
			id = 1877,
			code = 420201,
			name = "湖北省",
			city = "黄石市",
			qu = "市辖区",
		},
		[1878]=
		{
			id = 1878,
			code = 420202,
			name = "湖北省",
			city = "黄石市",
			qu = "黄石港区",
		},
		[1879]=
		{
			id = 1879,
			code = 420203,
			name = "湖北省",
			city = "黄石市",
			qu = "西塞山区",
		},
		[1880]=
		{
			id = 1880,
			code = 420204,
			name = "湖北省",
			city = "黄石市",
			qu = "下陆区",
		},
		[1881]=
		{
			id = 1881,
			code = 420205,
			name = "湖北省",
			city = "黄石市",
			qu = "铁山区",
		},
		[1882]=
		{
			id = 1882,
			code = 420222,
			name = "湖北省",
			city = "黄石市",
			qu = "阳新县",
		},
		[1883]=
		{
			id = 1883,
			code = 420281,
			name = "湖北省",
			city = "黄石市",
			qu = "大冶市",
		},
		[1884]=
		{
			id = 1884,
			code = 420300,
			name = "湖北省",
			city = "十堰市",
		},
		[1885]=
		{
			id = 1885,
			code = 420301,
			name = "湖北省",
			city = "十堰市",
			qu = "市辖区",
		},
		[1886]=
		{
			id = 1886,
			code = 420302,
			name = "湖北省",
			city = "十堰市",
			qu = "茅箭区",
		},
		[1887]=
		{
			id = 1887,
			code = 420303,
			name = "湖北省",
			city = "十堰市",
			qu = "张湾区",
		},
		[1888]=
		{
			id = 1888,
			code = 420321,
			name = "湖北省",
			city = "十堰市",
			qu = "郧县",
		},
		[1889]=
		{
			id = 1889,
			code = 420322,
			name = "湖北省",
			city = "十堰市",
			qu = "郧西县",
		},
		[1890]=
		{
			id = 1890,
			code = 420323,
			name = "湖北省",
			city = "十堰市",
			qu = "竹山县",
		},
		[1891]=
		{
			id = 1891,
			code = 420324,
			name = "湖北省",
			city = "十堰市",
			qu = "竹溪县",
		},
		[1892]=
		{
			id = 1892,
			code = 420325,
			name = "湖北省",
			city = "十堰市",
			qu = "房县",
		},
		[1893]=
		{
			id = 1893,
			code = 420381,
			name = "湖北省",
			city = "十堰市",
			qu = "丹江口市",
		},
		[1894]=
		{
			id = 1894,
			code = 420500,
			name = "湖北省",
			city = "宜昌市",
		},
		[1895]=
		{
			id = 1895,
			code = 420501,
			name = "湖北省",
			city = "宜昌市",
			qu = "市辖区",
		},
		[1896]=
		{
			id = 1896,
			code = 420502,
			name = "湖北省",
			city = "宜昌市",
			qu = "西陵区",
		},
		[1897]=
		{
			id = 1897,
			code = 420503,
			name = "湖北省",
			city = "宜昌市",
			qu = "伍家岗区",
		},
		[1898]=
		{
			id = 1898,
			code = 420504,
			name = "湖北省",
			city = "宜昌市",
			qu = "点军区",
		},
		[1899]=
		{
			id = 1899,
			code = 420505,
			name = "湖北省",
			city = "宜昌市",
			qu = "猇亭区",
		},
		[1900]=
		{
			id = 1900,
			code = 420506,
			name = "湖北省",
			city = "宜昌市",
			qu = "夷陵区",
		},
		[1901]=
		{
			id = 1901,
			code = 420525,
			name = "湖北省",
			city = "宜昌市",
			qu = "远安县",
		},
		[1902]=
		{
			id = 1902,
			code = 420526,
			name = "湖北省",
			city = "宜昌市",
			qu = "兴山县",
		},
		[1903]=
		{
			id = 1903,
			code = 420527,
			name = "湖北省",
			city = "宜昌市",
			qu = "秭归县",
		},
		[1904]=
		{
			id = 1904,
			code = 420528,
			name = "湖北省",
			city = "宜昌市",
			qu = "长阳土家族自治县",
		},
		[1905]=
		{
			id = 1905,
			code = 420529,
			name = "湖北省",
			city = "宜昌市",
			qu = "五峰土家族自治县",
		},
		[1906]=
		{
			id = 1906,
			code = 420581,
			name = "湖北省",
			city = "宜昌市",
			qu = "宜都市",
		},
		[1907]=
		{
			id = 1907,
			code = 420582,
			name = "湖北省",
			city = "宜昌市",
			qu = "当阳市",
		},
		[1908]=
		{
			id = 1908,
			code = 420583,
			name = "湖北省",
			city = "宜昌市",
			qu = "枝江市",
		},
		[1909]=
		{
			id = 1909,
			code = 420600,
			name = "湖北省",
			city = "襄樊市",
		},
		[1910]=
		{
			id = 1910,
			code = 420601,
			name = "湖北省",
			city = "襄樊市",
			qu = "市辖区",
		},
		[1911]=
		{
			id = 1911,
			code = 420602,
			name = "湖北省",
			city = "襄樊市",
			qu = "襄城区",
		},
		[1912]=
		{
			id = 1912,
			code = 420606,
			name = "湖北省",
			city = "襄樊市",
			qu = "樊城区",
		},
		[1913]=
		{
			id = 1913,
			code = 420607,
			name = "湖北省",
			city = "襄樊市",
			qu = "襄阳区",
		},
		[1914]=
		{
			id = 1914,
			code = 420624,
			name = "湖北省",
			city = "襄樊市",
			qu = "南漳县",
		},
		[1915]=
		{
			id = 1915,
			code = 420625,
			name = "湖北省",
			city = "襄樊市",
			qu = "谷城县",
		},
		[1916]=
		{
			id = 1916,
			code = 420626,
			name = "湖北省",
			city = "襄樊市",
			qu = "保康县",
		},
		[1917]=
		{
			id = 1917,
			code = 420682,
			name = "湖北省",
			city = "襄樊市",
			qu = "老河口市",
		},
		[1918]=
		{
			id = 1918,
			code = 420683,
			name = "湖北省",
			city = "襄樊市",
			qu = "枣阳市",
		},
		[1919]=
		{
			id = 1919,
			code = 420684,
			name = "湖北省",
			city = "襄樊市",
			qu = "宜城市",
		},
		[1920]=
		{
			id = 1920,
			code = 420700,
			name = "湖北省",
			city = "鄂州市",
		},
		[1921]=
		{
			id = 1921,
			code = 420701,
			name = "湖北省",
			city = "鄂州市",
			qu = "市辖区",
		},
		[1922]=
		{
			id = 1922,
			code = 420702,
			name = "湖北省",
			city = "鄂州市",
			qu = "梁子湖区",
		},
		[1923]=
		{
			id = 1923,
			code = 420703,
			name = "湖北省",
			city = "鄂州市",
			qu = "华容区",
		},
		[1924]=
		{
			id = 1924,
			code = 420704,
			name = "湖北省",
			city = "鄂州市",
			qu = "鄂城区",
		},
		[1925]=
		{
			id = 1925,
			code = 420800,
			name = "湖北省",
			city = "荆门市",
		},
		[1926]=
		{
			id = 1926,
			code = 420801,
			name = "湖北省",
			city = "荆门市",
			qu = "市辖区",
		},
		[1927]=
		{
			id = 1927,
			code = 420802,
			name = "湖北省",
			city = "荆门市",
			qu = "东宝区",
		},
		[1928]=
		{
			id = 1928,
			code = 420804,
			name = "湖北省",
			city = "荆门市",
			qu = "掇刀区",
		},
		[1929]=
		{
			id = 1929,
			code = 420821,
			name = "湖北省",
			city = "荆门市",
			qu = "京山县",
		},
		[1930]=
		{
			id = 1930,
			code = 420822,
			name = "湖北省",
			city = "荆门市",
			qu = "沙洋县",
		},
		[1931]=
		{
			id = 1931,
			code = 420881,
			name = "湖北省",
			city = "荆门市",
			qu = "钟祥市",
		},
		[1932]=
		{
			id = 1932,
			code = 420900,
			name = "湖北省",
			city = "孝感市",
		},
		[1933]=
		{
			id = 1933,
			code = 420901,
			name = "湖北省",
			city = "孝感市",
			qu = "市辖区",
		},
		[1934]=
		{
			id = 1934,
			code = 420902,
			name = "湖北省",
			city = "孝感市",
			qu = "孝南区",
		},
		[1935]=
		{
			id = 1935,
			code = 420921,
			name = "湖北省",
			city = "孝感市",
			qu = "孝昌县",
		},
		[1936]=
		{
			id = 1936,
			code = 420922,
			name = "湖北省",
			city = "孝感市",
			qu = "大悟县",
		},
		[1937]=
		{
			id = 1937,
			code = 420923,
			name = "湖北省",
			city = "孝感市",
			qu = "云梦县",
		},
		[1938]=
		{
			id = 1938,
			code = 420981,
			name = "湖北省",
			city = "孝感市",
			qu = "应城市",
		},
		[1939]=
		{
			id = 1939,
			code = 420982,
			name = "湖北省",
			city = "孝感市",
			qu = "安陆市",
		},
		[1940]=
		{
			id = 1940,
			code = 420984,
			name = "湖北省",
			city = "孝感市",
			qu = "汉川市",
		},
		[1941]=
		{
			id = 1941,
			code = 421000,
			name = "湖北省",
			city = "荆州市",
		},
		[1942]=
		{
			id = 1942,
			code = 421001,
			name = "湖北省",
			city = "荆州市",
			qu = "市辖区",
		},
		[1943]=
		{
			id = 1943,
			code = 421002,
			name = "湖北省",
			city = "荆州市",
			qu = "沙市区",
		},
		[1944]=
		{
			id = 1944,
			code = 421003,
			name = "湖北省",
			city = "荆州市",
			qu = "荆州区",
		},
		[1945]=
		{
			id = 1945,
			code = 421022,
			name = "湖北省",
			city = "荆州市",
			qu = "公安县",
		},
		[1946]=
		{
			id = 1946,
			code = 421023,
			name = "湖北省",
			city = "荆州市",
			qu = "监利县",
		},
		[1947]=
		{
			id = 1947,
			code = 421024,
			name = "湖北省",
			city = "荆州市",
			qu = "江陵县",
		},
		[1948]=
		{
			id = 1948,
			code = 421081,
			name = "湖北省",
			city = "荆州市",
			qu = "石首市",
		},
		[1949]=
		{
			id = 1949,
			code = 421083,
			name = "湖北省",
			city = "荆州市",
			qu = "洪湖市",
		},
		[1950]=
		{
			id = 1950,
			code = 421087,
			name = "湖北省",
			city = "荆州市",
			qu = "松滋市",
		},
		[1951]=
		{
			id = 1951,
			code = 421100,
			name = "湖北省",
			city = "黄冈市",
		},
		[1952]=
		{
			id = 1952,
			code = 421101,
			name = "湖北省",
			city = "黄冈市",
			qu = "市辖区",
		},
		[1953]=
		{
			id = 1953,
			code = 421102,
			name = "湖北省",
			city = "黄冈市",
			qu = "黄州区",
		},
		[1954]=
		{
			id = 1954,
			code = 421121,
			name = "湖北省",
			city = "黄冈市",
			qu = "团风县",
		},
		[1955]=
		{
			id = 1955,
			code = 421122,
			name = "湖北省",
			city = "黄冈市",
			qu = "红安县",
		},
		[1956]=
		{
			id = 1956,
			code = 421123,
			name = "湖北省",
			city = "黄冈市",
			qu = "罗田县",
		},
		[1957]=
		{
			id = 1957,
			code = 421124,
			name = "湖北省",
			city = "黄冈市",
			qu = "英山县",
		},
		[1958]=
		{
			id = 1958,
			code = 421125,
			name = "湖北省",
			city = "黄冈市",
			qu = "浠水县",
		},
		[1959]=
		{
			id = 1959,
			code = 421126,
			name = "湖北省",
			city = "黄冈市",
			qu = "蕲春县",
		},
		[1960]=
		{
			id = 1960,
			code = 421127,
			name = "湖北省",
			city = "黄冈市",
			qu = "黄梅县",
		},
		[1961]=
		{
			id = 1961,
			code = 421181,
			name = "湖北省",
			city = "黄冈市",
			qu = "麻城市",
		},
		[1962]=
		{
			id = 1962,
			code = 421182,
			name = "湖北省",
			city = "黄冈市",
			qu = "武穴市",
		},
		[1963]=
		{
			id = 1963,
			code = 421200,
			name = "湖北省",
			city = "咸宁市",
		},
		[1964]=
		{
			id = 1964,
			code = 421201,
			name = "湖北省",
			city = "咸宁市",
			qu = "市辖区",
		},
		[1965]=
		{
			id = 1965,
			code = 421202,
			name = "湖北省",
			city = "咸宁市",
			qu = "咸安区",
		},
		[1966]=
		{
			id = 1966,
			code = 421221,
			name = "湖北省",
			city = "咸宁市",
			qu = "嘉鱼县",
		},
		[1967]=
		{
			id = 1967,
			code = 421222,
			name = "湖北省",
			city = "咸宁市",
			qu = "通城县",
		},
		[1968]=
		{
			id = 1968,
			code = 421223,
			name = "湖北省",
			city = "咸宁市",
			qu = "崇阳县",
		},
		[1969]=
		{
			id = 1969,
			code = 421224,
			name = "湖北省",
			city = "咸宁市",
			qu = "通山县",
		},
		[1970]=
		{
			id = 1970,
			code = 421281,
			name = "湖北省",
			city = "咸宁市",
			qu = "赤壁市",
		},
		[1971]=
		{
			id = 1971,
			code = 421300,
			name = "湖北省",
			city = "随州市",
		},
		[1972]=
		{
			id = 1972,
			code = 421301,
			name = "湖北省",
			city = "随州市",
			qu = "市辖区",
		},
		[1973]=
		{
			id = 1973,
			code = 421302,
			name = "湖北省",
			city = "随州市",
			qu = "曾都区",
		},
		[1974]=
		{
			id = 1974,
			code = 421381,
			name = "湖北省",
			city = "随州市",
			qu = "广水市",
		},
		[1975]=
		{
			id = 1975,
			code = 422800,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
		},
		[1976]=
		{
			id = 1976,
			code = 422801,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
			qu = "恩施市",
		},
		[1977]=
		{
			id = 1977,
			code = 422802,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
			qu = "利川市",
		},
		[1978]=
		{
			id = 1978,
			code = 422822,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
			qu = "建始县",
		},
		[1979]=
		{
			id = 1979,
			code = 422823,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
			qu = "巴东县",
		},
		[1980]=
		{
			id = 1980,
			code = 422825,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
			qu = "宣恩县",
		},
		[1981]=
		{
			id = 1981,
			code = 422826,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
			qu = "咸丰县",
		},
		[1982]=
		{
			id = 1982,
			code = 422827,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
			qu = "来凤县",
		},
		[1983]=
		{
			id = 1983,
			code = 422828,
			name = "湖北省",
			city = "恩施土家族苗族自治州",
			qu = "鹤峰县",
		},
		[1984]=
		{
			id = 1984,
			code = 429000,
			name = "湖北省",
			city = "省直辖县级行政单位",
		},
		[1985]=
		{
			id = 1985,
			code = 429004,
			name = "湖北省",
			city = "省直辖县级行政单位",
			qu = "仙桃市",
		},
		[1986]=
		{
			id = 1986,
			code = 429005,
			name = "湖北省",
			city = "省直辖县级行政单位",
			qu = "潜江市",
		},
		[1987]=
		{
			id = 1987,
			code = 429006,
			name = "湖北省",
			city = "省直辖县级行政单位",
			qu = "天门市",
		},
		[1988]=
		{
			id = 1988,
			code = 429021,
			name = "湖北省",
			city = "省直辖县级行政单位",
			qu = "神农架林区",
		},
		[1989]=
		{
			id = 1989,
			code = 430000,
			name = "湖南省",
		},
		[1990]=
		{
			id = 1990,
			code = 430100,
			name = "湖南省",
			city = "长沙市",
		},
		[1991]=
		{
			id = 1991,
			code = 430101,
			name = "湖南省",
			city = "长沙市",
			qu = "市辖区",
		},
		[1992]=
		{
			id = 1992,
			code = 430102,
			name = "湖南省",
			city = "长沙市",
			qu = "芙蓉区",
		},
		[1993]=
		{
			id = 1993,
			code = 430103,
			name = "湖南省",
			city = "长沙市",
			qu = "天心区",
		},
		[1994]=
		{
			id = 1994,
			code = 430104,
			name = "湖南省",
			city = "长沙市",
			qu = "岳麓区",
		},
		[1995]=
		{
			id = 1995,
			code = 430105,
			name = "湖南省",
			city = "长沙市",
			qu = "开福区",
		},
		[1996]=
		{
			id = 1996,
			code = 430111,
			name = "湖南省",
			city = "长沙市",
			qu = "雨花区",
		},
		[1997]=
		{
			id = 1997,
			code = 430121,
			name = "湖南省",
			city = "长沙市",
			qu = "长沙县",
		},
		[1998]=
		{
			id = 1998,
			code = 430122,
			name = "湖南省",
			city = "长沙市",
			qu = "望城县",
		},
		[1999]=
		{
			id = 1999,
			code = 430124,
			name = "湖南省",
			city = "长沙市",
			qu = "宁乡县",
		},
		[2000]=
		{
			id = 2000,
			code = 430181,
			name = "湖南省",
			city = "长沙市",
			qu = "浏阳市",
		},
		[2001]=
		{
			id = 2001,
			code = 430200,
			name = "湖南省",
			city = "株洲市",
		},
		[2002]=
		{
			id = 2002,
			code = 430201,
			name = "湖南省",
			city = "株洲市",
			qu = "市辖区",
		},
		[2003]=
		{
			id = 2003,
			code = 430202,
			name = "湖南省",
			city = "株洲市",
			qu = "荷塘区",
		},
		[2004]=
		{
			id = 2004,
			code = 430203,
			name = "湖南省",
			city = "株洲市",
			qu = "芦淞区",
		},
		[2005]=
		{
			id = 2005,
			code = 430204,
			name = "湖南省",
			city = "株洲市",
			qu = "石峰区",
		},
		[2006]=
		{
			id = 2006,
			code = 430211,
			name = "湖南省",
			city = "株洲市",
			qu = "天元区",
		},
		[2007]=
		{
			id = 2007,
			code = 430221,
			name = "湖南省",
			city = "株洲市",
			qu = "株洲县",
		},
		[2008]=
		{
			id = 2008,
			code = 430223,
			name = "湖南省",
			city = "株洲市",
			qu = "攸县",
		},
		[2009]=
		{
			id = 2009,
			code = 430224,
			name = "湖南省",
			city = "株洲市",
			qu = "茶陵县",
		},
		[2010]=
		{
			id = 2010,
			code = 430225,
			name = "湖南省",
			city = "株洲市",
			qu = "炎陵县",
		},
		[2011]=
		{
			id = 2011,
			code = 430281,
			name = "湖南省",
			city = "株洲市",
			qu = "醴陵市",
		},
		[2012]=
		{
			id = 2012,
			code = 430300,
			name = "湖南省",
			city = "湘潭市",
		},
		[2013]=
		{
			id = 2013,
			code = 430301,
			name = "湖南省",
			city = "湘潭市",
			qu = "市辖区",
		},
		[2014]=
		{
			id = 2014,
			code = 430302,
			name = "湖南省",
			city = "湘潭市",
			qu = "雨湖区",
		},
		[2015]=
		{
			id = 2015,
			code = 430304,
			name = "湖南省",
			city = "湘潭市",
			qu = "岳塘区",
		},
		[2016]=
		{
			id = 2016,
			code = 430321,
			name = "湖南省",
			city = "湘潭市",
			qu = "湘潭县",
		},
		[2017]=
		{
			id = 2017,
			code = 430381,
			name = "湖南省",
			city = "湘潭市",
			qu = "湘乡市",
		},
		[2018]=
		{
			id = 2018,
			code = 430382,
			name = "湖南省",
			city = "湘潭市",
			qu = "韶山市",
		},
		[2019]=
		{
			id = 2019,
			code = 430400,
			name = "湖南省",
			city = "衡阳市",
		},
		[2020]=
		{
			id = 2020,
			code = 430401,
			name = "湖南省",
			city = "衡阳市",
			qu = "市辖区",
		},
		[2021]=
		{
			id = 2021,
			code = 430405,
			name = "湖南省",
			city = "衡阳市",
			qu = "珠晖区",
		},
		[2022]=
		{
			id = 2022,
			code = 430406,
			name = "湖南省",
			city = "衡阳市",
			qu = "雁峰区",
		},
		[2023]=
		{
			id = 2023,
			code = 430407,
			name = "湖南省",
			city = "衡阳市",
			qu = "石鼓区",
		},
		[2024]=
		{
			id = 2024,
			code = 430408,
			name = "湖南省",
			city = "衡阳市",
			qu = "蒸湘区",
		},
		[2025]=
		{
			id = 2025,
			code = 430412,
			name = "湖南省",
			city = "衡阳市",
			qu = "南岳区",
		},
		[2026]=
		{
			id = 2026,
			code = 430421,
			name = "湖南省",
			city = "衡阳市",
			qu = "衡阳县",
		},
		[2027]=
		{
			id = 2027,
			code = 430422,
			name = "湖南省",
			city = "衡阳市",
			qu = "衡南县",
		},
		[2028]=
		{
			id = 2028,
			code = 430423,
			name = "湖南省",
			city = "衡阳市",
			qu = "衡山县",
		},
		[2029]=
		{
			id = 2029,
			code = 430424,
			name = "湖南省",
			city = "衡阳市",
			qu = "衡东县",
		},
		[2030]=
		{
			id = 2030,
			code = 430426,
			name = "湖南省",
			city = "衡阳市",
			qu = "祁东县",
		},
		[2031]=
		{
			id = 2031,
			code = 430481,
			name = "湖南省",
			city = "衡阳市",
			qu = "耒阳市",
		},
		[2032]=
		{
			id = 2032,
			code = 430482,
			name = "湖南省",
			city = "衡阳市",
			qu = "常宁市",
		},
		[2033]=
		{
			id = 2033,
			code = 430500,
			name = "湖南省",
			city = "邵阳市",
		},
		[2034]=
		{
			id = 2034,
			code = 430501,
			name = "湖南省",
			city = "邵阳市",
			qu = "市辖区",
		},
		[2035]=
		{
			id = 2035,
			code = 430502,
			name = "湖南省",
			city = "邵阳市",
			qu = "双清区",
		},
		[2036]=
		{
			id = 2036,
			code = 430503,
			name = "湖南省",
			city = "邵阳市",
			qu = "大祥区",
		},
		[2037]=
		{
			id = 2037,
			code = 430511,
			name = "湖南省",
			city = "邵阳市",
			qu = "北塔区",
		},
		[2038]=
		{
			id = 2038,
			code = 430521,
			name = "湖南省",
			city = "邵阳市",
			qu = "邵东县",
		},
		[2039]=
		{
			id = 2039,
			code = 430522,
			name = "湖南省",
			city = "邵阳市",
			qu = "新邵县",
		},
		[2040]=
		{
			id = 2040,
			code = 430523,
			name = "湖南省",
			city = "邵阳市",
			qu = "邵阳县",
		},
		[2041]=
		{
			id = 2041,
			code = 430524,
			name = "湖南省",
			city = "邵阳市",
			qu = "隆回县",
		},
		[2042]=
		{
			id = 2042,
			code = 430525,
			name = "湖南省",
			city = "邵阳市",
			qu = "洞口县",
		},
		[2043]=
		{
			id = 2043,
			code = 430527,
			name = "湖南省",
			city = "邵阳市",
			qu = "绥宁县",
		},
		[2044]=
		{
			id = 2044,
			code = 430528,
			name = "湖南省",
			city = "邵阳市",
			qu = "新宁县",
		},
		[2045]=
		{
			id = 2045,
			code = 430529,
			name = "湖南省",
			city = "邵阳市",
			qu = "城步苗族自治县",
		},
		[2046]=
		{
			id = 2046,
			code = 430581,
			name = "湖南省",
			city = "邵阳市",
			qu = "武冈市",
		},
		[2047]=
		{
			id = 2047,
			code = 430600,
			name = "湖南省",
			city = "岳阳市",
		},
		[2048]=
		{
			id = 2048,
			code = 430601,
			name = "湖南省",
			city = "岳阳市",
			qu = "市辖区",
		},
		[2049]=
		{
			id = 2049,
			code = 430602,
			name = "湖南省",
			city = "岳阳市",
			qu = "岳阳楼区",
		},
		[2050]=
		{
			id = 2050,
			code = 430603,
			name = "湖南省",
			city = "岳阳市",
			qu = "云溪区",
		},
		[2051]=
		{
			id = 2051,
			code = 430611,
			name = "湖南省",
			city = "岳阳市",
			qu = "君山区",
		},
		[2052]=
		{
			id = 2052,
			code = 430621,
			name = "湖南省",
			city = "岳阳市",
			qu = "岳阳县",
		},
		[2053]=
		{
			id = 2053,
			code = 430623,
			name = "湖南省",
			city = "岳阳市",
			qu = "华容县",
		},
		[2054]=
		{
			id = 2054,
			code = 430624,
			name = "湖南省",
			city = "岳阳市",
			qu = "湘阴县",
		},
		[2055]=
		{
			id = 2055,
			code = 430626,
			name = "湖南省",
			city = "岳阳市",
			qu = "平江县",
		},
		[2056]=
		{
			id = 2056,
			code = 430681,
			name = "湖南省",
			city = "岳阳市",
			qu = "汨罗市",
		},
		[2057]=
		{
			id = 2057,
			code = 430682,
			name = "湖南省",
			city = "岳阳市",
			qu = "临湘市",
		},
		[2058]=
		{
			id = 2058,
			code = 430700,
			name = "湖南省",
			city = "常德市",
		},
		[2059]=
		{
			id = 2059,
			code = 430701,
			name = "湖南省",
			city = "常德市",
			qu = "市辖区",
		},
		[2060]=
		{
			id = 2060,
			code = 430702,
			name = "湖南省",
			city = "常德市",
			qu = "武陵区",
		},
		[2061]=
		{
			id = 2061,
			code = 430703,
			name = "湖南省",
			city = "常德市",
			qu = "鼎城区",
		},
		[2062]=
		{
			id = 2062,
			code = 430721,
			name = "湖南省",
			city = "常德市",
			qu = "安乡县",
		},
		[2063]=
		{
			id = 2063,
			code = 430722,
			name = "湖南省",
			city = "常德市",
			qu = "汉寿县",
		},
		[2064]=
		{
			id = 2064,
			code = 430723,
			name = "湖南省",
			city = "常德市",
			qu = "澧县",
		},
		[2065]=
		{
			id = 2065,
			code = 430724,
			name = "湖南省",
			city = "常德市",
			qu = "临澧县",
		},
		[2066]=
		{
			id = 2066,
			code = 430725,
			name = "湖南省",
			city = "常德市",
			qu = "桃源县",
		},
		[2067]=
		{
			id = 2067,
			code = 430726,
			name = "湖南省",
			city = "常德市",
			qu = "石门县",
		},
		[2068]=
		{
			id = 2068,
			code = 430781,
			name = "湖南省",
			city = "常德市",
			qu = "津市市",
		},
		[2069]=
		{
			id = 2069,
			code = 430800,
			name = "湖南省",
			city = "张家界市",
		},
		[2070]=
		{
			id = 2070,
			code = 430801,
			name = "湖南省",
			city = "张家界市",
			qu = "市辖区",
		},
		[2071]=
		{
			id = 2071,
			code = 430802,
			name = "湖南省",
			city = "张家界市",
			qu = "永定区",
		},
		[2072]=
		{
			id = 2072,
			code = 430811,
			name = "湖南省",
			city = "张家界市",
			qu = "武陵源区",
		},
		[2073]=
		{
			id = 2073,
			code = 430821,
			name = "湖南省",
			city = "张家界市",
			qu = "慈利县",
		},
		[2074]=
		{
			id = 2074,
			code = 430822,
			name = "湖南省",
			city = "张家界市",
			qu = "桑植县",
		},
		[2075]=
		{
			id = 2075,
			code = 430900,
			name = "湖南省",
			city = "益阳市",
		},
		[2076]=
		{
			id = 2076,
			code = 430901,
			name = "湖南省",
			city = "益阳市",
			qu = "市辖区",
		},
		[2077]=
		{
			id = 2077,
			code = 430902,
			name = "湖南省",
			city = "益阳市",
			qu = "资阳区",
		},
		[2078]=
		{
			id = 2078,
			code = 430903,
			name = "湖南省",
			city = "益阳市",
			qu = "赫山区",
		},
		[2079]=
		{
			id = 2079,
			code = 430921,
			name = "湖南省",
			city = "益阳市",
			qu = "南县",
		},
		[2080]=
		{
			id = 2080,
			code = 430922,
			name = "湖南省",
			city = "益阳市",
			qu = "桃江县",
		},
		[2081]=
		{
			id = 2081,
			code = 430923,
			name = "湖南省",
			city = "益阳市",
			qu = "安化县",
		},
		[2082]=
		{
			id = 2082,
			code = 430981,
			name = "湖南省",
			city = "益阳市",
			qu = "沅江市",
		},
		[2083]=
		{
			id = 2083,
			code = 431000,
			name = "湖南省",
			city = "郴州市",
		},
		[2084]=
		{
			id = 2084,
			code = 431001,
			name = "湖南省",
			city = "郴州市",
			qu = "市辖区",
		},
		[2085]=
		{
			id = 2085,
			code = 431002,
			name = "湖南省",
			city = "郴州市",
			qu = "北湖区",
		},
		[2086]=
		{
			id = 2086,
			code = 431003,
			name = "湖南省",
			city = "郴州市",
			qu = "苏仙区",
		},
		[2087]=
		{
			id = 2087,
			code = 431021,
			name = "湖南省",
			city = "郴州市",
			qu = "桂阳县",
		},
		[2088]=
		{
			id = 2088,
			code = 431022,
			name = "湖南省",
			city = "郴州市",
			qu = "宜章县",
		},
		[2089]=
		{
			id = 2089,
			code = 431023,
			name = "湖南省",
			city = "郴州市",
			qu = "永兴县",
		},
		[2090]=
		{
			id = 2090,
			code = 431024,
			name = "湖南省",
			city = "郴州市",
			qu = "嘉禾县",
		},
		[2091]=
		{
			id = 2091,
			code = 431025,
			name = "湖南省",
			city = "郴州市",
			qu = "临武县",
		},
		[2092]=
		{
			id = 2092,
			code = 431026,
			name = "湖南省",
			city = "郴州市",
			qu = "汝城县",
		},
		[2093]=
		{
			id = 2093,
			code = 431027,
			name = "湖南省",
			city = "郴州市",
			qu = "桂东县",
		},
		[2094]=
		{
			id = 2094,
			code = 431028,
			name = "湖南省",
			city = "郴州市",
			qu = "安仁县",
		},
		[2095]=
		{
			id = 2095,
			code = 431081,
			name = "湖南省",
			city = "郴州市",
			qu = "资兴市",
		},
		[2096]=
		{
			id = 2096,
			code = 431100,
			name = "湖南省",
			city = "永州市",
		},
		[2097]=
		{
			id = 2097,
			code = 431101,
			name = "湖南省",
			city = "永州市",
			qu = "市辖区",
		},
		[2098]=
		{
			id = 2098,
			code = 431102,
			name = "湖南省",
			city = "永州市",
			qu = "零陵区",
		},
		[2099]=
		{
			id = 2099,
			code = 431103,
			name = "湖南省",
			city = "永州市",
			qu = "冷水滩区",
		},
		[2100]=
		{
			id = 2100,
			code = 431121,
			name = "湖南省",
			city = "永州市",
			qu = "祁阳县",
		},
		[2101]=
		{
			id = 2101,
			code = 431122,
			name = "湖南省",
			city = "永州市",
			qu = "东安县",
		},
		[2102]=
		{
			id = 2102,
			code = 431123,
			name = "湖南省",
			city = "永州市",
			qu = "双牌县",
		},
		[2103]=
		{
			id = 2103,
			code = 431124,
			name = "湖南省",
			city = "永州市",
			qu = "道县",
		},
		[2104]=
		{
			id = 2104,
			code = 431125,
			name = "湖南省",
			city = "永州市",
			qu = "江永县",
		},
		[2105]=
		{
			id = 2105,
			code = 431126,
			name = "湖南省",
			city = "永州市",
			qu = "宁远县",
		},
		[2106]=
		{
			id = 2106,
			code = 431127,
			name = "湖南省",
			city = "永州市",
			qu = "蓝山县",
		},
		[2107]=
		{
			id = 2107,
			code = 431128,
			name = "湖南省",
			city = "永州市",
			qu = "新田县",
		},
		[2108]=
		{
			id = 2108,
			code = 431129,
			name = "湖南省",
			city = "永州市",
			qu = "江华瑶族自治县",
		},
		[2109]=
		{
			id = 2109,
			code = 431200,
			name = "湖南省",
			city = "怀化市",
		},
		[2110]=
		{
			id = 2110,
			code = 431201,
			name = "湖南省",
			city = "怀化市",
			qu = "市辖区",
		},
		[2111]=
		{
			id = 2111,
			code = 431202,
			name = "湖南省",
			city = "怀化市",
			qu = "鹤城区",
		},
		[2112]=
		{
			id = 2112,
			code = 431221,
			name = "湖南省",
			city = "怀化市",
			qu = "中方县",
		},
		[2113]=
		{
			id = 2113,
			code = 431222,
			name = "湖南省",
			city = "怀化市",
			qu = "沅陵县",
		},
		[2114]=
		{
			id = 2114,
			code = 431223,
			name = "湖南省",
			city = "怀化市",
			qu = "辰溪县",
		},
		[2115]=
		{
			id = 2115,
			code = 431224,
			name = "湖南省",
			city = "怀化市",
			qu = "溆浦县",
		},
		[2116]=
		{
			id = 2116,
			code = 431225,
			name = "湖南省",
			city = "怀化市",
			qu = "会同县",
		},
		[2117]=
		{
			id = 2117,
			code = 431226,
			name = "湖南省",
			city = "怀化市",
			qu = "麻阳苗族自治县",
		},
		[2118]=
		{
			id = 2118,
			code = 431227,
			name = "湖南省",
			city = "怀化市",
			qu = "新晃侗族自治县",
		},
		[2119]=
		{
			id = 2119,
			code = 431228,
			name = "湖南省",
			city = "怀化市",
			qu = "芷江侗族自治县",
		},
		[2120]=
		{
			id = 2120,
			code = 431229,
			name = "湖南省",
			city = "怀化市",
			qu = "靖州苗族侗族自治县",
		},
		[2121]=
		{
			id = 2121,
			code = 431230,
			name = "湖南省",
			city = "怀化市",
			qu = "通道侗族自治县",
		},
		[2122]=
		{
			id = 2122,
			code = 431281,
			name = "湖南省",
			city = "怀化市",
			qu = "洪江市",
		},
		[2123]=
		{
			id = 2123,
			code = 431300,
			name = "湖南省",
			city = "娄底市",
		},
		[2124]=
		{
			id = 2124,
			code = 431301,
			name = "湖南省",
			city = "娄底市",
			qu = "市辖区",
		},
		[2125]=
		{
			id = 2125,
			code = 431302,
			name = "湖南省",
			city = "娄底市",
			qu = "娄星区",
		},
		[2126]=
		{
			id = 2126,
			code = 431321,
			name = "湖南省",
			city = "娄底市",
			qu = "双峰县",
		},
		[2127]=
		{
			id = 2127,
			code = 431322,
			name = "湖南省",
			city = "娄底市",
			qu = "新化县",
		},
		[2128]=
		{
			id = 2128,
			code = 431381,
			name = "湖南省",
			city = "娄底市",
			qu = "冷水江市",
		},
		[2129]=
		{
			id = 2129,
			code = 431382,
			name = "湖南省",
			city = "娄底市",
			qu = "涟源市",
		},
		[2130]=
		{
			id = 2130,
			code = 433100,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
		},
		[2131]=
		{
			id = 2131,
			code = 433101,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
			qu = "吉首市",
		},
		[2132]=
		{
			id = 2132,
			code = 433122,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
			qu = "泸溪县",
		},
		[2133]=
		{
			id = 2133,
			code = 433123,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
			qu = "凤凰县",
		},
		[2134]=
		{
			id = 2134,
			code = 433124,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
			qu = "花垣县",
		},
		[2135]=
		{
			id = 2135,
			code = 433125,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
			qu = "保靖县",
		},
		[2136]=
		{
			id = 2136,
			code = 433126,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
			qu = "古丈县",
		},
		[2137]=
		{
			id = 2137,
			code = 433127,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
			qu = "永顺县",
		},
		[2138]=
		{
			id = 2138,
			code = 433130,
			name = "湖南省",
			city = "湘西土家族苗族自治州",
			qu = "龙山县",
		},
		[2139]=
		{
			id = 2139,
			code = 440000,
			name = "广东省",
		},
		[2140]=
		{
			id = 2140,
			code = 440100,
			name = "广东省",
			city = "广州市",
		},
		[2141]=
		{
			id = 2141,
			code = 440101,
			name = "广东省",
			city = "广州市",
			qu = "市辖区",
		},
		[2142]=
		{
			id = 2142,
			code = 440103,
			name = "广东省",
			city = "广州市",
			qu = "荔湾区",
		},
		[2143]=
		{
			id = 2143,
			code = 440104,
			name = "广东省",
			city = "广州市",
			qu = "越秀区",
		},
		[2144]=
		{
			id = 2144,
			code = 440105,
			name = "广东省",
			city = "广州市",
			qu = "海珠区",
		},
		[2145]=
		{
			id = 2145,
			code = 440106,
			name = "广东省",
			city = "广州市",
			qu = "天河区",
		},
		[2146]=
		{
			id = 2146,
			code = 440111,
			name = "广东省",
			city = "广州市",
			qu = "白云区",
		},
		[2147]=
		{
			id = 2147,
			code = 440112,
			name = "广东省",
			city = "广州市",
			qu = "黄埔区",
		},
		[2148]=
		{
			id = 2148,
			code = 440113,
			name = "广东省",
			city = "广州市",
			qu = "番禺区",
		},
		[2149]=
		{
			id = 2149,
			code = 440114,
			name = "广东省",
			city = "广州市",
			qu = "花都区",
		},
		[2150]=
		{
			id = 2150,
			code = 440115,
			name = "广东省",
			city = "广州市",
			qu = "南沙区",
		},
		[2151]=
		{
			id = 2151,
			code = 440116,
			name = "广东省",
			city = "广州市",
			qu = "萝岗区",
		},
		[2152]=
		{
			id = 2152,
			code = 440183,
			name = "广东省",
			city = "广州市",
			qu = "增城市",
		},
		[2153]=
		{
			id = 2153,
			code = 440184,
			name = "广东省",
			city = "广州市",
			qu = "从化市",
		},
		[2154]=
		{
			id = 2154,
			code = 440200,
			name = "广东省",
			city = "韶关市",
		},
		[2155]=
		{
			id = 2155,
			code = 440201,
			name = "广东省",
			city = "韶关市",
			qu = "市辖区",
		},
		[2156]=
		{
			id = 2156,
			code = 440203,
			name = "广东省",
			city = "韶关市",
			qu = "武江区",
		},
		[2157]=
		{
			id = 2157,
			code = 440204,
			name = "广东省",
			city = "韶关市",
			qu = "浈江区",
		},
		[2158]=
		{
			id = 2158,
			code = 440205,
			name = "广东省",
			city = "韶关市",
			qu = "曲江区",
		},
		[2159]=
		{
			id = 2159,
			code = 440222,
			name = "广东省",
			city = "韶关市",
			qu = "始兴县",
		},
		[2160]=
		{
			id = 2160,
			code = 440224,
			name = "广东省",
			city = "韶关市",
			qu = "仁化县",
		},
		[2161]=
		{
			id = 2161,
			code = 440229,
			name = "广东省",
			city = "韶关市",
			qu = "翁源县",
		},
		[2162]=
		{
			id = 2162,
			code = 440232,
			name = "广东省",
			city = "韶关市",
			qu = "乳源瑶族自治县",
		},
		[2163]=
		{
			id = 2163,
			code = 440233,
			name = "广东省",
			city = "韶关市",
			qu = "新丰县",
		},
		[2164]=
		{
			id = 2164,
			code = 440281,
			name = "广东省",
			city = "韶关市",
			qu = "乐昌市",
		},
		[2165]=
		{
			id = 2165,
			code = 440282,
			name = "广东省",
			city = "韶关市",
			qu = "南雄市",
		},
		[2166]=
		{
			id = 2166,
			code = 440300,
			name = "广东省",
			city = "深圳市",
		},
		[2167]=
		{
			id = 2167,
			code = 440301,
			name = "广东省",
			city = "深圳市",
			qu = "市辖区",
		},
		[2168]=
		{
			id = 2168,
			code = 440303,
			name = "广东省",
			city = "深圳市",
			qu = "罗湖区",
		},
		[2169]=
		{
			id = 2169,
			code = 440304,
			name = "广东省",
			city = "深圳市",
			qu = "福田区",
		},
		[2170]=
		{
			id = 2170,
			code = 440305,
			name = "广东省",
			city = "深圳市",
			qu = "南山区",
		},
		[2171]=
		{
			id = 2171,
			code = 440306,
			name = "广东省",
			city = "深圳市",
			qu = "宝安区",
		},
		[2172]=
		{
			id = 2172,
			code = 440307,
			name = "广东省",
			city = "深圳市",
			qu = "龙岗区",
		},
		[2173]=
		{
			id = 2173,
			code = 440308,
			name = "广东省",
			city = "深圳市",
			qu = "盐田区",
		},
		[2174]=
		{
			id = 2174,
			code = 440400,
			name = "广东省",
			city = "珠海市",
		},
		[2175]=
		{
			id = 2175,
			code = 440401,
			name = "广东省",
			city = "珠海市",
			qu = "市辖区",
		},
		[2176]=
		{
			id = 2176,
			code = 440402,
			name = "广东省",
			city = "珠海市",
			qu = "香洲区",
		},
		[2177]=
		{
			id = 2177,
			code = 440403,
			name = "广东省",
			city = "珠海市",
			qu = "斗门区",
		},
		[2178]=
		{
			id = 2178,
			code = 440404,
			name = "广东省",
			city = "珠海市",
			qu = "金湾区",
		},
		[2179]=
		{
			id = 2179,
			code = 440500,
			name = "广东省",
			city = "汕头市",
		},
		[2180]=
		{
			id = 2180,
			code = 440501,
			name = "广东省",
			city = "汕头市",
			qu = "市辖区",
		},
		[2181]=
		{
			id = 2181,
			code = 440507,
			name = "广东省",
			city = "汕头市",
			qu = "龙湖区",
		},
		[2182]=
		{
			id = 2182,
			code = 440511,
			name = "广东省",
			city = "汕头市",
			qu = "金平区",
		},
		[2183]=
		{
			id = 2183,
			code = 440512,
			name = "广东省",
			city = "汕头市",
			qu = "濠江区",
		},
		[2184]=
		{
			id = 2184,
			code = 440513,
			name = "广东省",
			city = "汕头市",
			qu = "潮阳区",
		},
		[2185]=
		{
			id = 2185,
			code = 440514,
			name = "广东省",
			city = "汕头市",
			qu = "潮南区",
		},
		[2186]=
		{
			id = 2186,
			code = 440515,
			name = "广东省",
			city = "汕头市",
			qu = "澄海区",
		},
		[2187]=
		{
			id = 2187,
			code = 440523,
			name = "广东省",
			city = "汕头市",
			qu = "南澳县",
		},
		[2188]=
		{
			id = 2188,
			code = 440600,
			name = "广东省",
			city = "佛山市",
		},
		[2189]=
		{
			id = 2189,
			code = 440601,
			name = "广东省",
			city = "佛山市",
			qu = "市辖区",
		},
		[2190]=
		{
			id = 2190,
			code = 440604,
			name = "广东省",
			city = "佛山市",
			qu = "禅城区",
		},
		[2191]=
		{
			id = 2191,
			code = 440605,
			name = "广东省",
			city = "佛山市",
			qu = "南海区",
		},
		[2192]=
		{
			id = 2192,
			code = 440606,
			name = "广东省",
			city = "佛山市",
			qu = "顺德区",
		},
		[2193]=
		{
			id = 2193,
			code = 440607,
			name = "广东省",
			city = "佛山市",
			qu = "三水区",
		},
		[2194]=
		{
			id = 2194,
			code = 440608,
			name = "广东省",
			city = "佛山市",
			qu = "高明区",
		},
		[2195]=
		{
			id = 2195,
			code = 440700,
			name = "广东省",
			city = "江门市",
		},
		[2196]=
		{
			id = 2196,
			code = 440701,
			name = "广东省",
			city = "江门市",
			qu = "市辖区",
		},
		[2197]=
		{
			id = 2197,
			code = 440703,
			name = "广东省",
			city = "江门市",
			qu = "蓬江区",
		},
		[2198]=
		{
			id = 2198,
			code = 440704,
			name = "广东省",
			city = "江门市",
			qu = "江海区",
		},
		[2199]=
		{
			id = 2199,
			code = 440705,
			name = "广东省",
			city = "江门市",
			qu = "新会区",
		},
		[2200]=
		{
			id = 2200,
			code = 440781,
			name = "广东省",
			city = "江门市",
			qu = "台山市",
		},
		[2201]=
		{
			id = 2201,
			code = 440783,
			name = "广东省",
			city = "江门市",
			qu = "开平市",
		},
		[2202]=
		{
			id = 2202,
			code = 440784,
			name = "广东省",
			city = "江门市",
			qu = "鹤山市",
		},
		[2203]=
		{
			id = 2203,
			code = 440785,
			name = "广东省",
			city = "江门市",
			qu = "恩平市",
		},
		[2204]=
		{
			id = 2204,
			code = 440800,
			name = "广东省",
			city = "湛江市",
		},
		[2205]=
		{
			id = 2205,
			code = 440801,
			name = "广东省",
			city = "湛江市",
			qu = "市辖区",
		},
		[2206]=
		{
			id = 2206,
			code = 440802,
			name = "广东省",
			city = "湛江市",
			qu = "赤坎区",
		},
		[2207]=
		{
			id = 2207,
			code = 440803,
			name = "广东省",
			city = "湛江市",
			qu = "霞山区",
		},
		[2208]=
		{
			id = 2208,
			code = 440804,
			name = "广东省",
			city = "湛江市",
			qu = "坡头区",
		},
		[2209]=
		{
			id = 2209,
			code = 440811,
			name = "广东省",
			city = "湛江市",
			qu = "麻章区",
		},
		[2210]=
		{
			id = 2210,
			code = 440823,
			name = "广东省",
			city = "湛江市",
			qu = "遂溪县",
		},
		[2211]=
		{
			id = 2211,
			code = 440825,
			name = "广东省",
			city = "湛江市",
			qu = "徐闻县",
		},
		[2212]=
		{
			id = 2212,
			code = 440881,
			name = "广东省",
			city = "湛江市",
			qu = "廉江市",
		},
		[2213]=
		{
			id = 2213,
			code = 440882,
			name = "广东省",
			city = "湛江市",
			qu = "雷州市",
		},
		[2214]=
		{
			id = 2214,
			code = 440883,
			name = "广东省",
			city = "湛江市",
			qu = "吴川市",
		},
		[2215]=
		{
			id = 2215,
			code = 440900,
			name = "广东省",
			city = "茂名市",
		},
		[2216]=
		{
			id = 2216,
			code = 440901,
			name = "广东省",
			city = "茂名市",
			qu = "市辖区",
		},
		[2217]=
		{
			id = 2217,
			code = 440902,
			name = "广东省",
			city = "茂名市",
			qu = "茂南区",
		},
		[2218]=
		{
			id = 2218,
			code = 440903,
			name = "广东省",
			city = "茂名市",
			qu = "茂港区",
		},
		[2219]=
		{
			id = 2219,
			code = 440923,
			name = "广东省",
			city = "茂名市",
			qu = "电白县",
		},
		[2220]=
		{
			id = 2220,
			code = 440981,
			name = "广东省",
			city = "茂名市",
			qu = "高州市",
		},
		[2221]=
		{
			id = 2221,
			code = 440982,
			name = "广东省",
			city = "茂名市",
			qu = "化州市",
		},
		[2222]=
		{
			id = 2222,
			code = 440983,
			name = "广东省",
			city = "茂名市",
			qu = "信宜市",
		},
		[2223]=
		{
			id = 2223,
			code = 441200,
			name = "广东省",
			city = "肇庆市",
		},
		[2224]=
		{
			id = 2224,
			code = 441201,
			name = "广东省",
			city = "肇庆市",
			qu = "市辖区",
		},
		[2225]=
		{
			id = 2225,
			code = 441202,
			name = "广东省",
			city = "肇庆市",
			qu = "端州区",
		},
		[2226]=
		{
			id = 2226,
			code = 441203,
			name = "广东省",
			city = "肇庆市",
			qu = "鼎湖区",
		},
		[2227]=
		{
			id = 2227,
			code = 441223,
			name = "广东省",
			city = "肇庆市",
			qu = "广宁县",
		},
		[2228]=
		{
			id = 2228,
			code = 441224,
			name = "广东省",
			city = "肇庆市",
			qu = "怀集县",
		},
		[2229]=
		{
			id = 2229,
			code = 441225,
			name = "广东省",
			city = "肇庆市",
			qu = "封开县",
		},
		[2230]=
		{
			id = 2230,
			code = 441226,
			name = "广东省",
			city = "肇庆市",
			qu = "德庆县",
		},
		[2231]=
		{
			id = 2231,
			code = 441283,
			name = "广东省",
			city = "肇庆市",
			qu = "高要市",
		},
		[2232]=
		{
			id = 2232,
			code = 441284,
			name = "广东省",
			city = "肇庆市",
			qu = "四会市",
		},
		[2233]=
		{
			id = 2233,
			code = 441300,
			name = "广东省",
			city = "惠州市",
		},
		[2234]=
		{
			id = 2234,
			code = 441301,
			name = "广东省",
			city = "惠州市",
			qu = "市辖区",
		},
		[2235]=
		{
			id = 2235,
			code = 441302,
			name = "广东省",
			city = "惠州市",
			qu = "惠城区",
		},
		[2236]=
		{
			id = 2236,
			code = 441303,
			name = "广东省",
			city = "惠州市",
			qu = "惠阳区",
		},
		[2237]=
		{
			id = 2237,
			code = 441322,
			name = "广东省",
			city = "惠州市",
			qu = "博罗县",
		},
		[2238]=
		{
			id = 2238,
			code = 441323,
			name = "广东省",
			city = "惠州市",
			qu = "惠东县",
		},
		[2239]=
		{
			id = 2239,
			code = 441324,
			name = "广东省",
			city = "惠州市",
			qu = "龙门县",
		},
		[2240]=
		{
			id = 2240,
			code = 441400,
			name = "广东省",
			city = "梅州市",
		},
		[2241]=
		{
			id = 2241,
			code = 441401,
			name = "广东省",
			city = "梅州市",
			qu = "市辖区",
		},
		[2242]=
		{
			id = 2242,
			code = 441402,
			name = "广东省",
			city = "梅州市",
			qu = "梅江区",
		},
		[2243]=
		{
			id = 2243,
			code = 441421,
			name = "广东省",
			city = "梅州市",
			qu = "梅县",
		},
		[2244]=
		{
			id = 2244,
			code = 441422,
			name = "广东省",
			city = "梅州市",
			qu = "大埔县",
		},
		[2245]=
		{
			id = 2245,
			code = 441423,
			name = "广东省",
			city = "梅州市",
			qu = "丰顺县",
		},
		[2246]=
		{
			id = 2246,
			code = 441424,
			name = "广东省",
			city = "梅州市",
			qu = "五华县",
		},
		[2247]=
		{
			id = 2247,
			code = 441426,
			name = "广东省",
			city = "梅州市",
			qu = "平远县",
		},
		[2248]=
		{
			id = 2248,
			code = 441427,
			name = "广东省",
			city = "梅州市",
			qu = "蕉岭县",
		},
		[2249]=
		{
			id = 2249,
			code = 441481,
			name = "广东省",
			city = "梅州市",
			qu = "兴宁市",
		},
		[2250]=
		{
			id = 2250,
			code = 441500,
			name = "广东省",
			city = "汕尾市",
		},
		[2251]=
		{
			id = 2251,
			code = 441501,
			name = "广东省",
			city = "汕尾市",
			qu = "市辖区",
		},
		[2252]=
		{
			id = 2252,
			code = 441502,
			name = "广东省",
			city = "汕尾市",
			qu = "城区",
		},
		[2253]=
		{
			id = 2253,
			code = 441521,
			name = "广东省",
			city = "汕尾市",
			qu = "海丰县",
		},
		[2254]=
		{
			id = 2254,
			code = 441523,
			name = "广东省",
			city = "汕尾市",
			qu = "陆河县",
		},
		[2255]=
		{
			id = 2255,
			code = 441581,
			name = "广东省",
			city = "汕尾市",
			qu = "陆丰市",
		},
		[2256]=
		{
			id = 2256,
			code = 441600,
			name = "广东省",
			city = "河源市",
		},
		[2257]=
		{
			id = 2257,
			code = 441601,
			name = "广东省",
			city = "河源市",
			qu = "市辖区",
		},
		[2258]=
		{
			id = 2258,
			code = 441602,
			name = "广东省",
			city = "河源市",
			qu = "源城区",
		},
		[2259]=
		{
			id = 2259,
			code = 441621,
			name = "广东省",
			city = "河源市",
			qu = "紫金县",
		},
		[2260]=
		{
			id = 2260,
			code = 441622,
			name = "广东省",
			city = "河源市",
			qu = "龙川县",
		},
		[2261]=
		{
			id = 2261,
			code = 441623,
			name = "广东省",
			city = "河源市",
			qu = "连平县",
		},
		[2262]=
		{
			id = 2262,
			code = 441624,
			name = "广东省",
			city = "河源市",
			qu = "和平县",
		},
		[2263]=
		{
			id = 2263,
			code = 441625,
			name = "广东省",
			city = "河源市",
			qu = "东源县",
		},
		[2264]=
		{
			id = 2264,
			code = 441700,
			name = "广东省",
			city = "阳江市",
		},
		[2265]=
		{
			id = 2265,
			code = 441701,
			name = "广东省",
			city = "阳江市",
			qu = "市辖区",
		},
		[2266]=
		{
			id = 2266,
			code = 441702,
			name = "广东省",
			city = "阳江市",
			qu = "江城区",
		},
		[2267]=
		{
			id = 2267,
			code = 441721,
			name = "广东省",
			city = "阳江市",
			qu = "阳西县",
		},
		[2268]=
		{
			id = 2268,
			code = 441723,
			name = "广东省",
			city = "阳江市",
			qu = "阳东县",
		},
		[2269]=
		{
			id = 2269,
			code = 441781,
			name = "广东省",
			city = "阳江市",
			qu = "阳春市",
		},
		[2270]=
		{
			id = 2270,
			code = 441800,
			name = "广东省",
			city = "清远市",
		},
		[2271]=
		{
			id = 2271,
			code = 441801,
			name = "广东省",
			city = "清远市",
			qu = "市辖区",
		},
		[2272]=
		{
			id = 2272,
			code = 441802,
			name = "广东省",
			city = "清远市",
			qu = "清城区",
		},
		[2273]=
		{
			id = 2273,
			code = 441821,
			name = "广东省",
			city = "清远市",
			qu = "佛冈县",
		},
		[2274]=
		{
			id = 2274,
			code = 441823,
			name = "广东省",
			city = "清远市",
			qu = "阳山县",
		},
		[2275]=
		{
			id = 2275,
			code = 441825,
			name = "广东省",
			city = "清远市",
			qu = "连山壮族瑶族自治县",
		},
		[2276]=
		{
			id = 2276,
			code = 441826,
			name = "广东省",
			city = "清远市",
			qu = "连南瑶族自治县",
		},
		[2277]=
		{
			id = 2277,
			code = 441827,
			name = "广东省",
			city = "清远市",
			qu = "清新县",
		},
		[2278]=
		{
			id = 2278,
			code = 441881,
			name = "广东省",
			city = "清远市",
			qu = "英德市",
		},
		[2279]=
		{
			id = 2279,
			code = 441882,
			name = "广东省",
			city = "清远市",
			qu = "连州市",
		},
		[2280]=
		{
			id = 2280,
			code = 441900,
			name = "广东省",
			city = "东莞市",
		},
		[2281]=
		{
			id = 2281,
			code = 442000,
			name = "广东省",
			city = "中山市",
		},
		[2282]=
		{
			id = 2282,
			code = 445100,
			name = "广东省",
			city = "潮州市",
		},
		[2283]=
		{
			id = 2283,
			code = 445101,
			name = "广东省",
			city = "潮州市",
			qu = "市辖区",
		},
		[2284]=
		{
			id = 2284,
			code = 445102,
			name = "广东省",
			city = "潮州市",
			qu = "湘桥区",
		},
		[2285]=
		{
			id = 2285,
			code = 445121,
			name = "广东省",
			city = "潮州市",
			qu = "潮安县",
		},
		[2286]=
		{
			id = 2286,
			code = 445122,
			name = "广东省",
			city = "潮州市",
			qu = "饶平县",
		},
		[2287]=
		{
			id = 2287,
			code = 445200,
			name = "广东省",
			city = "揭阳市",
		},
		[2288]=
		{
			id = 2288,
			code = 445201,
			name = "广东省",
			city = "揭阳市",
			qu = "市辖区",
		},
		[2289]=
		{
			id = 2289,
			code = 445202,
			name = "广东省",
			city = "揭阳市",
			qu = "榕城区",
		},
		[2290]=
		{
			id = 2290,
			code = 445221,
			name = "广东省",
			city = "揭阳市",
			qu = "揭东县",
		},
		[2291]=
		{
			id = 2291,
			code = 445222,
			name = "广东省",
			city = "揭阳市",
			qu = "揭西县",
		},
		[2292]=
		{
			id = 2292,
			code = 445224,
			name = "广东省",
			city = "揭阳市",
			qu = "惠来县",
		},
		[2293]=
		{
			id = 2293,
			code = 445281,
			name = "广东省",
			city = "揭阳市",
			qu = "普宁市",
		},
		[2294]=
		{
			id = 2294,
			code = 445300,
			name = "广东省",
			city = "云浮市",
		},
		[2295]=
		{
			id = 2295,
			code = 445301,
			name = "广东省",
			city = "云浮市",
			qu = "市辖区",
		},
		[2296]=
		{
			id = 2296,
			code = 445302,
			name = "广东省",
			city = "云浮市",
			qu = "云城区",
		},
		[2297]=
		{
			id = 2297,
			code = 445321,
			name = "广东省",
			city = "云浮市",
			qu = "新兴县",
		},
		[2298]=
		{
			id = 2298,
			code = 445322,
			name = "广东省",
			city = "云浮市",
			qu = "郁南县",
		},
		[2299]=
		{
			id = 2299,
			code = 445323,
			name = "广东省",
			city = "云浮市",
			qu = "云安县",
		},
		[2300]=
		{
			id = 2300,
			code = 445381,
			name = "广东省",
			city = "云浮市",
			qu = "罗定市",
		},
		[2301]=
		{
			id = 2301,
			code = 450000,
			name = "广西壮族自治区",
		},
		[2302]=
		{
			id = 2302,
			code = 450100,
			name = "广西壮族自治区",
			city = "南宁市",
		},
		[2303]=
		{
			id = 2303,
			code = 450101,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "市辖区",
		},
		[2304]=
		{
			id = 2304,
			code = 450102,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "兴宁区",
		},
		[2305]=
		{
			id = 2305,
			code = 450103,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "青秀区",
		},
		[2306]=
		{
			id = 2306,
			code = 450105,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "江南区",
		},
		[2307]=
		{
			id = 2307,
			code = 450107,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "西乡塘区",
		},
		[2308]=
		{
			id = 2308,
			code = 450108,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "良庆区",
		},
		[2309]=
		{
			id = 2309,
			code = 450109,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "邕宁区",
		},
		[2310]=
		{
			id = 2310,
			code = 450122,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "武鸣县",
		},
		[2311]=
		{
			id = 2311,
			code = 450123,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "隆安县",
		},
		[2312]=
		{
			id = 2312,
			code = 450124,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "马山县",
		},
		[2313]=
		{
			id = 2313,
			code = 450125,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "上林县",
		},
		[2314]=
		{
			id = 2314,
			code = 450126,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "宾阳县",
		},
		[2315]=
		{
			id = 2315,
			code = 450127,
			name = "广西壮族自治区",
			city = "南宁市",
			qu = "横县",
		},
		[2316]=
		{
			id = 2316,
			code = 450200,
			name = "广西壮族自治区",
			city = "柳州市",
		},
		[2317]=
		{
			id = 2317,
			code = 450201,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "市辖区",
		},
		[2318]=
		{
			id = 2318,
			code = 450202,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "城中区",
		},
		[2319]=
		{
			id = 2319,
			code = 450203,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "鱼峰区",
		},
		[2320]=
		{
			id = 2320,
			code = 450204,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "柳南区",
		},
		[2321]=
		{
			id = 2321,
			code = 450205,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "柳北区",
		},
		[2322]=
		{
			id = 2322,
			code = 450221,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "柳江县",
		},
		[2323]=
		{
			id = 2323,
			code = 450222,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "柳城县",
		},
		[2324]=
		{
			id = 2324,
			code = 450223,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "鹿寨县",
		},
		[2325]=
		{
			id = 2325,
			code = 450224,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "融安县",
		},
		[2326]=
		{
			id = 2326,
			code = 450225,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "融水苗族自治县",
		},
		[2327]=
		{
			id = 2327,
			code = 450226,
			name = "广西壮族自治区",
			city = "柳州市",
			qu = "三江侗族自治县",
		},
		[2328]=
		{
			id = 2328,
			code = 450300,
			name = "广西壮族自治区",
			city = "桂林市",
		},
		[2329]=
		{
			id = 2329,
			code = 450301,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "市辖区",
		},
		[2330]=
		{
			id = 2330,
			code = 450302,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "秀峰区",
		},
		[2331]=
		{
			id = 2331,
			code = 450303,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "叠彩区",
		},
		[2332]=
		{
			id = 2332,
			code = 450304,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "象山区",
		},
		[2333]=
		{
			id = 2333,
			code = 450305,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "七星区",
		},
		[2334]=
		{
			id = 2334,
			code = 450311,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "雁山区",
		},
		[2335]=
		{
			id = 2335,
			code = 450321,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "阳朔县",
		},
		[2336]=
		{
			id = 2336,
			code = 450322,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "临桂县",
		},
		[2337]=
		{
			id = 2337,
			code = 450323,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "灵川县",
		},
		[2338]=
		{
			id = 2338,
			code = 450324,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "全州县",
		},
		[2339]=
		{
			id = 2339,
			code = 450325,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "兴安县",
		},
		[2340]=
		{
			id = 2340,
			code = 450326,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "永福县",
		},
		[2341]=
		{
			id = 2341,
			code = 450327,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "灌阳县",
		},
		[2342]=
		{
			id = 2342,
			code = 450328,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "龙胜各族自治县",
		},
		[2343]=
		{
			id = 2343,
			code = 450329,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "资源县",
		},
		[2344]=
		{
			id = 2344,
			code = 450330,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "平乐县",
		},
		[2345]=
		{
			id = 2345,
			code = 450331,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "荔蒲县",
		},
		[2346]=
		{
			id = 2346,
			code = 450332,
			name = "广西壮族自治区",
			city = "桂林市",
			qu = "恭城瑶族自治县",
		},
		[2347]=
		{
			id = 2347,
			code = 450400,
			name = "广西壮族自治区",
			city = "梧州市",
		},
		[2348]=
		{
			id = 2348,
			code = 450401,
			name = "广西壮族自治区",
			city = "梧州市",
			qu = "市辖区",
		},
		[2349]=
		{
			id = 2349,
			code = 450403,
			name = "广西壮族自治区",
			city = "梧州市",
			qu = "万秀区",
		},
		[2350]=
		{
			id = 2350,
			code = 450404,
			name = "广西壮族自治区",
			city = "梧州市",
			qu = "蝶山区",
		},
		[2351]=
		{
			id = 2351,
			code = 450405,
			name = "广西壮族自治区",
			city = "梧州市",
			qu = "长洲区",
		},
		[2352]=
		{
			id = 2352,
			code = 450421,
			name = "广西壮族自治区",
			city = "梧州市",
			qu = "苍梧县",
		},
		[2353]=
		{
			id = 2353,
			code = 450422,
			name = "广西壮族自治区",
			city = "梧州市",
			qu = "藤县",
		},
		[2354]=
		{
			id = 2354,
			code = 450423,
			name = "广西壮族自治区",
			city = "梧州市",
			qu = "蒙山县",
		},
		[2355]=
		{
			id = 2355,
			code = 450481,
			name = "广西壮族自治区",
			city = "梧州市",
			qu = "岑溪市",
		},
		[2356]=
		{
			id = 2356,
			code = 450500,
			name = "广西壮族自治区",
			city = "北海市",
		},
		[2357]=
		{
			id = 2357,
			code = 450501,
			name = "广西壮族自治区",
			city = "北海市",
			qu = "市辖区",
		},
		[2358]=
		{
			id = 2358,
			code = 450502,
			name = "广西壮族自治区",
			city = "北海市",
			qu = "海城区",
		},
		[2359]=
		{
			id = 2359,
			code = 450503,
			name = "广西壮族自治区",
			city = "北海市",
			qu = "银海区",
		},
		[2360]=
		{
			id = 2360,
			code = 450512,
			name = "广西壮族自治区",
			city = "北海市",
			qu = "铁山港区",
		},
		[2361]=
		{
			id = 2361,
			code = 450521,
			name = "广西壮族自治区",
			city = "北海市",
			qu = "合浦县",
		},
		[2362]=
		{
			id = 2362,
			code = 450600,
			name = "广西壮族自治区",
			city = "防城港市",
		},
		[2363]=
		{
			id = 2363,
			code = 450601,
			name = "广西壮族自治区",
			city = "防城港市",
			qu = "市辖区",
		},
		[2364]=
		{
			id = 2364,
			code = 450602,
			name = "广西壮族自治区",
			city = "防城港市",
			qu = "港口区",
		},
		[2365]=
		{
			id = 2365,
			code = 450603,
			name = "广西壮族自治区",
			city = "防城港市",
			qu = "防城区",
		},
		[2366]=
		{
			id = 2366,
			code = 450621,
			name = "广西壮族自治区",
			city = "防城港市",
			qu = "上思县",
		},
		[2367]=
		{
			id = 2367,
			code = 450681,
			name = "广西壮族自治区",
			city = "防城港市",
			qu = "东兴市",
		},
		[2368]=
		{
			id = 2368,
			code = 450700,
			name = "广西壮族自治区",
			city = "钦州市",
		},
		[2369]=
		{
			id = 2369,
			code = 450701,
			name = "广西壮族自治区",
			city = "钦州市",
			qu = "市辖区",
		},
		[2370]=
		{
			id = 2370,
			code = 450702,
			name = "广西壮族自治区",
			city = "钦州市",
			qu = "钦南区",
		},
		[2371]=
		{
			id = 2371,
			code = 450703,
			name = "广西壮族自治区",
			city = "钦州市",
			qu = "钦北区",
		},
		[2372]=
		{
			id = 2372,
			code = 450721,
			name = "广西壮族自治区",
			city = "钦州市",
			qu = "灵山县",
		},
		[2373]=
		{
			id = 2373,
			code = 450722,
			name = "广西壮族自治区",
			city = "钦州市",
			qu = "浦北县",
		},
		[2374]=
		{
			id = 2374,
			code = 450800,
			name = "广西壮族自治区",
			city = "贵港市",
		},
		[2375]=
		{
			id = 2375,
			code = 450801,
			name = "广西壮族自治区",
			city = "贵港市",
			qu = "市辖区",
		},
		[2376]=
		{
			id = 2376,
			code = 450802,
			name = "广西壮族自治区",
			city = "贵港市",
			qu = "港北区",
		},
		[2377]=
		{
			id = 2377,
			code = 450803,
			name = "广西壮族自治区",
			city = "贵港市",
			qu = "港南区",
		},
		[2378]=
		{
			id = 2378,
			code = 450804,
			name = "广西壮族自治区",
			city = "贵港市",
			qu = "覃塘区",
		},
		[2379]=
		{
			id = 2379,
			code = 450821,
			name = "广西壮族自治区",
			city = "贵港市",
			qu = "平南县",
		},
		[2380]=
		{
			id = 2380,
			code = 450881,
			name = "广西壮族自治区",
			city = "贵港市",
			qu = "桂平市",
		},
		[2381]=
		{
			id = 2381,
			code = 450900,
			name = "广西壮族自治区",
			city = "玉林市",
		},
		[2382]=
		{
			id = 2382,
			code = 450901,
			name = "广西壮族自治区",
			city = "玉林市",
			qu = "市辖区",
		},
		[2383]=
		{
			id = 2383,
			code = 450902,
			name = "广西壮族自治区",
			city = "玉林市",
			qu = "玉州区",
		},
		[2384]=
		{
			id = 2384,
			code = 450903,
			name = "广西壮族自治区",
			city = "玉林市",
			qu = "福绵区",
		},
		[2385]=
		{
			id = 2385,
			code = 450921,
			name = "广西壮族自治区",
			city = "玉林市",
			qu = "容县",
		},
		[2386]=
		{
			id = 2386,
			code = 450922,
			name = "广西壮族自治区",
			city = "玉林市",
			qu = "陆川县",
		},
		[2387]=
		{
			id = 2387,
			code = 450923,
			name = "广西壮族自治区",
			city = "玉林市",
			qu = "博白县",
		},
		[2388]=
		{
			id = 2388,
			code = 450924,
			name = "广西壮族自治区",
			city = "玉林市",
			qu = "兴业县",
		},
		[2389]=
		{
			id = 2389,
			code = 450981,
			name = "广西壮族自治区",
			city = "玉林市",
			qu = "北流市",
		},
		[2390]=
		{
			id = 2390,
			code = 451000,
			name = "广西壮族自治区",
			city = "百色市",
		},
		[2391]=
		{
			id = 2391,
			code = 451001,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "市辖区",
		},
		[2392]=
		{
			id = 2392,
			code = 451002,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "右江区",
		},
		[2393]=
		{
			id = 2393,
			code = 451021,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "田阳县",
		},
		[2394]=
		{
			id = 2394,
			code = 451022,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "田东县",
		},
		[2395]=
		{
			id = 2395,
			code = 451023,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "平果县",
		},
		[2396]=
		{
			id = 2396,
			code = 451024,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "德保县",
		},
		[2397]=
		{
			id = 2397,
			code = 451025,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "靖西县",
		},
		[2398]=
		{
			id = 2398,
			code = 451026,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "那坡县",
		},
		[2399]=
		{
			id = 2399,
			code = 451027,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "凌云县",
		},
		[2400]=
		{
			id = 2400,
			code = 451028,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "乐业县",
		},
		[2401]=
		{
			id = 2401,
			code = 451029,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "田林县",
		},
		[2402]=
		{
			id = 2402,
			code = 451030,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "西林县",
		},
		[2403]=
		{
			id = 2403,
			code = 451031,
			name = "广西壮族自治区",
			city = "百色市",
			qu = "隆林各族自治县",
		},
		[2404]=
		{
			id = 2404,
			code = 451100,
			name = "广西壮族自治区",
			city = "贺州市",
		},
		[2405]=
		{
			id = 2405,
			code = 451101,
			name = "广西壮族自治区",
			city = "贺州市",
			qu = "市辖区",
		},
		[2406]=
		{
			id = 2406,
			code = 451102,
			name = "广西壮族自治区",
			city = "贺州市",
			qu = "八步区",
		},
		[2407]=
		{
			id = 2407,
			code = 451103,
			name = "广西壮族自治区",
			city = "贺州市",
			qu = "平桂区",
		},
		[2408]=
		{
			id = 2408,
			code = 451121,
			name = "广西壮族自治区",
			city = "贺州市",
			qu = "昭平县",
		},
		[2409]=
		{
			id = 2409,
			code = 451122,
			name = "广西壮族自治区",
			city = "贺州市",
			qu = "钟山县",
		},
		[2410]=
		{
			id = 2410,
			code = 451123,
			name = "广西壮族自治区",
			city = "贺州市",
			qu = "富川瑶族自治县",
		},
		[2411]=
		{
			id = 2411,
			code = 451200,
			name = "广西壮族自治区",
			city = "河池市",
		},
		[2412]=
		{
			id = 2412,
			code = 451201,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "市辖区",
		},
		[2413]=
		{
			id = 2413,
			code = 451202,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "金城江区",
		},
		[2414]=
		{
			id = 2414,
			code = 451221,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "南丹县",
		},
		[2415]=
		{
			id = 2415,
			code = 451222,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "天峨县",
		},
		[2416]=
		{
			id = 2416,
			code = 451223,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "凤山县",
		},
		[2417]=
		{
			id = 2417,
			code = 451224,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "东兰县",
		},
		[2418]=
		{
			id = 2418,
			code = 451225,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "罗城仫佬族自治县",
		},
		[2419]=
		{
			id = 2419,
			code = 451226,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "环江毛南族自治县",
		},
		[2420]=
		{
			id = 2420,
			code = 451227,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "巴马瑶族自治县",
		},
		[2421]=
		{
			id = 2421,
			code = 451228,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "都安瑶族自治县",
		},
		[2422]=
		{
			id = 2422,
			code = 451229,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "大化瑶族自治县",
		},
		[2423]=
		{
			id = 2423,
			code = 451281,
			name = "广西壮族自治区",
			city = "河池市",
			qu = "宜州市",
		},
		[2424]=
		{
			id = 2424,
			code = 451300,
			name = "广西壮族自治区",
			city = "来宾市",
		},
		[2425]=
		{
			id = 2425,
			code = 451301,
			name = "广西壮族自治区",
			city = "来宾市",
			qu = "市辖区",
		},
		[2426]=
		{
			id = 2426,
			code = 451302,
			name = "广西壮族自治区",
			city = "来宾市",
			qu = "兴宾区",
		},
		[2427]=
		{
			id = 2427,
			code = 451321,
			name = "广西壮族自治区",
			city = "来宾市",
			qu = "忻城县",
		},
		[2428]=
		{
			id = 2428,
			code = 451322,
			name = "广西壮族自治区",
			city = "来宾市",
			qu = "象州县",
		},
		[2429]=
		{
			id = 2429,
			code = 451323,
			name = "广西壮族自治区",
			city = "来宾市",
			qu = "武宣县",
		},
		[2430]=
		{
			id = 2430,
			code = 451324,
			name = "广西壮族自治区",
			city = "来宾市",
			qu = "金秀瑶族自治县",
		},
		[2431]=
		{
			id = 2431,
			code = 451381,
			name = "广西壮族自治区",
			city = "来宾市",
			qu = "合山市",
		},
		[2432]=
		{
			id = 2432,
			code = 451400,
			name = "广西壮族自治区",
			city = "崇左市",
		},
		[2433]=
		{
			id = 2433,
			code = 451401,
			name = "广西壮族自治区",
			city = "崇左市",
			qu = "市辖区",
		},
		[2434]=
		{
			id = 2434,
			code = 451402,
			name = "广西壮族自治区",
			city = "崇左市",
			qu = "江州区",
		},
		[2435]=
		{
			id = 2435,
			code = 451421,
			name = "广西壮族自治区",
			city = "崇左市",
			qu = "扶绥县",
		},
		[2436]=
		{
			id = 2436,
			code = 451422,
			name = "广西壮族自治区",
			city = "崇左市",
			qu = "宁明县",
		},
		[2437]=
		{
			id = 2437,
			code = 451423,
			name = "广西壮族自治区",
			city = "崇左市",
			qu = "龙州县",
		},
		[2438]=
		{
			id = 2438,
			code = 451424,
			name = "广西壮族自治区",
			city = "崇左市",
			qu = "大新县",
		},
		[2439]=
		{
			id = 2439,
			code = 451425,
			name = "广西壮族自治区",
			city = "崇左市",
			qu = "天等县",
		},
		[2440]=
		{
			id = 2440,
			code = 451481,
			name = "广西壮族自治区",
			city = "崇左市",
			qu = "凭祥市",
		},
		[2441]=
		{
			id = 2441,
			code = 460000,
			name = "海南省",
		},
		[2442]=
		{
			id = 2442,
			code = 460100,
			name = "海南省",
			city = "海口市",
		},
		[2443]=
		{
			id = 2443,
			code = 460101,
			name = "海南省",
			city = "海口市",
			qu = "市辖区",
		},
		[2444]=
		{
			id = 2444,
			code = 460105,
			name = "海南省",
			city = "海口市",
			qu = "秀英区",
		},
		[2445]=
		{
			id = 2445,
			code = 460106,
			name = "海南省",
			city = "海口市",
			qu = "龙华区",
		},
		[2446]=
		{
			id = 2446,
			code = 460107,
			name = "海南省",
			city = "海口市",
			qu = "琼山区",
		},
		[2447]=
		{
			id = 2447,
			code = 460108,
			name = "海南省",
			city = "海口市",
			qu = "美兰区",
		},
		[2448]=
		{
			id = 2448,
			code = 460200,
			name = "海南省",
			city = "三亚市",
		},
		[2449]=
		{
			id = 2449,
			code = 460201,
			name = "海南省",
			city = "三亚市",
			qu = "市辖区",
		},
		[2450]=
		{
			id = 2450,
			code = 469000,
			name = "海南省",
			city = "省直辖县级行政单位",
		},
		[2451]=
		{
			id = 2451,
			code = 469001,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "五指山市",
		},
		[2452]=
		{
			id = 2452,
			code = 469002,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "琼海市",
		},
		[2453]=
		{
			id = 2453,
			code = 469003,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "儋州市",
		},
		[2454]=
		{
			id = 2454,
			code = 469005,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "文昌市",
		},
		[2455]=
		{
			id = 2455,
			code = 469006,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "万宁市",
		},
		[2456]=
		{
			id = 2456,
			code = 469007,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "东方市",
		},
		[2457]=
		{
			id = 2457,
			code = 469021,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "定安县",
		},
		[2458]=
		{
			id = 2458,
			code = 469022,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "屯昌县",
		},
		[2459]=
		{
			id = 2459,
			code = 469023,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "澄迈县",
		},
		[2460]=
		{
			id = 2460,
			code = 469024,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "临高县",
		},
		[2461]=
		{
			id = 2461,
			code = 469025,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "白沙黎族自治县",
		},
		[2462]=
		{
			id = 2462,
			code = 469026,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "昌江黎族自治县",
		},
		[2463]=
		{
			id = 2463,
			code = 469027,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "乐东黎族自治县",
		},
		[2464]=
		{
			id = 2464,
			code = 469028,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "陵水黎族自治县",
		},
		[2465]=
		{
			id = 2465,
			code = 469029,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "保亭黎族苗族自治县",
		},
		[2466]=
		{
			id = 2466,
			code = 469030,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "琼中黎族苗族自治县",
		},
		[2467]=
		{
			id = 2467,
			code = 469031,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "西沙群岛",
		},
		[2468]=
		{
			id = 2468,
			code = 469032,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "南沙群岛",
		},
		[2469]=
		{
			id = 2469,
			code = 469033,
			name = "海南省",
			city = "省直辖县级行政单位",
			qu = "中沙群岛的岛礁及其海域",
		},
		[2470]=
		{
			id = 2470,
			code = 500000,
			name = "重庆市",
		},
		[2471]=
		{
			id = 2471,
			code = 500100,
			name = "重庆市",
			city = "重庆市",
		},
		[2472]=
		{
			id = 2472,
			code = 500101,
			name = "重庆市",
			city = "重庆市",
			qu = "万州区",
		},
		[2473]=
		{
			id = 2473,
			code = 500102,
			name = "重庆市",
			city = "重庆市",
			qu = "涪陵区",
		},
		[2474]=
		{
			id = 2474,
			code = 500103,
			name = "重庆市",
			city = "重庆市",
			qu = "渝中区",
		},
		[2475]=
		{
			id = 2475,
			code = 500104,
			name = "重庆市",
			city = "重庆市",
			qu = "大渡口区",
		},
		[2476]=
		{
			id = 2476,
			code = 500105,
			name = "重庆市",
			city = "重庆市",
			qu = "江北区",
		},
		[2477]=
		{
			id = 2477,
			code = 500106,
			name = "重庆市",
			city = "重庆市",
			qu = "沙坪坝区",
		},
		[2478]=
		{
			id = 2478,
			code = 500107,
			name = "重庆市",
			city = "重庆市",
			qu = "九龙坡区",
		},
		[2479]=
		{
			id = 2479,
			code = 500108,
			name = "重庆市",
			city = "重庆市",
			qu = "南岸区",
		},
		[2480]=
		{
			id = 2480,
			code = 500109,
			name = "重庆市",
			city = "重庆市",
			qu = "北碚区",
		},
		[2481]=
		{
			id = 2481,
			code = 500110,
			name = "重庆市",
			city = "重庆市",
			qu = "万盛区",
		},
		[2482]=
		{
			id = 2482,
			code = 500111,
			name = "重庆市",
			city = "重庆市",
			qu = "双桥区",
		},
		[2483]=
		{
			id = 2483,
			code = 500112,
			name = "重庆市",
			city = "重庆市",
			qu = "渝北区",
		},
		[2484]=
		{
			id = 2484,
			code = 500113,
			name = "重庆市",
			city = "重庆市",
			qu = "巴南区",
		},
		[2485]=
		{
			id = 2485,
			code = 500114,
			name = "重庆市",
			city = "重庆市",
			qu = "黔江区",
		},
		[2486]=
		{
			id = 2486,
			code = 500115,
			name = "重庆市",
			city = "重庆市",
			qu = "长寿区",
		},
		[2487]=
		{
			id = 2487,
			code = 500116,
			name = "重庆市",
			city = "重庆市",
			qu = "江津区",
		},
		[2488]=
		{
			id = 2488,
			code = 500117,
			name = "重庆市",
			city = "重庆市",
			qu = "合川区",
		},
		[2489]=
		{
			id = 2489,
			code = 500118,
			name = "重庆市",
			city = "重庆市",
			qu = "永川区",
		},
		[2490]=
		{
			id = 2490,
			code = 500119,
			name = "重庆市",
			city = "重庆市",
			qu = "南川区",
		},
		[2491]=
		{
			id = 2491,
			code = 500200,
			name = "重庆市",
			city = "重庆市",
		},
		[2492]=
		{
			id = 2492,
			code = 500222,
			name = "重庆市",
			city = "重庆市",
			qu = "綦江县",
		},
		[2493]=
		{
			id = 2493,
			code = 500223,
			name = "重庆市",
			city = "重庆市",
			qu = "潼南县",
		},
		[2494]=
		{
			id = 2494,
			code = 500224,
			name = "重庆市",
			city = "重庆市",
			qu = "铜梁县",
		},
		[2495]=
		{
			id = 2495,
			code = 500225,
			name = "重庆市",
			city = "重庆市",
			qu = "大足县",
		},
		[2496]=
		{
			id = 2496,
			code = 500226,
			name = "重庆市",
			city = "重庆市",
			qu = "荣昌县",
		},
		[2497]=
		{
			id = 2497,
			code = 500227,
			name = "重庆市",
			city = "重庆市",
			qu = "璧山县",
		},
		[2498]=
		{
			id = 2498,
			code = 500228,
			name = "重庆市",
			city = "重庆市",
			qu = "梁平县",
		},
		[2499]=
		{
			id = 2499,
			code = 500229,
			name = "重庆市",
			city = "重庆市",
			qu = "城口县",
		},
		[2500]=
		{
			id = 2500,
			code = 500230,
			name = "重庆市",
			city = "重庆市",
			qu = "丰都县",
		},
		[2501]=
		{
			id = 2501,
			code = 500231,
			name = "重庆市",
			city = "重庆市",
			qu = "垫江县",
		},
		[2502]=
		{
			id = 2502,
			code = 500232,
			name = "重庆市",
			city = "重庆市",
			qu = "武隆县",
		},
		[2503]=
		{
			id = 2503,
			code = 500233,
			name = "重庆市",
			city = "重庆市",
			qu = "忠县",
		},
		[2504]=
		{
			id = 2504,
			code = 500234,
			name = "重庆市",
			city = "重庆市",
			qu = "开县",
		},
		[2505]=
		{
			id = 2505,
			code = 500235,
			name = "重庆市",
			city = "重庆市",
			qu = "云阳县",
		},
		[2506]=
		{
			id = 2506,
			code = 500236,
			name = "重庆市",
			city = "重庆市",
			qu = "奉节县",
		},
		[2507]=
		{
			id = 2507,
			code = 500237,
			name = "重庆市",
			city = "重庆市",
			qu = "巫山县",
		},
		[2508]=
		{
			id = 2508,
			code = 500238,
			name = "重庆市",
			city = "重庆市",
			qu = "巫溪县",
		},
		[2509]=
		{
			id = 2509,
			code = 500240,
			name = "重庆市",
			city = "重庆市",
			qu = "石柱土家族自治县",
		},
		[2510]=
		{
			id = 2510,
			code = 500241,
			name = "重庆市",
			city = "重庆市",
			qu = "秀山土家族苗族自治县",
		},
		[2511]=
		{
			id = 2511,
			code = 500242,
			name = "重庆市",
			city = "重庆市",
			qu = "酉阳土家族苗族自治县",
		},
		[2512]=
		{
			id = 2512,
			code = 500243,
			name = "重庆市",
			city = "重庆市",
			qu = "彭水苗族土家族自治县",
		},
		[2513]=
		{
			id = 2513,
			code = 510000,
			name = "四川省",
		},
		[2514]=
		{
			id = 2514,
			code = 510100,
			name = "四川省",
			city = "成都市",
		},
		[2515]=
		{
			id = 2515,
			code = 510101,
			name = "四川省",
			city = "成都市",
			qu = "市辖区",
		},
		[2516]=
		{
			id = 2516,
			code = 510104,
			name = "四川省",
			city = "成都市",
			qu = "锦江区",
		},
		[2517]=
		{
			id = 2517,
			code = 510105,
			name = "四川省",
			city = "成都市",
			qu = "青羊区",
		},
		[2518]=
		{
			id = 2518,
			code = 510106,
			name = "四川省",
			city = "成都市",
			qu = "金牛区",
		},
		[2519]=
		{
			id = 2519,
			code = 510107,
			name = "四川省",
			city = "成都市",
			qu = "武侯区",
		},
		[2520]=
		{
			id = 2520,
			code = 510108,
			name = "四川省",
			city = "成都市",
			qu = "成华区",
		},
		[2521]=
		{
			id = 2521,
			code = 510112,
			name = "四川省",
			city = "成都市",
			qu = "龙泉驿区",
		},
		[2522]=
		{
			id = 2522,
			code = 510113,
			name = "四川省",
			city = "成都市",
			qu = "青白江区",
		},
		[2523]=
		{
			id = 2523,
			code = 510114,
			name = "四川省",
			city = "成都市",
			qu = "新都区",
		},
		[2524]=
		{
			id = 2524,
			code = 510115,
			name = "四川省",
			city = "成都市",
			qu = "温江区",
		},
		[2525]=
		{
			id = 2525,
			code = 510121,
			name = "四川省",
			city = "成都市",
			qu = "金堂县",
		},
		[2526]=
		{
			id = 2526,
			code = 510122,
			name = "四川省",
			city = "成都市",
			qu = "双流县",
		},
		[2527]=
		{
			id = 2527,
			code = 510124,
			name = "四川省",
			city = "成都市",
			qu = "郫县",
		},
		[2528]=
		{
			id = 2528,
			code = 510129,
			name = "四川省",
			city = "成都市",
			qu = "大邑县",
		},
		[2529]=
		{
			id = 2529,
			code = 510131,
			name = "四川省",
			city = "成都市",
			qu = "蒲江县",
		},
		[2530]=
		{
			id = 2530,
			code = 510132,
			name = "四川省",
			city = "成都市",
			qu = "新津县",
		},
		[2531]=
		{
			id = 2531,
			code = 510181,
			name = "四川省",
			city = "成都市",
			qu = "都江堰市",
		},
		[2532]=
		{
			id = 2532,
			code = 510182,
			name = "四川省",
			city = "成都市",
			qu = "彭州市",
		},
		[2533]=
		{
			id = 2533,
			code = 510183,
			name = "四川省",
			city = "成都市",
			qu = "邛崃市",
		},
		[2534]=
		{
			id = 2534,
			code = 510184,
			name = "四川省",
			city = "成都市",
			qu = "崇州市",
		},
		[2535]=
		{
			id = 2535,
			code = 510300,
			name = "四川省",
			city = "自贡市",
		},
		[2536]=
		{
			id = 2536,
			code = 510301,
			name = "四川省",
			city = "自贡市",
			qu = "市辖区",
		},
		[2537]=
		{
			id = 2537,
			code = 510302,
			name = "四川省",
			city = "自贡市",
			qu = "自流井区",
		},
		[2538]=
		{
			id = 2538,
			code = 510303,
			name = "四川省",
			city = "自贡市",
			qu = "贡井区",
		},
		[2539]=
		{
			id = 2539,
			code = 510304,
			name = "四川省",
			city = "自贡市",
			qu = "大安区",
		},
		[2540]=
		{
			id = 2540,
			code = 510311,
			name = "四川省",
			city = "自贡市",
			qu = "沿滩区",
		},
		[2541]=
		{
			id = 2541,
			code = 510321,
			name = "四川省",
			city = "自贡市",
			qu = "荣县",
		},
		[2542]=
		{
			id = 2542,
			code = 510322,
			name = "四川省",
			city = "自贡市",
			qu = "富顺县",
		},
		[2543]=
		{
			id = 2543,
			code = 510400,
			name = "四川省",
			city = "攀枝花市",
		},
		[2544]=
		{
			id = 2544,
			code = 510401,
			name = "四川省",
			city = "攀枝花市",
			qu = "市辖区",
		},
		[2545]=
		{
			id = 2545,
			code = 510402,
			name = "四川省",
			city = "攀枝花市",
			qu = "东区",
		},
		[2546]=
		{
			id = 2546,
			code = 510403,
			name = "四川省",
			city = "攀枝花市",
			qu = "西区",
		},
		[2547]=
		{
			id = 2547,
			code = 510411,
			name = "四川省",
			city = "攀枝花市",
			qu = "仁和区",
		},
		[2548]=
		{
			id = 2548,
			code = 510421,
			name = "四川省",
			city = "攀枝花市",
			qu = "米易县",
		},
		[2549]=
		{
			id = 2549,
			code = 510422,
			name = "四川省",
			city = "攀枝花市",
			qu = "盐边县",
		},
		[2550]=
		{
			id = 2550,
			code = 510500,
			name = "四川省",
			city = "泸州市",
		},
		[2551]=
		{
			id = 2551,
			code = 510501,
			name = "四川省",
			city = "泸州市",
			qu = "市辖区",
		},
		[2552]=
		{
			id = 2552,
			code = 510502,
			name = "四川省",
			city = "泸州市",
			qu = "江阳区",
		},
		[2553]=
		{
			id = 2553,
			code = 510503,
			name = "四川省",
			city = "泸州市",
			qu = "纳溪区",
		},
		[2554]=
		{
			id = 2554,
			code = 510504,
			name = "四川省",
			city = "泸州市",
			qu = "龙马潭区",
		},
		[2555]=
		{
			id = 2555,
			code = 510521,
			name = "四川省",
			city = "泸州市",
			qu = "泸县",
		},
		[2556]=
		{
			id = 2556,
			code = 510522,
			name = "四川省",
			city = "泸州市",
			qu = "合江县",
		},
		[2557]=
		{
			id = 2557,
			code = 510524,
			name = "四川省",
			city = "泸州市",
			qu = "叙永县",
		},
		[2558]=
		{
			id = 2558,
			code = 510525,
			name = "四川省",
			city = "泸州市",
			qu = "古蔺县",
		},
		[2559]=
		{
			id = 2559,
			code = 510600,
			name = "四川省",
			city = "德阳市",
		},
		[2560]=
		{
			id = 2560,
			code = 510601,
			name = "四川省",
			city = "德阳市",
			qu = "市辖区",
		},
		[2561]=
		{
			id = 2561,
			code = 510603,
			name = "四川省",
			city = "德阳市",
			qu = "旌阳区",
		},
		[2562]=
		{
			id = 2562,
			code = 510623,
			name = "四川省",
			city = "德阳市",
			qu = "中江县",
		},
		[2563]=
		{
			id = 2563,
			code = 510626,
			name = "四川省",
			city = "德阳市",
			qu = "罗江县",
		},
		[2564]=
		{
			id = 2564,
			code = 510681,
			name = "四川省",
			city = "德阳市",
			qu = "广汉市",
		},
		[2565]=
		{
			id = 2565,
			code = 510682,
			name = "四川省",
			city = "德阳市",
			qu = "什邡市",
		},
		[2566]=
		{
			id = 2566,
			code = 510683,
			name = "四川省",
			city = "德阳市",
			qu = "绵竹市",
		},
		[2567]=
		{
			id = 2567,
			code = 510700,
			name = "四川省",
			city = "绵阳市",
		},
		[2568]=
		{
			id = 2568,
			code = 510701,
			name = "四川省",
			city = "绵阳市",
			qu = "市辖区",
		},
		[2569]=
		{
			id = 2569,
			code = 510703,
			name = "四川省",
			city = "绵阳市",
			qu = "涪城区",
		},
		[2570]=
		{
			id = 2570,
			code = 510704,
			name = "四川省",
			city = "绵阳市",
			qu = "游仙区",
		},
		[2571]=
		{
			id = 2571,
			code = 510722,
			name = "四川省",
			city = "绵阳市",
			qu = "三台县",
		},
		[2572]=
		{
			id = 2572,
			code = 510723,
			name = "四川省",
			city = "绵阳市",
			qu = "盐亭县",
		},
		[2573]=
		{
			id = 2573,
			code = 510724,
			name = "四川省",
			city = "绵阳市",
			qu = "安县",
		},
		[2574]=
		{
			id = 2574,
			code = 510725,
			name = "四川省",
			city = "绵阳市",
			qu = "梓潼县",
		},
		[2575]=
		{
			id = 2575,
			code = 510726,
			name = "四川省",
			city = "绵阳市",
			qu = "北川羌族自治县",
		},
		[2576]=
		{
			id = 2576,
			code = 510727,
			name = "四川省",
			city = "绵阳市",
			qu = "平武县",
		},
		[2577]=
		{
			id = 2577,
			code = 510781,
			name = "四川省",
			city = "绵阳市",
			qu = "江油市",
		},
		[2578]=
		{
			id = 2578,
			code = 510800,
			name = "四川省",
			city = "广元市",
		},
		[2579]=
		{
			id = 2579,
			code = 510801,
			name = "四川省",
			city = "广元市",
			qu = "市辖区",
		},
		[2580]=
		{
			id = 2580,
			code = 510802,
			name = "四川省",
			city = "广元市",
			qu = "市中区",
		},
		[2581]=
		{
			id = 2581,
			code = 510811,
			name = "四川省",
			city = "广元市",
			qu = "元坝区",
		},
		[2582]=
		{
			id = 2582,
			code = 510812,
			name = "四川省",
			city = "广元市",
			qu = "朝天区",
		},
		[2583]=
		{
			id = 2583,
			code = 510821,
			name = "四川省",
			city = "广元市",
			qu = "旺苍县",
		},
		[2584]=
		{
			id = 2584,
			code = 510822,
			name = "四川省",
			city = "广元市",
			qu = "青川县",
		},
		[2585]=
		{
			id = 2585,
			code = 510823,
			name = "四川省",
			city = "广元市",
			qu = "剑阁县",
		},
		[2586]=
		{
			id = 2586,
			code = 510824,
			name = "四川省",
			city = "广元市",
			qu = "苍溪县",
		},
		[2587]=
		{
			id = 2587,
			code = 510900,
			name = "四川省",
			city = "遂宁市",
		},
		[2588]=
		{
			id = 2588,
			code = 510901,
			name = "四川省",
			city = "遂宁市",
			qu = "市辖区",
		},
		[2589]=
		{
			id = 2589,
			code = 510903,
			name = "四川省",
			city = "遂宁市",
			qu = "船山区",
		},
		[2590]=
		{
			id = 2590,
			code = 510904,
			name = "四川省",
			city = "遂宁市",
			qu = "安居区",
		},
		[2591]=
		{
			id = 2591,
			code = 510921,
			name = "四川省",
			city = "遂宁市",
			qu = "蓬溪县",
		},
		[2592]=
		{
			id = 2592,
			code = 510922,
			name = "四川省",
			city = "遂宁市",
			qu = "射洪县",
		},
		[2593]=
		{
			id = 2593,
			code = 510923,
			name = "四川省",
			city = "遂宁市",
			qu = "大英县",
		},
		[2594]=
		{
			id = 2594,
			code = 511000,
			name = "四川省",
			city = "内江市",
		},
		[2595]=
		{
			id = 2595,
			code = 511001,
			name = "四川省",
			city = "内江市",
			qu = "市辖区",
		},
		[2596]=
		{
			id = 2596,
			code = 511002,
			name = "四川省",
			city = "内江市",
			qu = "市中区",
		},
		[2597]=
		{
			id = 2597,
			code = 511011,
			name = "四川省",
			city = "内江市",
			qu = "东兴区",
		},
		[2598]=
		{
			id = 2598,
			code = 511024,
			name = "四川省",
			city = "内江市",
			qu = "威远县",
		},
		[2599]=
		{
			id = 2599,
			code = 511025,
			name = "四川省",
			city = "内江市",
			qu = "资中县",
		},
		[2600]=
		{
			id = 2600,
			code = 511028,
			name = "四川省",
			city = "内江市",
			qu = "隆昌县",
		},
		[2601]=
		{
			id = 2601,
			code = 511100,
			name = "四川省",
			city = "乐山市",
		},
		[2602]=
		{
			id = 2602,
			code = 511101,
			name = "四川省",
			city = "乐山市",
			qu = "市辖区",
		},
		[2603]=
		{
			id = 2603,
			code = 511102,
			name = "四川省",
			city = "乐山市",
			qu = "市中区",
		},
		[2604]=
		{
			id = 2604,
			code = 511111,
			name = "四川省",
			city = "乐山市",
			qu = "沙湾区",
		},
		[2605]=
		{
			id = 2605,
			code = 511112,
			name = "四川省",
			city = "乐山市",
			qu = "五通桥区",
		},
		[2606]=
		{
			id = 2606,
			code = 511113,
			name = "四川省",
			city = "乐山市",
			qu = "金口河区",
		},
		[2607]=
		{
			id = 2607,
			code = 511123,
			name = "四川省",
			city = "乐山市",
			qu = "犍为县",
		},
		[2608]=
		{
			id = 2608,
			code = 511124,
			name = "四川省",
			city = "乐山市",
			qu = "井研县",
		},
		[2609]=
		{
			id = 2609,
			code = 511126,
			name = "四川省",
			city = "乐山市",
			qu = "夹江县",
		},
		[2610]=
		{
			id = 2610,
			code = 511129,
			name = "四川省",
			city = "乐山市",
			qu = "沐川县",
		},
		[2611]=
		{
			id = 2611,
			code = 511132,
			name = "四川省",
			city = "乐山市",
			qu = "峨边彝族自治县",
		},
		[2612]=
		{
			id = 2612,
			code = 511133,
			name = "四川省",
			city = "乐山市",
			qu = "马边彝族自治县",
		},
		[2613]=
		{
			id = 2613,
			code = 511181,
			name = "四川省",
			city = "乐山市",
			qu = "峨眉山市",
		},
		[2614]=
		{
			id = 2614,
			code = 511300,
			name = "四川省",
			city = "南充市",
		},
		[2615]=
		{
			id = 2615,
			code = 511301,
			name = "四川省",
			city = "南充市",
			qu = "市辖区",
		},
		[2616]=
		{
			id = 2616,
			code = 511302,
			name = "四川省",
			city = "南充市",
			qu = "顺庆区",
		},
		[2617]=
		{
			id = 2617,
			code = 511303,
			name = "四川省",
			city = "南充市",
			qu = "高坪区",
		},
		[2618]=
		{
			id = 2618,
			code = 511304,
			name = "四川省",
			city = "南充市",
			qu = "嘉陵区",
		},
		[2619]=
		{
			id = 2619,
			code = 511321,
			name = "四川省",
			city = "南充市",
			qu = "南部县",
		},
		[2620]=
		{
			id = 2620,
			code = 511322,
			name = "四川省",
			city = "南充市",
			qu = "营山县",
		},
		[2621]=
		{
			id = 2621,
			code = 511323,
			name = "四川省",
			city = "南充市",
			qu = "蓬安县",
		},
		[2622]=
		{
			id = 2622,
			code = 511324,
			name = "四川省",
			city = "南充市",
			qu = "仪陇县",
		},
		[2623]=
		{
			id = 2623,
			code = 511325,
			name = "四川省",
			city = "南充市",
			qu = "西充县",
		},
		[2624]=
		{
			id = 2624,
			code = 511381,
			name = "四川省",
			city = "南充市",
			qu = "阆中市",
		},
		[2625]=
		{
			id = 2625,
			code = 511400,
			name = "四川省",
			city = "眉山市",
		},
		[2626]=
		{
			id = 2626,
			code = 511401,
			name = "四川省",
			city = "眉山市",
			qu = "市辖区",
		},
		[2627]=
		{
			id = 2627,
			code = 511402,
			name = "四川省",
			city = "眉山市",
			qu = "东坡区",
		},
		[2628]=
		{
			id = 2628,
			code = 511421,
			name = "四川省",
			city = "眉山市",
			qu = "仁寿县",
		},
		[2629]=
		{
			id = 2629,
			code = 511422,
			name = "四川省",
			city = "眉山市",
			qu = "彭山县",
		},
		[2630]=
		{
			id = 2630,
			code = 511423,
			name = "四川省",
			city = "眉山市",
			qu = "洪雅县",
		},
		[2631]=
		{
			id = 2631,
			code = 511424,
			name = "四川省",
			city = "眉山市",
			qu = "丹棱县",
		},
		[2632]=
		{
			id = 2632,
			code = 511425,
			name = "四川省",
			city = "眉山市",
			qu = "青神县",
		},
		[2633]=
		{
			id = 2633,
			code = 511500,
			name = "四川省",
			city = "宜宾市",
		},
		[2634]=
		{
			id = 2634,
			code = 511501,
			name = "四川省",
			city = "宜宾市",
			qu = "市辖区",
		},
		[2635]=
		{
			id = 2635,
			code = 511502,
			name = "四川省",
			city = "宜宾市",
			qu = "翠屏区",
		},
		[2636]=
		{
			id = 2636,
			code = 511521,
			name = "四川省",
			city = "宜宾市",
			qu = "宜宾县",
		},
		[2637]=
		{
			id = 2637,
			code = 511522,
			name = "四川省",
			city = "宜宾市",
			qu = "南溪县",
		},
		[2638]=
		{
			id = 2638,
			code = 511523,
			name = "四川省",
			city = "宜宾市",
			qu = "江安县",
		},
		[2639]=
		{
			id = 2639,
			code = 511524,
			name = "四川省",
			city = "宜宾市",
			qu = "长宁县",
		},
		[2640]=
		{
			id = 2640,
			code = 511525,
			name = "四川省",
			city = "宜宾市",
			qu = "高县",
		},
		[2641]=
		{
			id = 2641,
			code = 511526,
			name = "四川省",
			city = "宜宾市",
			qu = "珙县",
		},
		[2642]=
		{
			id = 2642,
			code = 511527,
			name = "四川省",
			city = "宜宾市",
			qu = "筠连县",
		},
		[2643]=
		{
			id = 2643,
			code = 511528,
			name = "四川省",
			city = "宜宾市",
			qu = "兴文县",
		},
		[2644]=
		{
			id = 2644,
			code = 511529,
			name = "四川省",
			city = "宜宾市",
			qu = "屏山县",
		},
		[2645]=
		{
			id = 2645,
			code = 511600,
			name = "四川省",
			city = "广安市",
		},
		[2646]=
		{
			id = 2646,
			code = 511601,
			name = "四川省",
			city = "广安市",
			qu = "市辖区",
		},
		[2647]=
		{
			id = 2647,
			code = 511602,
			name = "四川省",
			city = "广安市",
			qu = "广安区",
		},
		[2648]=
		{
			id = 2648,
			code = 511621,
			name = "四川省",
			city = "广安市",
			qu = "岳池县",
		},
		[2649]=
		{
			id = 2649,
			code = 511622,
			name = "四川省",
			city = "广安市",
			qu = "武胜县",
		},
		[2650]=
		{
			id = 2650,
			code = 511623,
			name = "四川省",
			city = "广安市",
			qu = "邻水县",
		},
		[2651]=
		{
			id = 2651,
			code = 511681,
			name = "四川省",
			city = "广安市",
			qu = "华蓥市",
		},
		[2652]=
		{
			id = 2652,
			code = 511700,
			name = "四川省",
			city = "达州市",
		},
		[2653]=
		{
			id = 2653,
			code = 511701,
			name = "四川省",
			city = "达州市",
			qu = "市辖区",
		},
		[2654]=
		{
			id = 2654,
			code = 511702,
			name = "四川省",
			city = "达州市",
			qu = "通川区",
		},
		[2655]=
		{
			id = 2655,
			code = 511721,
			name = "四川省",
			city = "达州市",
			qu = "达县",
		},
		[2656]=
		{
			id = 2656,
			code = 511722,
			name = "四川省",
			city = "达州市",
			qu = "宣汉县",
		},
		[2657]=
		{
			id = 2657,
			code = 511723,
			name = "四川省",
			city = "达州市",
			qu = "开江县",
		},
		[2658]=
		{
			id = 2658,
			code = 511724,
			name = "四川省",
			city = "达州市",
			qu = "大竹县",
		},
		[2659]=
		{
			id = 2659,
			code = 511725,
			name = "四川省",
			city = "达州市",
			qu = "渠县",
		},
		[2660]=
		{
			id = 2660,
			code = 511781,
			name = "四川省",
			city = "达州市",
			qu = "万源市",
		},
		[2661]=
		{
			id = 2661,
			code = 511800,
			name = "四川省",
			city = "雅安市",
		},
		[2662]=
		{
			id = 2662,
			code = 511801,
			name = "四川省",
			city = "雅安市",
			qu = "市辖区",
		},
		[2663]=
		{
			id = 2663,
			code = 511802,
			name = "四川省",
			city = "雅安市",
			qu = "雨城区",
		},
		[2664]=
		{
			id = 2664,
			code = 511821,
			name = "四川省",
			city = "雅安市",
			qu = "名山县",
		},
		[2665]=
		{
			id = 2665,
			code = 511822,
			name = "四川省",
			city = "雅安市",
			qu = "荥经县",
		},
		[2666]=
		{
			id = 2666,
			code = 511823,
			name = "四川省",
			city = "雅安市",
			qu = "汉源县",
		},
		[2667]=
		{
			id = 2667,
			code = 511824,
			name = "四川省",
			city = "雅安市",
			qu = "石棉县",
		},
		[2668]=
		{
			id = 2668,
			code = 511825,
			name = "四川省",
			city = "雅安市",
			qu = "天全县",
		},
		[2669]=
		{
			id = 2669,
			code = 511826,
			name = "四川省",
			city = "雅安市",
			qu = "芦山县",
		},
		[2670]=
		{
			id = 2670,
			code = 511827,
			name = "四川省",
			city = "雅安市",
			qu = "宝兴县",
		},
		[2671]=
		{
			id = 2671,
			code = 511900,
			name = "四川省",
			city = "巴中市",
		},
		[2672]=
		{
			id = 2672,
			code = 511901,
			name = "四川省",
			city = "巴中市",
			qu = "市辖区",
		},
		[2673]=
		{
			id = 2673,
			code = 511902,
			name = "四川省",
			city = "巴中市",
			qu = "巴州区",
		},
		[2674]=
		{
			id = 2674,
			code = 511921,
			name = "四川省",
			city = "巴中市",
			qu = "通江县",
		},
		[2675]=
		{
			id = 2675,
			code = 511922,
			name = "四川省",
			city = "巴中市",
			qu = "南江县",
		},
		[2676]=
		{
			id = 2676,
			code = 511923,
			name = "四川省",
			city = "巴中市",
			qu = "平昌县",
		},
		[2677]=
		{
			id = 2677,
			code = 512000,
			name = "四川省",
			city = "资阳市",
		},
		[2678]=
		{
			id = 2678,
			code = 512001,
			name = "四川省",
			city = "资阳市",
			qu = "市辖区",
		},
		[2679]=
		{
			id = 2679,
			code = 512002,
			name = "四川省",
			city = "资阳市",
			qu = "雁江区",
		},
		[2680]=
		{
			id = 2680,
			code = 512021,
			name = "四川省",
			city = "资阳市",
			qu = "安岳县",
		},
		[2681]=
		{
			id = 2681,
			code = 512022,
			name = "四川省",
			city = "资阳市",
			qu = "乐至县",
		},
		[2682]=
		{
			id = 2682,
			code = 512081,
			name = "四川省",
			city = "资阳市",
			qu = "简阳市",
		},
		[2683]=
		{
			id = 2683,
			code = 513200,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
		},
		[2684]=
		{
			id = 2684,
			code = 513221,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "汶川县",
		},
		[2685]=
		{
			id = 2685,
			code = 513222,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "理县",
		},
		[2686]=
		{
			id = 2686,
			code = 513223,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "茂县",
		},
		[2687]=
		{
			id = 2687,
			code = 513224,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "松潘县",
		},
		[2688]=
		{
			id = 2688,
			code = 513225,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "九寨沟县",
		},
		[2689]=
		{
			id = 2689,
			code = 513226,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "金川县",
		},
		[2690]=
		{
			id = 2690,
			code = 513227,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "小金县",
		},
		[2691]=
		{
			id = 2691,
			code = 513228,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "黑水县",
		},
		[2692]=
		{
			id = 2692,
			code = 513229,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "马尔康县",
		},
		[2693]=
		{
			id = 2693,
			code = 513230,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "壤塘县",
		},
		[2694]=
		{
			id = 2694,
			code = 513231,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "阿坝县",
		},
		[2695]=
		{
			id = 2695,
			code = 513232,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "若尔盖县",
		},
		[2696]=
		{
			id = 2696,
			code = 513233,
			name = "四川省",
			city = "阿坝藏族羌族自治州",
			qu = "红原县",
		},
		[2697]=
		{
			id = 2697,
			code = 513300,
			name = "四川省",
			city = "甘孜藏族自治州",
		},
		[2698]=
		{
			id = 2698,
			code = 513321,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "康定县",
		},
		[2699]=
		{
			id = 2699,
			code = 513322,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "泸定县",
		},
		[2700]=
		{
			id = 2700,
			code = 513323,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "丹巴县",
		},
		[2701]=
		{
			id = 2701,
			code = 513324,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "九龙县",
		},
		[2702]=
		{
			id = 2702,
			code = 513325,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "雅江县",
		},
		[2703]=
		{
			id = 2703,
			code = 513326,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "道孚县",
		},
		[2704]=
		{
			id = 2704,
			code = 513327,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "炉霍县",
		},
		[2705]=
		{
			id = 2705,
			code = 513328,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "甘孜县",
		},
		[2706]=
		{
			id = 2706,
			code = 513329,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "新龙县",
		},
		[2707]=
		{
			id = 2707,
			code = 513330,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "德格县",
		},
		[2708]=
		{
			id = 2708,
			code = 513331,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "白玉县",
		},
		[2709]=
		{
			id = 2709,
			code = 513332,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "石渠县",
		},
		[2710]=
		{
			id = 2710,
			code = 513333,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "色达县",
		},
		[2711]=
		{
			id = 2711,
			code = 513334,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "理塘县",
		},
		[2712]=
		{
			id = 2712,
			code = 513335,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "巴塘县",
		},
		[2713]=
		{
			id = 2713,
			code = 513336,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "乡城县",
		},
		[2714]=
		{
			id = 2714,
			code = 513337,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "稻城县",
		},
		[2715]=
		{
			id = 2715,
			code = 513338,
			name = "四川省",
			city = "甘孜藏族自治州",
			qu = "得荣县",
		},
		[2716]=
		{
			id = 2716,
			code = 513400,
			name = "四川省",
			city = "凉山彝族自治州",
		},
		[2717]=
		{
			id = 2717,
			code = 513401,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "西昌市",
		},
		[2718]=
		{
			id = 2718,
			code = 513422,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "木里藏族自治县",
		},
		[2719]=
		{
			id = 2719,
			code = 513423,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "盐源县",
		},
		[2720]=
		{
			id = 2720,
			code = 513424,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "德昌县",
		},
		[2721]=
		{
			id = 2721,
			code = 513425,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "会理县",
		},
		[2722]=
		{
			id = 2722,
			code = 513426,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "会东县",
		},
		[2723]=
		{
			id = 2723,
			code = 513427,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "宁南县",
		},
		[2724]=
		{
			id = 2724,
			code = 513428,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "普格县",
		},
		[2725]=
		{
			id = 2725,
			code = 513429,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "布拖县",
		},
		[2726]=
		{
			id = 2726,
			code = 513430,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "金阳县",
		},
		[2727]=
		{
			id = 2727,
			code = 513431,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "昭觉县",
		},
		[2728]=
		{
			id = 2728,
			code = 513432,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "喜德县",
		},
		[2729]=
		{
			id = 2729,
			code = 513433,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "冕宁县",
		},
		[2730]=
		{
			id = 2730,
			code = 513434,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "越西县",
		},
		[2731]=
		{
			id = 2731,
			code = 513435,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "甘洛县",
		},
		[2732]=
		{
			id = 2732,
			code = 513436,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "美姑县",
		},
		[2733]=
		{
			id = 2733,
			code = 513437,
			name = "四川省",
			city = "凉山彝族自治州",
			qu = "雷波县",
		},
		[2734]=
		{
			id = 2734,
			code = 520000,
			name = "贵州省",
		},
		[2735]=
		{
			id = 2735,
			code = 520100,
			name = "贵州省",
			city = "贵阳市",
		},
		[2736]=
		{
			id = 2736,
			code = 520101,
			name = "贵州省",
			city = "贵阳市",
			qu = "市辖区",
		},
		[2737]=
		{
			id = 2737,
			code = 520102,
			name = "贵州省",
			city = "贵阳市",
			qu = "南明区",
		},
		[2738]=
		{
			id = 2738,
			code = 520103,
			name = "贵州省",
			city = "贵阳市",
			qu = "云岩区",
		},
		[2739]=
		{
			id = 2739,
			code = 520111,
			name = "贵州省",
			city = "贵阳市",
			qu = "花溪区",
		},
		[2740]=
		{
			id = 2740,
			code = 520112,
			name = "贵州省",
			city = "贵阳市",
			qu = "乌当区",
		},
		[2741]=
		{
			id = 2741,
			code = 520113,
			name = "贵州省",
			city = "贵阳市",
			qu = "白云区",
		},
		[2742]=
		{
			id = 2742,
			code = 520114,
			name = "贵州省",
			city = "贵阳市",
			qu = "小河区",
		},
		[2743]=
		{
			id = 2743,
			code = 520121,
			name = "贵州省",
			city = "贵阳市",
			qu = "开阳县",
		},
		[2744]=
		{
			id = 2744,
			code = 520122,
			name = "贵州省",
			city = "贵阳市",
			qu = "息烽县",
		},
		[2745]=
		{
			id = 2745,
			code = 520123,
			name = "贵州省",
			city = "贵阳市",
			qu = "修文县",
		},
		[2746]=
		{
			id = 2746,
			code = 520181,
			name = "贵州省",
			city = "贵阳市",
			qu = "清镇市",
		},
		[2747]=
		{
			id = 2747,
			code = 520200,
			name = "贵州省",
			city = "六盘水市",
		},
		[2748]=
		{
			id = 2748,
			code = 520201,
			name = "贵州省",
			city = "六盘水市",
			qu = "钟山区",
		},
		[2749]=
		{
			id = 2749,
			code = 520203,
			name = "贵州省",
			city = "六盘水市",
			qu = "六枝特区",
		},
		[2750]=
		{
			id = 2750,
			code = 520221,
			name = "贵州省",
			city = "六盘水市",
			qu = "水城县",
		},
		[2751]=
		{
			id = 2751,
			code = 520222,
			name = "贵州省",
			city = "六盘水市",
			qu = "盘县",
		},
		[2752]=
		{
			id = 2752,
			code = 520300,
			name = "贵州省",
			city = "遵义市",
		},
		[2753]=
		{
			id = 2753,
			code = 520301,
			name = "贵州省",
			city = "遵义市",
			qu = "市辖区",
		},
		[2754]=
		{
			id = 2754,
			code = 520302,
			name = "贵州省",
			city = "遵义市",
			qu = "红花岗区",
		},
		[2755]=
		{
			id = 2755,
			code = 520303,
			name = "贵州省",
			city = "遵义市",
			qu = "汇川区",
		},
		[2756]=
		{
			id = 2756,
			code = 520321,
			name = "贵州省",
			city = "遵义市",
			qu = "遵义县",
		},
		[2757]=
		{
			id = 2757,
			code = 520322,
			name = "贵州省",
			city = "遵义市",
			qu = "桐梓县",
		},
		[2758]=
		{
			id = 2758,
			code = 520323,
			name = "贵州省",
			city = "遵义市",
			qu = "绥阳县",
		},
		[2759]=
		{
			id = 2759,
			code = 520324,
			name = "贵州省",
			city = "遵义市",
			qu = "正安县",
		},
		[2760]=
		{
			id = 2760,
			code = 520325,
			name = "贵州省",
			city = "遵义市",
			qu = "道真仡佬族苗族自治县",
		},
		[2761]=
		{
			id = 2761,
			code = 520326,
			name = "贵州省",
			city = "遵义市",
			qu = "务川仡佬族苗族自治县",
		},
		[2762]=
		{
			id = 2762,
			code = 520327,
			name = "贵州省",
			city = "遵义市",
			qu = "凤冈县",
		},
		[2763]=
		{
			id = 2763,
			code = 520328,
			name = "贵州省",
			city = "遵义市",
			qu = "湄潭县",
		},
		[2764]=
		{
			id = 2764,
			code = 520329,
			name = "贵州省",
			city = "遵义市",
			qu = "余庆县",
		},
		[2765]=
		{
			id = 2765,
			code = 520330,
			name = "贵州省",
			city = "遵义市",
			qu = "习水县",
		},
		[2766]=
		{
			id = 2766,
			code = 520381,
			name = "贵州省",
			city = "遵义市",
			qu = "赤水市",
		},
		[2767]=
		{
			id = 2767,
			code = 520382,
			name = "贵州省",
			city = "遵义市",
			qu = "仁怀市",
		},
		[2768]=
		{
			id = 2768,
			code = 520400,
			name = "贵州省",
			city = "安顺市",
		},
		[2769]=
		{
			id = 2769,
			code = 520401,
			name = "贵州省",
			city = "安顺市",
			qu = "市辖区",
		},
		[2770]=
		{
			id = 2770,
			code = 520402,
			name = "贵州省",
			city = "安顺市",
			qu = "西秀区",
		},
		[2771]=
		{
			id = 2771,
			code = 520421,
			name = "贵州省",
			city = "安顺市",
			qu = "平坝县",
		},
		[2772]=
		{
			id = 2772,
			code = 520422,
			name = "贵州省",
			city = "安顺市",
			qu = "普定县",
		},
		[2773]=
		{
			id = 2773,
			code = 520423,
			name = "贵州省",
			city = "安顺市",
			qu = "镇宁布依族苗族自治县",
		},
		[2774]=
		{
			id = 2774,
			code = 520424,
			name = "贵州省",
			city = "安顺市",
			qu = "关岭布依族苗族自治县",
		},
		[2775]=
		{
			id = 2775,
			code = 520425,
			name = "贵州省",
			city = "安顺市",
			qu = "紫云苗族布依族自治县",
		},
		[2776]=
		{
			id = 2776,
			code = 522200,
			name = "贵州省",
			city = "铜仁地区",
		},
		[2777]=
		{
			id = 2777,
			code = 522201,
			name = "贵州省",
			city = "铜仁地区",
			qu = "铜仁市",
		},
		[2778]=
		{
			id = 2778,
			code = 522222,
			name = "贵州省",
			city = "铜仁地区",
			qu = "江口县",
		},
		[2779]=
		{
			id = 2779,
			code = 522223,
			name = "贵州省",
			city = "铜仁地区",
			qu = "玉屏侗族自治县",
		},
		[2780]=
		{
			id = 2780,
			code = 522224,
			name = "贵州省",
			city = "铜仁地区",
			qu = "石阡县",
		},
		[2781]=
		{
			id = 2781,
			code = 522225,
			name = "贵州省",
			city = "铜仁地区",
			qu = "思南县",
		},
		[2782]=
		{
			id = 2782,
			code = 522226,
			name = "贵州省",
			city = "铜仁地区",
			qu = "印江土家族苗族自治县",
		},
		[2783]=
		{
			id = 2783,
			code = 522227,
			name = "贵州省",
			city = "铜仁地区",
			qu = "德江县",
		},
		[2784]=
		{
			id = 2784,
			code = 522228,
			name = "贵州省",
			city = "铜仁地区",
			qu = "沿河土家族自治县",
		},
		[2785]=
		{
			id = 2785,
			code = 522229,
			name = "贵州省",
			city = "铜仁地区",
			qu = "松桃苗族自治县",
		},
		[2786]=
		{
			id = 2786,
			code = 522230,
			name = "贵州省",
			city = "铜仁地区",
			qu = "万山特区",
		},
		[2787]=
		{
			id = 2787,
			code = 522300,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
		},
		[2788]=
		{
			id = 2788,
			code = 522301,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
			qu = "兴义市",
		},
		[2789]=
		{
			id = 2789,
			code = 522322,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
			qu = "兴仁县",
		},
		[2790]=
		{
			id = 2790,
			code = 522323,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
			qu = "普安县",
		},
		[2791]=
		{
			id = 2791,
			code = 522324,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
			qu = "晴隆县",
		},
		[2792]=
		{
			id = 2792,
			code = 522325,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
			qu = "贞丰县",
		},
		[2793]=
		{
			id = 2793,
			code = 522326,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
			qu = "望谟县",
		},
		[2794]=
		{
			id = 2794,
			code = 522327,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
			qu = "册亨县",
		},
		[2795]=
		{
			id = 2795,
			code = 522328,
			name = "贵州省",
			city = "黔西南布依族苗族自治州",
			qu = "安龙县",
		},
		[2796]=
		{
			id = 2796,
			code = 522400,
			name = "贵州省",
			city = "毕节地区",
		},
		[2797]=
		{
			id = 2797,
			code = 522401,
			name = "贵州省",
			city = "毕节地区",
			qu = "毕节市",
		},
		[2798]=
		{
			id = 2798,
			code = 522422,
			name = "贵州省",
			city = "毕节地区",
			qu = "大方县",
		},
		[2799]=
		{
			id = 2799,
			code = 522423,
			name = "贵州省",
			city = "毕节地区",
			qu = "黔西县",
		},
		[2800]=
		{
			id = 2800,
			code = 522424,
			name = "贵州省",
			city = "毕节地区",
			qu = "金沙县",
		},
		[2801]=
		{
			id = 2801,
			code = 522425,
			name = "贵州省",
			city = "毕节地区",
			qu = "织金县",
		},
		[2802]=
		{
			id = 2802,
			code = 522426,
			name = "贵州省",
			city = "毕节地区",
			qu = "纳雍县",
		},
		[2803]=
		{
			id = 2803,
			code = 522427,
			name = "贵州省",
			city = "毕节地区",
			qu = "威宁彝族回族苗族自治县",
		},
		[2804]=
		{
			id = 2804,
			code = 522428,
			name = "贵州省",
			city = "毕节地区",
			qu = "赫章县",
		},
		[2805]=
		{
			id = 2805,
			code = 522600,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
		},
		[2806]=
		{
			id = 2806,
			code = 522601,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "凯里市",
		},
		[2807]=
		{
			id = 2807,
			code = 522622,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "黄平县",
		},
		[2808]=
		{
			id = 2808,
			code = 522623,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "施秉县",
		},
		[2809]=
		{
			id = 2809,
			code = 522624,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "三穗县",
		},
		[2810]=
		{
			id = 2810,
			code = 522625,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "镇远县",
		},
		[2811]=
		{
			id = 2811,
			code = 522626,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "岑巩县",
		},
		[2812]=
		{
			id = 2812,
			code = 522627,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "天柱县",
		},
		[2813]=
		{
			id = 2813,
			code = 522628,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "锦屏县",
		},
		[2814]=
		{
			id = 2814,
			code = 522629,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "剑河县",
		},
		[2815]=
		{
			id = 2815,
			code = 522630,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "台江县",
		},
		[2816]=
		{
			id = 2816,
			code = 522631,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "黎平县",
		},
		[2817]=
		{
			id = 2817,
			code = 522632,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "榕江县",
		},
		[2818]=
		{
			id = 2818,
			code = 522633,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "从江县",
		},
		[2819]=
		{
			id = 2819,
			code = 522634,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "雷山县",
		},
		[2820]=
		{
			id = 2820,
			code = 522635,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "麻江县",
		},
		[2821]=
		{
			id = 2821,
			code = 522636,
			name = "贵州省",
			city = "黔东南苗族侗族自治州",
			qu = "丹寨县",
		},
		[2822]=
		{
			id = 2822,
			code = 522700,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
		},
		[2823]=
		{
			id = 2823,
			code = 522701,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "都匀市",
		},
		[2824]=
		{
			id = 2824,
			code = 522702,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "福泉市",
		},
		[2825]=
		{
			id = 2825,
			code = 522722,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "荔波县",
		},
		[2826]=
		{
			id = 2826,
			code = 522723,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "贵定县",
		},
		[2827]=
		{
			id = 2827,
			code = 522725,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "瓮安县",
		},
		[2828]=
		{
			id = 2828,
			code = 522726,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "独山县",
		},
		[2829]=
		{
			id = 2829,
			code = 522727,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "平塘县",
		},
		[2830]=
		{
			id = 2830,
			code = 522728,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "罗甸县",
		},
		[2831]=
		{
			id = 2831,
			code = 522729,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "长顺县",
		},
		[2832]=
		{
			id = 2832,
			code = 522730,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "龙里县",
		},
		[2833]=
		{
			id = 2833,
			code = 522731,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "惠水县",
		},
		[2834]=
		{
			id = 2834,
			code = 522732,
			name = "贵州省",
			city = "黔南布依族苗族自治州",
			qu = "三都水族自治县",
		},
		[2835]=
		{
			id = 2835,
			code = 530000,
			name = "云南省",
		},
		[2836]=
		{
			id = 2836,
			code = 530100,
			name = "云南省",
			city = "昆明市",
		},
		[2837]=
		{
			id = 2837,
			code = 530101,
			name = "云南省",
			city = "昆明市",
			qu = "市辖区",
		},
		[2838]=
		{
			id = 2838,
			code = 530102,
			name = "云南省",
			city = "昆明市",
			qu = "五华区",
		},
		[2839]=
		{
			id = 2839,
			code = 530103,
			name = "云南省",
			city = "昆明市",
			qu = "盘龙区",
		},
		[2840]=
		{
			id = 2840,
			code = 530111,
			name = "云南省",
			city = "昆明市",
			qu = "官渡区",
		},
		[2841]=
		{
			id = 2841,
			code = 530112,
			name = "云南省",
			city = "昆明市",
			qu = "西山区",
		},
		[2842]=
		{
			id = 2842,
			code = 530113,
			name = "云南省",
			city = "昆明市",
			qu = "东川区",
		},
		[2843]=
		{
			id = 2843,
			code = 530121,
			name = "云南省",
			city = "昆明市",
			qu = "呈贡县",
		},
		[2844]=
		{
			id = 2844,
			code = 530122,
			name = "云南省",
			city = "昆明市",
			qu = "晋宁县",
		},
		[2845]=
		{
			id = 2845,
			code = 530124,
			name = "云南省",
			city = "昆明市",
			qu = "富民县",
		},
		[2846]=
		{
			id = 2846,
			code = 530125,
			name = "云南省",
			city = "昆明市",
			qu = "宜良县",
		},
		[2847]=
		{
			id = 2847,
			code = 530126,
			name = "云南省",
			city = "昆明市",
			qu = "石林彝族自治县",
		},
		[2848]=
		{
			id = 2848,
			code = 530127,
			name = "云南省",
			city = "昆明市",
			qu = "嵩明县",
		},
		[2849]=
		{
			id = 2849,
			code = 530128,
			name = "云南省",
			city = "昆明市",
			qu = "禄劝彝族苗族自治县",
		},
		[2850]=
		{
			id = 2850,
			code = 530129,
			name = "云南省",
			city = "昆明市",
			qu = "寻甸回族彝族自治县",
		},
		[2851]=
		{
			id = 2851,
			code = 530181,
			name = "云南省",
			city = "昆明市",
			qu = "安宁市",
		},
		[2852]=
		{
			id = 2852,
			code = 530300,
			name = "云南省",
			city = "曲靖市",
		},
		[2853]=
		{
			id = 2853,
			code = 530301,
			name = "云南省",
			city = "曲靖市",
			qu = "市辖区",
		},
		[2854]=
		{
			id = 2854,
			code = 530302,
			name = "云南省",
			city = "曲靖市",
			qu = "麒麟区",
		},
		[2855]=
		{
			id = 2855,
			code = 530321,
			name = "云南省",
			city = "曲靖市",
			qu = "马龙县",
		},
		[2856]=
		{
			id = 2856,
			code = 530322,
			name = "云南省",
			city = "曲靖市",
			qu = "陆良县",
		},
		[2857]=
		{
			id = 2857,
			code = 530323,
			name = "云南省",
			city = "曲靖市",
			qu = "师宗县",
		},
		[2858]=
		{
			id = 2858,
			code = 530324,
			name = "云南省",
			city = "曲靖市",
			qu = "罗平县",
		},
		[2859]=
		{
			id = 2859,
			code = 530325,
			name = "云南省",
			city = "曲靖市",
			qu = "富源县",
		},
		[2860]=
		{
			id = 2860,
			code = 530326,
			name = "云南省",
			city = "曲靖市",
			qu = "会泽县",
		},
		[2861]=
		{
			id = 2861,
			code = 530328,
			name = "云南省",
			city = "曲靖市",
			qu = "沾益县",
		},
		[2862]=
		{
			id = 2862,
			code = 530381,
			name = "云南省",
			city = "曲靖市",
			qu = "宣威市",
		},
		[2863]=
		{
			id = 2863,
			code = 530400,
			name = "云南省",
			city = "玉溪市",
		},
		[2864]=
		{
			id = 2864,
			code = 530401,
			name = "云南省",
			city = "玉溪市",
			qu = "市辖区",
		},
		[2865]=
		{
			id = 2865,
			code = 530402,
			name = "云南省",
			city = "玉溪市",
			qu = "红塔区",
		},
		[2866]=
		{
			id = 2866,
			code = 530421,
			name = "云南省",
			city = "玉溪市",
			qu = "江川县",
		},
		[2867]=
		{
			id = 2867,
			code = 530422,
			name = "云南省",
			city = "玉溪市",
			qu = "澄江县",
		},
		[2868]=
		{
			id = 2868,
			code = 530423,
			name = "云南省",
			city = "玉溪市",
			qu = "通海县",
		},
		[2869]=
		{
			id = 2869,
			code = 530424,
			name = "云南省",
			city = "玉溪市",
			qu = "华宁县",
		},
		[2870]=
		{
			id = 2870,
			code = 530425,
			name = "云南省",
			city = "玉溪市",
			qu = "易门县",
		},
		[2871]=
		{
			id = 2871,
			code = 530426,
			name = "云南省",
			city = "玉溪市",
			qu = "峨山彝族自治县",
		},
		[2872]=
		{
			id = 2872,
			code = 530427,
			name = "云南省",
			city = "玉溪市",
			qu = "新平彝族傣族自治县",
		},
		[2873]=
		{
			id = 2873,
			code = 530428,
			name = "云南省",
			city = "玉溪市",
			qu = "元江哈尼族彝族傣族自治县",
		},
		[2874]=
		{
			id = 2874,
			code = 530500,
			name = "云南省",
			city = "保山市",
		},
		[2875]=
		{
			id = 2875,
			code = 530501,
			name = "云南省",
			city = "保山市",
			qu = "市辖区",
		},
		[2876]=
		{
			id = 2876,
			code = 530502,
			name = "云南省",
			city = "保山市",
			qu = "隆阳区",
		},
		[2877]=
		{
			id = 2877,
			code = 530521,
			name = "云南省",
			city = "保山市",
			qu = "施甸县",
		},
		[2878]=
		{
			id = 2878,
			code = 530522,
			name = "云南省",
			city = "保山市",
			qu = "腾冲县",
		},
		[2879]=
		{
			id = 2879,
			code = 530523,
			name = "云南省",
			city = "保山市",
			qu = "龙陵县",
		},
		[2880]=
		{
			id = 2880,
			code = 530524,
			name = "云南省",
			city = "保山市",
			qu = "昌宁县",
		},
		[2881]=
		{
			id = 2881,
			code = 530600,
			name = "云南省",
			city = "昭通市",
		},
		[2882]=
		{
			id = 2882,
			code = 530601,
			name = "云南省",
			city = "昭通市",
			qu = "市辖区",
		},
		[2883]=
		{
			id = 2883,
			code = 530602,
			name = "云南省",
			city = "昭通市",
			qu = "昭阳区",
		},
		[2884]=
		{
			id = 2884,
			code = 530621,
			name = "云南省",
			city = "昭通市",
			qu = "鲁甸县",
		},
		[2885]=
		{
			id = 2885,
			code = 530622,
			name = "云南省",
			city = "昭通市",
			qu = "巧家县",
		},
		[2886]=
		{
			id = 2886,
			code = 530623,
			name = "云南省",
			city = "昭通市",
			qu = "盐津县",
		},
		[2887]=
		{
			id = 2887,
			code = 530624,
			name = "云南省",
			city = "昭通市",
			qu = "大关县",
		},
		[2888]=
		{
			id = 2888,
			code = 530625,
			name = "云南省",
			city = "昭通市",
			qu = "永善县",
		},
		[2889]=
		{
			id = 2889,
			code = 530626,
			name = "云南省",
			city = "昭通市",
			qu = "绥江县",
		},
		[2890]=
		{
			id = 2890,
			code = 530627,
			name = "云南省",
			city = "昭通市",
			qu = "镇雄县",
		},
		[2891]=
		{
			id = 2891,
			code = 530628,
			name = "云南省",
			city = "昭通市",
			qu = "彝良县",
		},
		[2892]=
		{
			id = 2892,
			code = 530629,
			name = "云南省",
			city = "昭通市",
			qu = "威信县",
		},
		[2893]=
		{
			id = 2893,
			code = 530630,
			name = "云南省",
			city = "昭通市",
			qu = "水富县",
		},
		[2894]=
		{
			id = 2894,
			code = 530700,
			name = "云南省",
			city = "丽江市",
		},
		[2895]=
		{
			id = 2895,
			code = 530701,
			name = "云南省",
			city = "丽江市",
			qu = "市辖区",
		},
		[2896]=
		{
			id = 2896,
			code = 530702,
			name = "云南省",
			city = "丽江市",
			qu = "古城区",
		},
		[2897]=
		{
			id = 2897,
			code = 530721,
			name = "云南省",
			city = "丽江市",
			qu = "玉龙纳西族自治县",
		},
		[2898]=
		{
			id = 2898,
			code = 530722,
			name = "云南省",
			city = "丽江市",
			qu = "永胜县",
		},
		[2899]=
		{
			id = 2899,
			code = 530723,
			name = "云南省",
			city = "丽江市",
			qu = "华坪县",
		},
		[2900]=
		{
			id = 2900,
			code = 530724,
			name = "云南省",
			city = "丽江市",
			qu = "宁蒗彝族自治县",
		},
		[2901]=
		{
			id = 2901,
			code = 530800,
			name = "云南省",
			city = "普洱市",
		},
		[2902]=
		{
			id = 2902,
			code = 530801,
			name = "云南省",
			city = "普洱市",
			qu = "市辖区",
		},
		[2903]=
		{
			id = 2903,
			code = 530802,
			name = "云南省",
			city = "普洱市",
			qu = "思茅区",
		},
		[2904]=
		{
			id = 2904,
			code = 530821,
			name = "云南省",
			city = "普洱市",
			qu = "宁洱哈尼族彝族自治县",
		},
		[2905]=
		{
			id = 2905,
			code = 530822,
			name = "云南省",
			city = "普洱市",
			qu = "墨江哈尼族自治县",
		},
		[2906]=
		{
			id = 2906,
			code = 530823,
			name = "云南省",
			city = "普洱市",
			qu = "景东彝族自治县",
		},
		[2907]=
		{
			id = 2907,
			code = 530824,
			name = "云南省",
			city = "普洱市",
			qu = "景谷傣族彝族自治县",
		},
		[2908]=
		{
			id = 2908,
			code = 530825,
			name = "云南省",
			city = "普洱市",
			qu = "镇沅彝族哈尼族拉祜族自治县",
		},
		[2909]=
		{
			id = 2909,
			code = 530826,
			name = "云南省",
			city = "普洱市",
			qu = "江城哈尼族彝族自治县",
		},
		[2910]=
		{
			id = 2910,
			code = 530827,
			name = "云南省",
			city = "普洱市",
			qu = "孟连傣族拉祜族佤族自治县",
		},
		[2911]=
		{
			id = 2911,
			code = 530828,
			name = "云南省",
			city = "普洱市",
			qu = "澜沧拉祜族自治县",
		},
		[2912]=
		{
			id = 2912,
			code = 530829,
			name = "云南省",
			city = "普洱市",
			qu = "西盟佤族自治县",
		},
		[2913]=
		{
			id = 2913,
			code = 530900,
			name = "云南省",
			city = "临沧市",
		},
		[2914]=
		{
			id = 2914,
			code = 530901,
			name = "云南省",
			city = "临沧市",
			qu = "市辖区",
		},
		[2915]=
		{
			id = 2915,
			code = 530902,
			name = "云南省",
			city = "临沧市",
			qu = "临翔区",
		},
		[2916]=
		{
			id = 2916,
			code = 530921,
			name = "云南省",
			city = "临沧市",
			qu = "凤庆县",
		},
		[2917]=
		{
			id = 2917,
			code = 530922,
			name = "云南省",
			city = "临沧市",
			qu = "云县",
		},
		[2918]=
		{
			id = 2918,
			code = 530923,
			name = "云南省",
			city = "临沧市",
			qu = "永德县",
		},
		[2919]=
		{
			id = 2919,
			code = 530924,
			name = "云南省",
			city = "临沧市",
			qu = "镇康县",
		},
		[2920]=
		{
			id = 2920,
			code = 530925,
			name = "云南省",
			city = "临沧市",
			qu = "双江拉祜族佤族布朗族傣族自治县",
		},
		[2921]=
		{
			id = 2921,
			code = 530926,
			name = "云南省",
			city = "临沧市",
			qu = "耿马傣族佤族自治县",
		},
		[2922]=
		{
			id = 2922,
			code = 530927,
			name = "云南省",
			city = "临沧市",
			qu = "沧源佤族自治县",
		},
		[2923]=
		{
			id = 2923,
			code = 532300,
			name = "云南省",
			city = "楚雄彝族自治州",
		},
		[2924]=
		{
			id = 2924,
			code = 532301,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "楚雄市",
		},
		[2925]=
		{
			id = 2925,
			code = 532322,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "双柏县",
		},
		[2926]=
		{
			id = 2926,
			code = 532323,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "牟定县",
		},
		[2927]=
		{
			id = 2927,
			code = 532324,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "南华县",
		},
		[2928]=
		{
			id = 2928,
			code = 532325,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "姚安县",
		},
		[2929]=
		{
			id = 2929,
			code = 532326,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "大姚县",
		},
		[2930]=
		{
			id = 2930,
			code = 532327,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "永仁县",
		},
		[2931]=
		{
			id = 2931,
			code = 532328,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "元谋县",
		},
		[2932]=
		{
			id = 2932,
			code = 532329,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "武定县",
		},
		[2933]=
		{
			id = 2933,
			code = 532331,
			name = "云南省",
			city = "楚雄彝族自治州",
			qu = "禄丰县",
		},
		[2934]=
		{
			id = 2934,
			code = 532500,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
		},
		[2935]=
		{
			id = 2935,
			code = 532501,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "个旧市",
		},
		[2936]=
		{
			id = 2936,
			code = 532502,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "开远市",
		},
		[2937]=
		{
			id = 2937,
			code = 532522,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "蒙自县",
		},
		[2938]=
		{
			id = 2938,
			code = 532523,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "屏边苗族自治县",
		},
		[2939]=
		{
			id = 2939,
			code = 532524,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "建水县",
		},
		[2940]=
		{
			id = 2940,
			code = 532525,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "石屏县",
		},
		[2941]=
		{
			id = 2941,
			code = 532526,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "弥勒县",
		},
		[2942]=
		{
			id = 2942,
			code = 532527,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "泸西县",
		},
		[2943]=
		{
			id = 2943,
			code = 532528,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "元阳县",
		},
		[2944]=
		{
			id = 2944,
			code = 532529,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "红河县",
		},
		[2945]=
		{
			id = 2945,
			code = 532530,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "金平苗族瑶族傣族自治县",
		},
		[2946]=
		{
			id = 2946,
			code = 532531,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "绿春县",
		},
		[2947]=
		{
			id = 2947,
			code = 532532,
			name = "云南省",
			city = "红河哈尼族彝族自治州",
			qu = "河口瑶族自治县",
		},
		[2948]=
		{
			id = 2948,
			code = 532600,
			name = "云南省",
			city = "文山壮族苗族自治州",
		},
		[2949]=
		{
			id = 2949,
			code = 532621,
			name = "云南省",
			city = "文山壮族苗族自治州",
			qu = "文山县",
		},
		[2950]=
		{
			id = 2950,
			code = 532622,
			name = "云南省",
			city = "文山壮族苗族自治州",
			qu = "砚山县",
		},
		[2951]=
		{
			id = 2951,
			code = 532623,
			name = "云南省",
			city = "文山壮族苗族自治州",
			qu = "西畴县",
		},
		[2952]=
		{
			id = 2952,
			code = 532624,
			name = "云南省",
			city = "文山壮族苗族自治州",
			qu = "麻栗坡县",
		},
		[2953]=
		{
			id = 2953,
			code = 532625,
			name = "云南省",
			city = "文山壮族苗族自治州",
			qu = "马关县",
		},
		[2954]=
		{
			id = 2954,
			code = 532626,
			name = "云南省",
			city = "文山壮族苗族自治州",
			qu = "丘北县",
		},
		[2955]=
		{
			id = 2955,
			code = 532627,
			name = "云南省",
			city = "文山壮族苗族自治州",
			qu = "广南县",
		},
		[2956]=
		{
			id = 2956,
			code = 532628,
			name = "云南省",
			city = "文山壮族苗族自治州",
			qu = "富宁县",
		},
		[2957]=
		{
			id = 2957,
			code = 532800,
			name = "云南省",
			city = "西双版纳傣族自治州",
		},
		[2958]=
		{
			id = 2958,
			code = 532801,
			name = "云南省",
			city = "西双版纳傣族自治州",
			qu = "景洪市",
		},
		[2959]=
		{
			id = 2959,
			code = 532822,
			name = "云南省",
			city = "西双版纳傣族自治州",
			qu = "勐海县",
		},
		[2960]=
		{
			id = 2960,
			code = 532823,
			name = "云南省",
			city = "西双版纳傣族自治州",
			qu = "勐腊县",
		},
		[2961]=
		{
			id = 2961,
			code = 532900,
			name = "云南省",
			city = "大理白族自治州",
		},
		[2962]=
		{
			id = 2962,
			code = 532901,
			name = "云南省",
			city = "大理白族自治州",
			qu = "大理市",
		},
		[2963]=
		{
			id = 2963,
			code = 532922,
			name = "云南省",
			city = "大理白族自治州",
			qu = "漾濞彝族自治县",
		},
		[2964]=
		{
			id = 2964,
			code = 532923,
			name = "云南省",
			city = "大理白族自治州",
			qu = "祥云县",
		},
		[2965]=
		{
			id = 2965,
			code = 532924,
			name = "云南省",
			city = "大理白族自治州",
			qu = "宾川县",
		},
		[2966]=
		{
			id = 2966,
			code = 532925,
			name = "云南省",
			city = "大理白族自治州",
			qu = "弥渡县",
		},
		[2967]=
		{
			id = 2967,
			code = 532926,
			name = "云南省",
			city = "大理白族自治州",
			qu = "南涧彝族自治县",
		},
		[2968]=
		{
			id = 2968,
			code = 532927,
			name = "云南省",
			city = "大理白族自治州",
			qu = "巍山彝族回族自治县",
		},
		[2969]=
		{
			id = 2969,
			code = 532928,
			name = "云南省",
			city = "大理白族自治州",
			qu = "永平县",
		},
		[2970]=
		{
			id = 2970,
			code = 532929,
			name = "云南省",
			city = "大理白族自治州",
			qu = "云龙县",
		},
		[2971]=
		{
			id = 2971,
			code = 532930,
			name = "云南省",
			city = "大理白族自治州",
			qu = "洱源县",
		},
		[2972]=
		{
			id = 2972,
			code = 532931,
			name = "云南省",
			city = "大理白族自治州",
			qu = "剑川县",
		},
		[2973]=
		{
			id = 2973,
			code = 532932,
			name = "云南省",
			city = "大理白族自治州",
			qu = "鹤庆县",
		},
		[2974]=
		{
			id = 2974,
			code = 533100,
			name = "云南省",
			city = "德宏傣族景颇族自治州",
		},
		[2975]=
		{
			id = 2975,
			code = 533102,
			name = "云南省",
			city = "德宏傣族景颇族自治州",
			qu = "瑞丽市",
		},
		[2976]=
		{
			id = 2976,
			code = 533103,
			name = "云南省",
			city = "德宏傣族景颇族自治州",
			qu = "潞西市",
		},
		[2977]=
		{
			id = 2977,
			code = 533122,
			name = "云南省",
			city = "德宏傣族景颇族自治州",
			qu = "梁河县",
		},
		[2978]=
		{
			id = 2978,
			code = 533123,
			name = "云南省",
			city = "德宏傣族景颇族自治州",
			qu = "盈江县",
		},
		[2979]=
		{
			id = 2979,
			code = 533124,
			name = "云南省",
			city = "德宏傣族景颇族自治州",
			qu = "陇川县",
		},
		[2980]=
		{
			id = 2980,
			code = 533300,
			name = "云南省",
			city = "怒江傈僳族自治州",
		},
		[2981]=
		{
			id = 2981,
			code = 533321,
			name = "云南省",
			city = "怒江傈僳族自治州",
			qu = "泸水县",
		},
		[2982]=
		{
			id = 2982,
			code = 533323,
			name = "云南省",
			city = "怒江傈僳族自治州",
			qu = "福贡县",
		},
		[2983]=
		{
			id = 2983,
			code = 533324,
			name = "云南省",
			city = "怒江傈僳族自治州",
			qu = "贡山独龙族怒族自治县",
		},
		[2984]=
		{
			id = 2984,
			code = 533325,
			name = "云南省",
			city = "怒江傈僳族自治州",
			qu = "兰坪白族普米族自治县",
		},
		[2985]=
		{
			id = 2985,
			code = 533400,
			name = "云南省",
			city = "迪庆藏族自治州",
		},
		[2986]=
		{
			id = 2986,
			code = 533421,
			name = "云南省",
			city = "迪庆藏族自治州",
			qu = "香格里拉县",
		},
		[2987]=
		{
			id = 2987,
			code = 533422,
			name = "云南省",
			city = "迪庆藏族自治州",
			qu = "德钦县",
		},
		[2988]=
		{
			id = 2988,
			code = 533423,
			name = "云南省",
			city = "迪庆藏族自治州",
			qu = "维西傈僳族自治县",
		},
		[2989]=
		{
			id = 2989,
			code = 540000,
			name = "西藏自治区",
		},
		[2990]=
		{
			id = 2990,
			code = 540100,
			name = "西藏自治区",
			city = "拉萨市",
		},
		[2991]=
		{
			id = 2991,
			code = 540101,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "市辖区",
		},
		[2992]=
		{
			id = 2992,
			code = 540102,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "城关区",
		},
		[2993]=
		{
			id = 2993,
			code = 540121,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "林周县",
		},
		[2994]=
		{
			id = 2994,
			code = 540122,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "当雄县",
		},
		[2995]=
		{
			id = 2995,
			code = 540123,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "尼木县",
		},
		[2996]=
		{
			id = 2996,
			code = 540124,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "曲水县",
		},
		[2997]=
		{
			id = 2997,
			code = 540125,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "堆龙德庆县",
		},
		[2998]=
		{
			id = 2998,
			code = 540126,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "达孜县",
		},
		[2999]=
		{
			id = 2999,
			code = 540127,
			name = "西藏自治区",
			city = "拉萨市",
			qu = "墨竹工卡县",
		},
		[3000]=
		{
			id = 3000,
			code = 542100,
			name = "西藏自治区",
			city = "昌都地区",
		},
		[3001]=
		{
			id = 3001,
			code = 542121,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "昌都县",
		},
		[3002]=
		{
			id = 3002,
			code = 542122,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "江达县",
		},
		[3003]=
		{
			id = 3003,
			code = 542123,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "贡觉县",
		},
		[3004]=
		{
			id = 3004,
			code = 542124,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "类乌齐县",
		},
		[3005]=
		{
			id = 3005,
			code = 542125,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "丁青县",
		},
		[3006]=
		{
			id = 3006,
			code = 542126,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "察雅县",
		},
		[3007]=
		{
			id = 3007,
			code = 542127,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "八宿县",
		},
		[3008]=
		{
			id = 3008,
			code = 542128,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "左贡县",
		},
		[3009]=
		{
			id = 3009,
			code = 542129,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "芒康县",
		},
		[3010]=
		{
			id = 3010,
			code = 542132,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "洛隆县",
		},
		[3011]=
		{
			id = 3011,
			code = 542133,
			name = "西藏自治区",
			city = "昌都地区",
			qu = "边坝县",
		},
		[3012]=
		{
			id = 3012,
			code = 542200,
			name = "西藏自治区",
			city = "山南地区",
		},
		[3013]=
		{
			id = 3013,
			code = 542221,
			name = "西藏自治区",
			city = "山南地区",
			qu = "乃东县",
		},
		[3014]=
		{
			id = 3014,
			code = 542222,
			name = "西藏自治区",
			city = "山南地区",
			qu = "扎囊县",
		},
		[3015]=
		{
			id = 3015,
			code = 542223,
			name = "西藏自治区",
			city = "山南地区",
			qu = "贡嘎县",
		},
		[3016]=
		{
			id = 3016,
			code = 542224,
			name = "西藏自治区",
			city = "山南地区",
			qu = "桑日县",
		},
		[3017]=
		{
			id = 3017,
			code = 542225,
			name = "西藏自治区",
			city = "山南地区",
			qu = "琼结县",
		},
		[3018]=
		{
			id = 3018,
			code = 542226,
			name = "西藏自治区",
			city = "山南地区",
			qu = "曲松县",
		},
		[3019]=
		{
			id = 3019,
			code = 542227,
			name = "西藏自治区",
			city = "山南地区",
			qu = "措美县",
		},
		[3020]=
		{
			id = 3020,
			code = 542228,
			name = "西藏自治区",
			city = "山南地区",
			qu = "洛扎县",
		},
		[3021]=
		{
			id = 3021,
			code = 542229,
			name = "西藏自治区",
			city = "山南地区",
			qu = "加查县",
		},
		[3022]=
		{
			id = 3022,
			code = 542231,
			name = "西藏自治区",
			city = "山南地区",
			qu = "隆子县",
		},
		[3023]=
		{
			id = 3023,
			code = 542232,
			name = "西藏自治区",
			city = "山南地区",
			qu = "错那县",
		},
		[3024]=
		{
			id = 3024,
			code = 542233,
			name = "西藏自治区",
			city = "山南地区",
			qu = "浪卡子县",
		},
		[3025]=
		{
			id = 3025,
			code = 542300,
			name = "西藏自治区",
			city = "日喀则地区",
		},
		[3026]=
		{
			id = 3026,
			code = 542301,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "日喀则市",
		},
		[3027]=
		{
			id = 3027,
			code = 542322,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "南木林县",
		},
		[3028]=
		{
			id = 3028,
			code = 542323,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "江孜县",
		},
		[3029]=
		{
			id = 3029,
			code = 542324,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "定日县",
		},
		[3030]=
		{
			id = 3030,
			code = 542325,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "萨迦县",
		},
		[3031]=
		{
			id = 3031,
			code = 542326,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "拉孜县",
		},
		[3032]=
		{
			id = 3032,
			code = 542327,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "昂仁县",
		},
		[3033]=
		{
			id = 3033,
			code = 542328,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "谢通门县",
		},
		[3034]=
		{
			id = 3034,
			code = 542329,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "白朗县",
		},
		[3035]=
		{
			id = 3035,
			code = 542330,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "仁布县",
		},
		[3036]=
		{
			id = 3036,
			code = 542331,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "康马县",
		},
		[3037]=
		{
			id = 3037,
			code = 542332,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "定结县",
		},
		[3038]=
		{
			id = 3038,
			code = 542333,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "仲巴县",
		},
		[3039]=
		{
			id = 3039,
			code = 542334,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "亚东县",
		},
		[3040]=
		{
			id = 3040,
			code = 542335,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "吉隆县",
		},
		[3041]=
		{
			id = 3041,
			code = 542336,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "聂拉木县",
		},
		[3042]=
		{
			id = 3042,
			code = 542337,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "萨嘎县",
		},
		[3043]=
		{
			id = 3043,
			code = 542338,
			name = "西藏自治区",
			city = "日喀则地区",
			qu = "岗巴县",
		},
		[3044]=
		{
			id = 3044,
			code = 542400,
			name = "西藏自治区",
			city = "那曲地区",
		},
		[3045]=
		{
			id = 3045,
			code = 542421,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "那曲县",
		},
		[3046]=
		{
			id = 3046,
			code = 542422,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "嘉黎县",
		},
		[3047]=
		{
			id = 3047,
			code = 542423,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "比如县",
		},
		[3048]=
		{
			id = 3048,
			code = 542424,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "聂荣县",
		},
		[3049]=
		{
			id = 3049,
			code = 542425,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "安多县",
		},
		[3050]=
		{
			id = 3050,
			code = 542426,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "申扎县",
		},
		[3051]=
		{
			id = 3051,
			code = 542427,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "索县",
		},
		[3052]=
		{
			id = 3052,
			code = 542428,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "班戈县",
		},
		[3053]=
		{
			id = 3053,
			code = 542429,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "巴青县",
		},
		[3054]=
		{
			id = 3054,
			code = 542430,
			name = "西藏自治区",
			city = "那曲地区",
			qu = "尼玛县",
		},
		[3055]=
		{
			id = 3055,
			code = 542500,
			name = "西藏自治区",
			city = "阿里地区",
		},
		[3056]=
		{
			id = 3056,
			code = 542521,
			name = "西藏自治区",
			city = "阿里地区",
			qu = "普兰县",
		},
		[3057]=
		{
			id = 3057,
			code = 542522,
			name = "西藏自治区",
			city = "阿里地区",
			qu = "札达县",
		},
		[3058]=
		{
			id = 3058,
			code = 542523,
			name = "西藏自治区",
			city = "阿里地区",
			qu = "噶尔县",
		},
		[3059]=
		{
			id = 3059,
			code = 542524,
			name = "西藏自治区",
			city = "阿里地区",
			qu = "日土县",
		},
		[3060]=
		{
			id = 3060,
			code = 542525,
			name = "西藏自治区",
			city = "阿里地区",
			qu = "革吉县",
		},
		[3061]=
		{
			id = 3061,
			code = 542526,
			name = "西藏自治区",
			city = "阿里地区",
			qu = "改则县",
		},
		[3062]=
		{
			id = 3062,
			code = 542527,
			name = "西藏自治区",
			city = "阿里地区",
			qu = "措勤县",
		},
		[3063]=
		{
			id = 3063,
			code = 542600,
			name = "西藏自治区",
			city = "林芝地区",
		},
		[3064]=
		{
			id = 3064,
			code = 542621,
			name = "西藏自治区",
			city = "林芝地区",
			qu = "林芝县",
		},
		[3065]=
		{
			id = 3065,
			code = 542622,
			name = "西藏自治区",
			city = "林芝地区",
			qu = "工布江达县",
		},
		[3066]=
		{
			id = 3066,
			code = 542623,
			name = "西藏自治区",
			city = "林芝地区",
			qu = "米林县",
		},
		[3067]=
		{
			id = 3067,
			code = 542624,
			name = "西藏自治区",
			city = "林芝地区",
			qu = "墨脱县",
		},
		[3068]=
		{
			id = 3068,
			code = 542625,
			name = "西藏自治区",
			city = "林芝地区",
			qu = "波密县",
		},
		[3069]=
		{
			id = 3069,
			code = 542626,
			name = "西藏自治区",
			city = "林芝地区",
			qu = "察隅县",
		},
		[3070]=
		{
			id = 3070,
			code = 542627,
			name = "西藏自治区",
			city = "林芝地区",
			qu = "朗县",
		},
		[3071]=
		{
			id = 3071,
			code = 610000,
			name = "陕西省",
		},
		[3072]=
		{
			id = 3072,
			code = 610100,
			name = "陕西省",
			city = "西安市",
		},
		[3073]=
		{
			id = 3073,
			code = 610101,
			name = "陕西省",
			city = "西安市",
			qu = "市辖区",
		},
		[3074]=
		{
			id = 3074,
			code = 610102,
			name = "陕西省",
			city = "西安市",
			qu = "新城区",
		},
		[3075]=
		{
			id = 3075,
			code = 610103,
			name = "陕西省",
			city = "西安市",
			qu = "碑林区",
		},
		[3076]=
		{
			id = 3076,
			code = 610104,
			name = "陕西省",
			city = "西安市",
			qu = "莲湖区",
		},
		[3077]=
		{
			id = 3077,
			code = 610111,
			name = "陕西省",
			city = "西安市",
			qu = "灞桥区",
		},
		[3078]=
		{
			id = 3078,
			code = 610112,
			name = "陕西省",
			city = "西安市",
			qu = "未央区",
		},
		[3079]=
		{
			id = 3079,
			code = 610113,
			name = "陕西省",
			city = "西安市",
			qu = "雁塔区",
		},
		[3080]=
		{
			id = 3080,
			code = 610114,
			name = "陕西省",
			city = "西安市",
			qu = "阎良区",
		},
		[3081]=
		{
			id = 3081,
			code = 610115,
			name = "陕西省",
			city = "西安市",
			qu = "临潼区",
		},
		[3082]=
		{
			id = 3082,
			code = 610116,
			name = "陕西省",
			city = "西安市",
			qu = "长安区",
		},
		[3083]=
		{
			id = 3083,
			code = 610122,
			name = "陕西省",
			city = "西安市",
			qu = "蓝田县",
		},
		[3084]=
		{
			id = 3084,
			code = 610124,
			name = "陕西省",
			city = "西安市",
			qu = "周至县",
		},
		[3085]=
		{
			id = 3085,
			code = 610125,
			name = "陕西省",
			city = "西安市",
			qu = "户县",
		},
		[3086]=
		{
			id = 3086,
			code = 610126,
			name = "陕西省",
			city = "西安市",
			qu = "高陵县",
		},
		[3087]=
		{
			id = 3087,
			code = 610200,
			name = "陕西省",
			city = "铜川市",
		},
		[3088]=
		{
			id = 3088,
			code = 610201,
			name = "陕西省",
			city = "铜川市",
			qu = "市辖区",
		},
		[3089]=
		{
			id = 3089,
			code = 610202,
			name = "陕西省",
			city = "铜川市",
			qu = "王益区",
		},
		[3090]=
		{
			id = 3090,
			code = 610203,
			name = "陕西省",
			city = "铜川市",
			qu = "印台区",
		},
		[3091]=
		{
			id = 3091,
			code = 610204,
			name = "陕西省",
			city = "铜川市",
			qu = "耀州区",
		},
		[3092]=
		{
			id = 3092,
			code = 610222,
			name = "陕西省",
			city = "铜川市",
			qu = "宜君县",
		},
		[3093]=
		{
			id = 3093,
			code = 610300,
			name = "陕西省",
			city = "宝鸡市",
		},
		[3094]=
		{
			id = 3094,
			code = 610301,
			name = "陕西省",
			city = "宝鸡市",
			qu = "市辖区",
		},
		[3095]=
		{
			id = 3095,
			code = 610302,
			name = "陕西省",
			city = "宝鸡市",
			qu = "渭滨区",
		},
		[3096]=
		{
			id = 3096,
			code = 610303,
			name = "陕西省",
			city = "宝鸡市",
			qu = "金台区",
		},
		[3097]=
		{
			id = 3097,
			code = 610304,
			name = "陕西省",
			city = "宝鸡市",
			qu = "陈仓区",
		},
		[3098]=
		{
			id = 3098,
			code = 610322,
			name = "陕西省",
			city = "宝鸡市",
			qu = "凤翔县",
		},
		[3099]=
		{
			id = 3099,
			code = 610323,
			name = "陕西省",
			city = "宝鸡市",
			qu = "岐山县",
		},
		[3100]=
		{
			id = 3100,
			code = 610324,
			name = "陕西省",
			city = "宝鸡市",
			qu = "扶风县",
		},
		[3101]=
		{
			id = 3101,
			code = 610326,
			name = "陕西省",
			city = "宝鸡市",
			qu = "眉县",
		},
		[3102]=
		{
			id = 3102,
			code = 610327,
			name = "陕西省",
			city = "宝鸡市",
			qu = "陇县",
		},
		[3103]=
		{
			id = 3103,
			code = 610328,
			name = "陕西省",
			city = "宝鸡市",
			qu = "千阳县",
		},
		[3104]=
		{
			id = 3104,
			code = 610329,
			name = "陕西省",
			city = "宝鸡市",
			qu = "麟游县",
		},
		[3105]=
		{
			id = 3105,
			code = 610330,
			name = "陕西省",
			city = "宝鸡市",
			qu = "凤县",
		},
		[3106]=
		{
			id = 3106,
			code = 610331,
			name = "陕西省",
			city = "宝鸡市",
			qu = "太白县",
		},
		[3107]=
		{
			id = 3107,
			code = 610400,
			name = "陕西省",
			city = "咸阳市",
		},
		[3108]=
		{
			id = 3108,
			code = 610401,
			name = "陕西省",
			city = "咸阳市",
			qu = "市辖区",
		},
		[3109]=
		{
			id = 3109,
			code = 610402,
			name = "陕西省",
			city = "咸阳市",
			qu = "秦都区",
		},
		[3110]=
		{
			id = 3110,
			code = 610403,
			name = "陕西省",
			city = "咸阳市",
			qu = "杨凌区",
		},
		[3111]=
		{
			id = 3111,
			code = 610404,
			name = "陕西省",
			city = "咸阳市",
			qu = "渭城区",
		},
		[3112]=
		{
			id = 3112,
			code = 610422,
			name = "陕西省",
			city = "咸阳市",
			qu = "三原县",
		},
		[3113]=
		{
			id = 3113,
			code = 610423,
			name = "陕西省",
			city = "咸阳市",
			qu = "泾阳县",
		},
		[3114]=
		{
			id = 3114,
			code = 610424,
			name = "陕西省",
			city = "咸阳市",
			qu = "乾县",
		},
		[3115]=
		{
			id = 3115,
			code = 610425,
			name = "陕西省",
			city = "咸阳市",
			qu = "礼泉县",
		},
		[3116]=
		{
			id = 3116,
			code = 610426,
			name = "陕西省",
			city = "咸阳市",
			qu = "永寿县",
		},
		[3117]=
		{
			id = 3117,
			code = 610427,
			name = "陕西省",
			city = "咸阳市",
			qu = "彬县",
		},
		[3118]=
		{
			id = 3118,
			code = 610428,
			name = "陕西省",
			city = "咸阳市",
			qu = "长武县",
		},
		[3119]=
		{
			id = 3119,
			code = 610429,
			name = "陕西省",
			city = "咸阳市",
			qu = "旬邑县",
		},
		[3120]=
		{
			id = 3120,
			code = 610430,
			name = "陕西省",
			city = "咸阳市",
			qu = "淳化县",
		},
		[3121]=
		{
			id = 3121,
			code = 610431,
			name = "陕西省",
			city = "咸阳市",
			qu = "武功县",
		},
		[3122]=
		{
			id = 3122,
			code = 610481,
			name = "陕西省",
			city = "咸阳市",
			qu = "兴平市",
		},
		[3123]=
		{
			id = 3123,
			code = 610500,
			name = "陕西省",
			city = "渭南市",
		},
		[3124]=
		{
			id = 3124,
			code = 610501,
			name = "陕西省",
			city = "渭南市",
			qu = "市辖区",
		},
		[3125]=
		{
			id = 3125,
			code = 610502,
			name = "陕西省",
			city = "渭南市",
			qu = "临渭区",
		},
		[3126]=
		{
			id = 3126,
			code = 610521,
			name = "陕西省",
			city = "渭南市",
			qu = "华县",
		},
		[3127]=
		{
			id = 3127,
			code = 610522,
			name = "陕西省",
			city = "渭南市",
			qu = "潼关县",
		},
		[3128]=
		{
			id = 3128,
			code = 610523,
			name = "陕西省",
			city = "渭南市",
			qu = "大荔县",
		},
		[3129]=
		{
			id = 3129,
			code = 610524,
			name = "陕西省",
			city = "渭南市",
			qu = "合阳县",
		},
		[3130]=
		{
			id = 3130,
			code = 610525,
			name = "陕西省",
			city = "渭南市",
			qu = "澄城县",
		},
		[3131]=
		{
			id = 3131,
			code = 610526,
			name = "陕西省",
			city = "渭南市",
			qu = "蒲城县",
		},
		[3132]=
		{
			id = 3132,
			code = 610527,
			name = "陕西省",
			city = "渭南市",
			qu = "白水县",
		},
		[3133]=
		{
			id = 3133,
			code = 610528,
			name = "陕西省",
			city = "渭南市",
			qu = "富平县",
		},
		[3134]=
		{
			id = 3134,
			code = 610581,
			name = "陕西省",
			city = "渭南市",
			qu = "韩城市",
		},
		[3135]=
		{
			id = 3135,
			code = 610582,
			name = "陕西省",
			city = "渭南市",
			qu = "华阴市",
		},
		[3136]=
		{
			id = 3136,
			code = 610600,
			name = "陕西省",
			city = "延安市",
		},
		[3137]=
		{
			id = 3137,
			code = 610601,
			name = "陕西省",
			city = "延安市",
			qu = "市辖区",
		},
		[3138]=
		{
			id = 3138,
			code = 610602,
			name = "陕西省",
			city = "延安市",
			qu = "宝塔区",
		},
		[3139]=
		{
			id = 3139,
			code = 610621,
			name = "陕西省",
			city = "延安市",
			qu = "延长县",
		},
		[3140]=
		{
			id = 3140,
			code = 610622,
			name = "陕西省",
			city = "延安市",
			qu = "延川县",
		},
		[3141]=
		{
			id = 3141,
			code = 610623,
			name = "陕西省",
			city = "延安市",
			qu = "子长县",
		},
		[3142]=
		{
			id = 3142,
			code = 610624,
			name = "陕西省",
			city = "延安市",
			qu = "安塞县",
		},
		[3143]=
		{
			id = 3143,
			code = 610625,
			name = "陕西省",
			city = "延安市",
			qu = "志丹县",
		},
		[3144]=
		{
			id = 3144,
			code = 610626,
			name = "陕西省",
			city = "延安市",
			qu = "吴起县",
		},
		[3145]=
		{
			id = 3145,
			code = 610627,
			name = "陕西省",
			city = "延安市",
			qu = "甘泉县",
		},
		[3146]=
		{
			id = 3146,
			code = 610628,
			name = "陕西省",
			city = "延安市",
			qu = "富县",
		},
		[3147]=
		{
			id = 3147,
			code = 610629,
			name = "陕西省",
			city = "延安市",
			qu = "洛川县",
		},
		[3148]=
		{
			id = 3148,
			code = 610630,
			name = "陕西省",
			city = "延安市",
			qu = "宜川县",
		},
		[3149]=
		{
			id = 3149,
			code = 610631,
			name = "陕西省",
			city = "延安市",
			qu = "黄龙县",
		},
		[3150]=
		{
			id = 3150,
			code = 610632,
			name = "陕西省",
			city = "延安市",
			qu = "黄陵县",
		},
		[3151]=
		{
			id = 3151,
			code = 610700,
			name = "陕西省",
			city = "汉中市",
		},
		[3152]=
		{
			id = 3152,
			code = 610701,
			name = "陕西省",
			city = "汉中市",
			qu = "市辖区",
		},
		[3153]=
		{
			id = 3153,
			code = 610702,
			name = "陕西省",
			city = "汉中市",
			qu = "汉台区",
		},
		[3154]=
		{
			id = 3154,
			code = 610721,
			name = "陕西省",
			city = "汉中市",
			qu = "南郑县",
		},
		[3155]=
		{
			id = 3155,
			code = 610722,
			name = "陕西省",
			city = "汉中市",
			qu = "城固县",
		},
		[3156]=
		{
			id = 3156,
			code = 610723,
			name = "陕西省",
			city = "汉中市",
			qu = "洋县",
		},
		[3157]=
		{
			id = 3157,
			code = 610724,
			name = "陕西省",
			city = "汉中市",
			qu = "西乡县",
		},
		[3158]=
		{
			id = 3158,
			code = 610725,
			name = "陕西省",
			city = "汉中市",
			qu = "勉县",
		},
		[3159]=
		{
			id = 3159,
			code = 610726,
			name = "陕西省",
			city = "汉中市",
			qu = "宁强县",
		},
		[3160]=
		{
			id = 3160,
			code = 610727,
			name = "陕西省",
			city = "汉中市",
			qu = "略阳县",
		},
		[3161]=
		{
			id = 3161,
			code = 610728,
			name = "陕西省",
			city = "汉中市",
			qu = "镇巴县",
		},
		[3162]=
		{
			id = 3162,
			code = 610729,
			name = "陕西省",
			city = "汉中市",
			qu = "留坝县",
		},
		[3163]=
		{
			id = 3163,
			code = 610730,
			name = "陕西省",
			city = "汉中市",
			qu = "佛坪县",
		},
		[3164]=
		{
			id = 3164,
			code = 610800,
			name = "陕西省",
			city = "榆林市",
		},
		[3165]=
		{
			id = 3165,
			code = 610801,
			name = "陕西省",
			city = "榆林市",
			qu = "市辖区",
		},
		[3166]=
		{
			id = 3166,
			code = 610802,
			name = "陕西省",
			city = "榆林市",
			qu = "榆阳区",
		},
		[3167]=
		{
			id = 3167,
			code = 610821,
			name = "陕西省",
			city = "榆林市",
			qu = "神木县",
		},
		[3168]=
		{
			id = 3168,
			code = 610822,
			name = "陕西省",
			city = "榆林市",
			qu = "府谷县",
		},
		[3169]=
		{
			id = 3169,
			code = 610823,
			name = "陕西省",
			city = "榆林市",
			qu = "横山县",
		},
		[3170]=
		{
			id = 3170,
			code = 610824,
			name = "陕西省",
			city = "榆林市",
			qu = "靖边县",
		},
		[3171]=
		{
			id = 3171,
			code = 610825,
			name = "陕西省",
			city = "榆林市",
			qu = "定边县",
		},
		[3172]=
		{
			id = 3172,
			code = 610826,
			name = "陕西省",
			city = "榆林市",
			qu = "绥德县",
		},
		[3173]=
		{
			id = 3173,
			code = 610827,
			name = "陕西省",
			city = "榆林市",
			qu = "米脂县",
		},
		[3174]=
		{
			id = 3174,
			code = 610828,
			name = "陕西省",
			city = "榆林市",
			qu = "佳县",
		},
		[3175]=
		{
			id = 3175,
			code = 610829,
			name = "陕西省",
			city = "榆林市",
			qu = "吴堡县",
		},
		[3176]=
		{
			id = 3176,
			code = 610830,
			name = "陕西省",
			city = "榆林市",
			qu = "清涧县",
		},
		[3177]=
		{
			id = 3177,
			code = 610831,
			name = "陕西省",
			city = "榆林市",
			qu = "子洲县",
		},
		[3178]=
		{
			id = 3178,
			code = 610900,
			name = "陕西省",
			city = "安康市",
		},
		[3179]=
		{
			id = 3179,
			code = 610901,
			name = "陕西省",
			city = "安康市",
			qu = "市辖区",
		},
		[3180]=
		{
			id = 3180,
			code = 610902,
			name = "陕西省",
			city = "安康市",
			qu = "汉滨区",
		},
		[3181]=
		{
			id = 3181,
			code = 610921,
			name = "陕西省",
			city = "安康市",
			qu = "汉阴县",
		},
		[3182]=
		{
			id = 3182,
			code = 610922,
			name = "陕西省",
			city = "安康市",
			qu = "石泉县",
		},
		[3183]=
		{
			id = 3183,
			code = 610923,
			name = "陕西省",
			city = "安康市",
			qu = "宁陕县",
		},
		[3184]=
		{
			id = 3184,
			code = 610924,
			name = "陕西省",
			city = "安康市",
			qu = "紫阳县",
		},
		[3185]=
		{
			id = 3185,
			code = 610925,
			name = "陕西省",
			city = "安康市",
			qu = "岚皋县",
		},
		[3186]=
		{
			id = 3186,
			code = 610926,
			name = "陕西省",
			city = "安康市",
			qu = "平利县",
		},
		[3187]=
		{
			id = 3187,
			code = 610927,
			name = "陕西省",
			city = "安康市",
			qu = "镇坪县",
		},
		[3188]=
		{
			id = 3188,
			code = 610928,
			name = "陕西省",
			city = "安康市",
			qu = "旬阳县",
		},
		[3189]=
		{
			id = 3189,
			code = 610929,
			name = "陕西省",
			city = "安康市",
			qu = "白河县",
		},
		[3190]=
		{
			id = 3190,
			code = 611000,
			name = "陕西省",
			city = "商洛市",
		},
		[3191]=
		{
			id = 3191,
			code = 611001,
			name = "陕西省",
			city = "商洛市",
			qu = "市辖区",
		},
		[3192]=
		{
			id = 3192,
			code = 611002,
			name = "陕西省",
			city = "商洛市",
			qu = "商州区",
		},
		[3193]=
		{
			id = 3193,
			code = 611021,
			name = "陕西省",
			city = "商洛市",
			qu = "洛南县",
		},
		[3194]=
		{
			id = 3194,
			code = 611022,
			name = "陕西省",
			city = "商洛市",
			qu = "丹凤县",
		},
		[3195]=
		{
			id = 3195,
			code = 611023,
			name = "陕西省",
			city = "商洛市",
			qu = "商南县",
		},
		[3196]=
		{
			id = 3196,
			code = 611024,
			name = "陕西省",
			city = "商洛市",
			qu = "山阳县",
		},
		[3197]=
		{
			id = 3197,
			code = 611025,
			name = "陕西省",
			city = "商洛市",
			qu = "镇安县",
		},
		[3198]=
		{
			id = 3198,
			code = 611026,
			name = "陕西省",
			city = "商洛市",
			qu = "柞水县",
		},
		[3199]=
		{
			id = 3199,
			code = 620000,
			name = "甘肃省",
		},
		[3200]=
		{
			id = 3200,
			code = 620100,
			name = "甘肃省",
			city = "兰州市",
		},
		[3201]=
		{
			id = 3201,
			code = 620101,
			name = "甘肃省",
			city = "兰州市",
			qu = "市辖区",
		},
		[3202]=
		{
			id = 3202,
			code = 620102,
			name = "甘肃省",
			city = "兰州市",
			qu = "城关区",
		},
		[3203]=
		{
			id = 3203,
			code = 620103,
			name = "甘肃省",
			city = "兰州市",
			qu = "七里河区",
		},
		[3204]=
		{
			id = 3204,
			code = 620104,
			name = "甘肃省",
			city = "兰州市",
			qu = "西固区",
		},
		[3205]=
		{
			id = 3205,
			code = 620105,
			name = "甘肃省",
			city = "兰州市",
			qu = "安宁区",
		},
		[3206]=
		{
			id = 3206,
			code = 620111,
			name = "甘肃省",
			city = "兰州市",
			qu = "红古区",
		},
		[3207]=
		{
			id = 3207,
			code = 620121,
			name = "甘肃省",
			city = "兰州市",
			qu = "永登县",
		},
		[3208]=
		{
			id = 3208,
			code = 620122,
			name = "甘肃省",
			city = "兰州市",
			qu = "皋兰县",
		},
		[3209]=
		{
			id = 3209,
			code = 620123,
			name = "甘肃省",
			city = "兰州市",
			qu = "榆中县",
		},
		[3210]=
		{
			id = 3210,
			code = 620200,
			name = "甘肃省",
			city = "嘉峪关市",
		},
		[3211]=
		{
			id = 3211,
			code = 620201,
			name = "甘肃省",
			city = "嘉峪关市",
			qu = "市辖区",
		},
		[3212]=
		{
			id = 3212,
			code = 620300,
			name = "甘肃省",
			city = "金昌市",
		},
		[3213]=
		{
			id = 3213,
			code = 620301,
			name = "甘肃省",
			city = "金昌市",
			qu = "市辖区",
		},
		[3214]=
		{
			id = 3214,
			code = 620302,
			name = "甘肃省",
			city = "金昌市",
			qu = "金川区",
		},
		[3215]=
		{
			id = 3215,
			code = 620321,
			name = "甘肃省",
			city = "金昌市",
			qu = "永昌县",
		},
		[3216]=
		{
			id = 3216,
			code = 620400,
			name = "甘肃省",
			city = "白银市",
		},
		[3217]=
		{
			id = 3217,
			code = 620401,
			name = "甘肃省",
			city = "白银市",
			qu = "市辖区",
		},
		[3218]=
		{
			id = 3218,
			code = 620402,
			name = "甘肃省",
			city = "白银市",
			qu = "白银区",
		},
		[3219]=
		{
			id = 3219,
			code = 620403,
			name = "甘肃省",
			city = "白银市",
			qu = "平川区",
		},
		[3220]=
		{
			id = 3220,
			code = 620421,
			name = "甘肃省",
			city = "白银市",
			qu = "靖远县",
		},
		[3221]=
		{
			id = 3221,
			code = 620422,
			name = "甘肃省",
			city = "白银市",
			qu = "会宁县",
		},
		[3222]=
		{
			id = 3222,
			code = 620423,
			name = "甘肃省",
			city = "白银市",
			qu = "景泰县",
		},
		[3223]=
		{
			id = 3223,
			code = 620500,
			name = "甘肃省",
			city = "天水市",
		},
		[3224]=
		{
			id = 3224,
			code = 620501,
			name = "甘肃省",
			city = "天水市",
			qu = "市辖区",
		},
		[3225]=
		{
			id = 3225,
			code = 620502,
			name = "甘肃省",
			city = "天水市",
			qu = "秦州区",
		},
		[3226]=
		{
			id = 3226,
			code = 620503,
			name = "甘肃省",
			city = "天水市",
			qu = "麦积区",
		},
		[3227]=
		{
			id = 3227,
			code = 620521,
			name = "甘肃省",
			city = "天水市",
			qu = "清水县",
		},
		[3228]=
		{
			id = 3228,
			code = 620522,
			name = "甘肃省",
			city = "天水市",
			qu = "秦安县",
		},
		[3229]=
		{
			id = 3229,
			code = 620523,
			name = "甘肃省",
			city = "天水市",
			qu = "甘谷县",
		},
		[3230]=
		{
			id = 3230,
			code = 620524,
			name = "甘肃省",
			city = "天水市",
			qu = "武山县",
		},
		[3231]=
		{
			id = 3231,
			code = 620525,
			name = "甘肃省",
			city = "天水市",
			qu = "张家川回族自治县",
		},
		[3232]=
		{
			id = 3232,
			code = 620600,
			name = "甘肃省",
			city = "武威市",
		},
		[3233]=
		{
			id = 3233,
			code = 620601,
			name = "甘肃省",
			city = "武威市",
			qu = "市辖区",
		},
		[3234]=
		{
			id = 3234,
			code = 620602,
			name = "甘肃省",
			city = "武威市",
			qu = "凉州区",
		},
		[3235]=
		{
			id = 3235,
			code = 620621,
			name = "甘肃省",
			city = "武威市",
			qu = "民勤县",
		},
		[3236]=
		{
			id = 3236,
			code = 620622,
			name = "甘肃省",
			city = "武威市",
			qu = "古浪县",
		},
		[3237]=
		{
			id = 3237,
			code = 620623,
			name = "甘肃省",
			city = "武威市",
			qu = "天祝藏族自治县",
		},
		[3238]=
		{
			id = 3238,
			code = 620700,
			name = "甘肃省",
			city = "张掖市",
		},
		[3239]=
		{
			id = 3239,
			code = 620701,
			name = "甘肃省",
			city = "张掖市",
			qu = "市辖区",
		},
		[3240]=
		{
			id = 3240,
			code = 620702,
			name = "甘肃省",
			city = "张掖市",
			qu = "甘州区",
		},
		[3241]=
		{
			id = 3241,
			code = 620721,
			name = "甘肃省",
			city = "张掖市",
			qu = "肃南裕固族自治县",
		},
		[3242]=
		{
			id = 3242,
			code = 620722,
			name = "甘肃省",
			city = "张掖市",
			qu = "民乐县",
		},
		[3243]=
		{
			id = 3243,
			code = 620723,
			name = "甘肃省",
			city = "张掖市",
			qu = "临泽县",
		},
		[3244]=
		{
			id = 3244,
			code = 620724,
			name = "甘肃省",
			city = "张掖市",
			qu = "高台县",
		},
		[3245]=
		{
			id = 3245,
			code = 620725,
			name = "甘肃省",
			city = "张掖市",
			qu = "山丹县",
		},
		[3246]=
		{
			id = 3246,
			code = 620800,
			name = "甘肃省",
			city = "平凉市",
		},
		[3247]=
		{
			id = 3247,
			code = 620801,
			name = "甘肃省",
			city = "平凉市",
			qu = "市辖区",
		},
		[3248]=
		{
			id = 3248,
			code = 620802,
			name = "甘肃省",
			city = "平凉市",
			qu = "崆峒区",
		},
		[3249]=
		{
			id = 3249,
			code = 620821,
			name = "甘肃省",
			city = "平凉市",
			qu = "泾川县",
		},
		[3250]=
		{
			id = 3250,
			code = 620822,
			name = "甘肃省",
			city = "平凉市",
			qu = "灵台县",
		},
		[3251]=
		{
			id = 3251,
			code = 620823,
			name = "甘肃省",
			city = "平凉市",
			qu = "崇信县",
		},
		[3252]=
		{
			id = 3252,
			code = 620824,
			name = "甘肃省",
			city = "平凉市",
			qu = "华亭县",
		},
		[3253]=
		{
			id = 3253,
			code = 620825,
			name = "甘肃省",
			city = "平凉市",
			qu = "庄浪县",
		},
		[3254]=
		{
			id = 3254,
			code = 620826,
			name = "甘肃省",
			city = "平凉市",
			qu = "静宁县",
		},
		[3255]=
		{
			id = 3255,
			code = 620900,
			name = "甘肃省",
			city = "酒泉市",
		},
		[3256]=
		{
			id = 3256,
			code = 620901,
			name = "甘肃省",
			city = "酒泉市",
			qu = "市辖区",
		},
		[3257]=
		{
			id = 3257,
			code = 620902,
			name = "甘肃省",
			city = "酒泉市",
			qu = "肃州区",
		},
		[3258]=
		{
			id = 3258,
			code = 620921,
			name = "甘肃省",
			city = "酒泉市",
			qu = "金塔县",
		},
		[3259]=
		{
			id = 3259,
			code = 620922,
			name = "甘肃省",
			city = "酒泉市",
			qu = "瓜州县",
		},
		[3260]=
		{
			id = 3260,
			code = 620923,
			name = "甘肃省",
			city = "酒泉市",
			qu = "肃北蒙古族自治县",
		},
		[3261]=
		{
			id = 3261,
			code = 620924,
			name = "甘肃省",
			city = "酒泉市",
			qu = "阿克塞哈萨克族自治县",
		},
		[3262]=
		{
			id = 3262,
			code = 620981,
			name = "甘肃省",
			city = "酒泉市",
			qu = "玉门市",
		},
		[3263]=
		{
			id = 3263,
			code = 620982,
			name = "甘肃省",
			city = "酒泉市",
			qu = "敦煌市",
		},
		[3264]=
		{
			id = 3264,
			code = 621000,
			name = "甘肃省",
			city = "庆阳市",
		},
		[3265]=
		{
			id = 3265,
			code = 621001,
			name = "甘肃省",
			city = "庆阳市",
			qu = "市辖区",
		},
		[3266]=
		{
			id = 3266,
			code = 621002,
			name = "甘肃省",
			city = "庆阳市",
			qu = "西峰区",
		},
		[3267]=
		{
			id = 3267,
			code = 621021,
			name = "甘肃省",
			city = "庆阳市",
			qu = "庆城县",
		},
		[3268]=
		{
			id = 3268,
			code = 621022,
			name = "甘肃省",
			city = "庆阳市",
			qu = "环县",
		},
		[3269]=
		{
			id = 3269,
			code = 621023,
			name = "甘肃省",
			city = "庆阳市",
			qu = "华池县",
		},
		[3270]=
		{
			id = 3270,
			code = 621024,
			name = "甘肃省",
			city = "庆阳市",
			qu = "合水县",
		},
		[3271]=
		{
			id = 3271,
			code = 621025,
			name = "甘肃省",
			city = "庆阳市",
			qu = "正宁县",
		},
		[3272]=
		{
			id = 3272,
			code = 621026,
			name = "甘肃省",
			city = "庆阳市",
			qu = "宁县",
		},
		[3273]=
		{
			id = 3273,
			code = 621027,
			name = "甘肃省",
			city = "庆阳市",
			qu = "镇原县",
		},
		[3274]=
		{
			id = 3274,
			code = 621100,
			name = "甘肃省",
			city = "定西市",
		},
		[3275]=
		{
			id = 3275,
			code = 621101,
			name = "甘肃省",
			city = "定西市",
			qu = "市辖区",
		},
		[3276]=
		{
			id = 3276,
			code = 621102,
			name = "甘肃省",
			city = "定西市",
			qu = "安定区",
		},
		[3277]=
		{
			id = 3277,
			code = 621121,
			name = "甘肃省",
			city = "定西市",
			qu = "通渭县",
		},
		[3278]=
		{
			id = 3278,
			code = 621122,
			name = "甘肃省",
			city = "定西市",
			qu = "陇西县",
		},
		[3279]=
		{
			id = 3279,
			code = 621123,
			name = "甘肃省",
			city = "定西市",
			qu = "渭源县",
		},
		[3280]=
		{
			id = 3280,
			code = 621124,
			name = "甘肃省",
			city = "定西市",
			qu = "临洮县",
		},
		[3281]=
		{
			id = 3281,
			code = 621125,
			name = "甘肃省",
			city = "定西市",
			qu = "漳县",
		},
		[3282]=
		{
			id = 3282,
			code = 621126,
			name = "甘肃省",
			city = "定西市",
			qu = "岷县",
		},
		[3283]=
		{
			id = 3283,
			code = 621200,
			name = "甘肃省",
			city = "陇南市",
		},
		[3284]=
		{
			id = 3284,
			code = 621201,
			name = "甘肃省",
			city = "陇南市",
			qu = "市辖区",
		},
		[3285]=
		{
			id = 3285,
			code = 621202,
			name = "甘肃省",
			city = "陇南市",
			qu = "武都区",
		},
		[3286]=
		{
			id = 3286,
			code = 621221,
			name = "甘肃省",
			city = "陇南市",
			qu = "成县",
		},
		[3287]=
		{
			id = 3287,
			code = 621222,
			name = "甘肃省",
			city = "陇南市",
			qu = "文县",
		},
		[3288]=
		{
			id = 3288,
			code = 621223,
			name = "甘肃省",
			city = "陇南市",
			qu = "宕昌县",
		},
		[3289]=
		{
			id = 3289,
			code = 621224,
			name = "甘肃省",
			city = "陇南市",
			qu = "康县",
		},
		[3290]=
		{
			id = 3290,
			code = 621225,
			name = "甘肃省",
			city = "陇南市",
			qu = "西和县",
		},
		[3291]=
		{
			id = 3291,
			code = 621226,
			name = "甘肃省",
			city = "陇南市",
			qu = "礼县",
		},
		[3292]=
		{
			id = 3292,
			code = 621227,
			name = "甘肃省",
			city = "陇南市",
			qu = "徽县",
		},
		[3293]=
		{
			id = 3293,
			code = 621228,
			name = "甘肃省",
			city = "陇南市",
			qu = "两当县",
		},
		[3294]=
		{
			id = 3294,
			code = 622900,
			name = "甘肃省",
			city = "临夏回族自治州",
		},
		[3295]=
		{
			id = 3295,
			code = 622901,
			name = "甘肃省",
			city = "临夏回族自治州",
			qu = "临夏市",
		},
		[3296]=
		{
			id = 3296,
			code = 622921,
			name = "甘肃省",
			city = "临夏回族自治州",
			qu = "临夏县",
		},
		[3297]=
		{
			id = 3297,
			code = 622922,
			name = "甘肃省",
			city = "临夏回族自治州",
			qu = "康乐县",
		},
		[3298]=
		{
			id = 3298,
			code = 622923,
			name = "甘肃省",
			city = "临夏回族自治州",
			qu = "永靖县",
		},
		[3299]=
		{
			id = 3299,
			code = 622924,
			name = "甘肃省",
			city = "临夏回族自治州",
			qu = "广河县",
		},
		[3300]=
		{
			id = 3300,
			code = 622925,
			name = "甘肃省",
			city = "临夏回族自治州",
			qu = "和政县",
		},
		[3301]=
		{
			id = 3301,
			code = 622926,
			name = "甘肃省",
			city = "临夏回族自治州",
			qu = "东乡族自治县",
		},
		[3302]=
		{
			id = 3302,
			code = 622927,
			name = "甘肃省",
			city = "临夏回族自治州",
			qu = "积石山保安族东乡族撒拉族自治县",
		},
		[3303]=
		{
			id = 3303,
			code = 623000,
			name = "甘肃省",
			city = "甘南藏族自治州",
		},
		[3304]=
		{
			id = 3304,
			code = 623001,
			name = "甘肃省",
			city = "甘南藏族自治州",
			qu = "合作市",
		},
		[3305]=
		{
			id = 3305,
			code = 623021,
			name = "甘肃省",
			city = "甘南藏族自治州",
			qu = "临潭县",
		},
		[3306]=
		{
			id = 3306,
			code = 623022,
			name = "甘肃省",
			city = "甘南藏族自治州",
			qu = "卓尼县",
		},
		[3307]=
		{
			id = 3307,
			code = 623023,
			name = "甘肃省",
			city = "甘南藏族自治州",
			qu = "舟曲县",
		},
		[3308]=
		{
			id = 3308,
			code = 623024,
			name = "甘肃省",
			city = "甘南藏族自治州",
			qu = "迭部县",
		},
		[3309]=
		{
			id = 3309,
			code = 623025,
			name = "甘肃省",
			city = "甘南藏族自治州",
			qu = "玛曲县",
		},
		[3310]=
		{
			id = 3310,
			code = 623026,
			name = "甘肃省",
			city = "甘南藏族自治州",
			qu = "碌曲县",
		},
		[3311]=
		{
			id = 3311,
			code = 623027,
			name = "甘肃省",
			city = "甘南藏族自治州",
			qu = "夏河县",
		},
		[3312]=
		{
			id = 3312,
			code = 630000,
			name = "青海省",
		},
		[3313]=
		{
			id = 3313,
			code = 630100,
			name = "青海省",
			city = "西宁市",
		},
		[3314]=
		{
			id = 3314,
			code = 630101,
			name = "青海省",
			city = "西宁市",
			qu = "市辖区",
		},
		[3315]=
		{
			id = 3315,
			code = 630102,
			name = "青海省",
			city = "西宁市",
			qu = "城东区",
		},
		[3316]=
		{
			id = 3316,
			code = 630103,
			name = "青海省",
			city = "西宁市",
			qu = "城中区",
		},
		[3317]=
		{
			id = 3317,
			code = 630104,
			name = "青海省",
			city = "西宁市",
			qu = "城西区",
		},
		[3318]=
		{
			id = 3318,
			code = 630105,
			name = "青海省",
			city = "西宁市",
			qu = "城北区",
		},
		[3319]=
		{
			id = 3319,
			code = 630121,
			name = "青海省",
			city = "西宁市",
			qu = "大通回族土族自治县",
		},
		[3320]=
		{
			id = 3320,
			code = 630122,
			name = "青海省",
			city = "西宁市",
			qu = "湟中县",
		},
		[3321]=
		{
			id = 3321,
			code = 630123,
			name = "青海省",
			city = "西宁市",
			qu = "湟源县",
		},
		[3322]=
		{
			id = 3322,
			code = 632100,
			name = "青海省",
			city = "海东地区",
		},
		[3323]=
		{
			id = 3323,
			code = 632121,
			name = "青海省",
			city = "海东地区",
			qu = "平安县",
		},
		[3324]=
		{
			id = 3324,
			code = 632122,
			name = "青海省",
			city = "海东地区",
			qu = "民和回族土族自治县",
		},
		[3325]=
		{
			id = 3325,
			code = 632123,
			name = "青海省",
			city = "海东地区",
			qu = "乐都县",
		},
		[3326]=
		{
			id = 3326,
			code = 632126,
			name = "青海省",
			city = "海东地区",
			qu = "互助土族自治县",
		},
		[3327]=
		{
			id = 3327,
			code = 632127,
			name = "青海省",
			city = "海东地区",
			qu = "化隆回族自治县",
		},
		[3328]=
		{
			id = 3328,
			code = 632128,
			name = "青海省",
			city = "海东地区",
			qu = "循化撒拉族自治县",
		},
		[3329]=
		{
			id = 3329,
			code = 632200,
			name = "青海省",
			city = "海北藏族自治州",
		},
		[3330]=
		{
			id = 3330,
			code = 632221,
			name = "青海省",
			city = "海北藏族自治州",
			qu = "门源回族自治县",
		},
		[3331]=
		{
			id = 3331,
			code = 632222,
			name = "青海省",
			city = "海北藏族自治州",
			qu = "祁连县",
		},
		[3332]=
		{
			id = 3332,
			code = 632223,
			name = "青海省",
			city = "海北藏族自治州",
			qu = "海晏县",
		},
		[3333]=
		{
			id = 3333,
			code = 632224,
			name = "青海省",
			city = "海北藏族自治州",
			qu = "刚察县",
		},
		[3334]=
		{
			id = 3334,
			code = 632300,
			name = "青海省",
			city = "黄南藏族自治州",
		},
		[3335]=
		{
			id = 3335,
			code = 632321,
			name = "青海省",
			city = "黄南藏族自治州",
			qu = "同仁县",
		},
		[3336]=
		{
			id = 3336,
			code = 632322,
			name = "青海省",
			city = "黄南藏族自治州",
			qu = "尖扎县",
		},
		[3337]=
		{
			id = 3337,
			code = 632323,
			name = "青海省",
			city = "黄南藏族自治州",
			qu = "泽库县",
		},
		[3338]=
		{
			id = 3338,
			code = 632324,
			name = "青海省",
			city = "黄南藏族自治州",
			qu = "河南蒙古族自治县",
		},
		[3339]=
		{
			id = 3339,
			code = 632500,
			name = "青海省",
			city = "海南藏族自治州",
		},
		[3340]=
		{
			id = 3340,
			code = 632521,
			name = "青海省",
			city = "海南藏族自治州",
			qu = "共和县",
		},
		[3341]=
		{
			id = 3341,
			code = 632522,
			name = "青海省",
			city = "海南藏族自治州",
			qu = "同德县",
		},
		[3342]=
		{
			id = 3342,
			code = 632523,
			name = "青海省",
			city = "海南藏族自治州",
			qu = "贵德县",
		},
		[3343]=
		{
			id = 3343,
			code = 632524,
			name = "青海省",
			city = "海南藏族自治州",
			qu = "兴海县",
		},
		[3344]=
		{
			id = 3344,
			code = 632525,
			name = "青海省",
			city = "海南藏族自治州",
			qu = "贵南县",
		},
		[3345]=
		{
			id = 3345,
			code = 632600,
			name = "青海省",
			city = "果洛藏族自治州",
		},
		[3346]=
		{
			id = 3346,
			code = 632621,
			name = "青海省",
			city = "果洛藏族自治州",
			qu = "玛沁县",
		},
		[3347]=
		{
			id = 3347,
			code = 632622,
			name = "青海省",
			city = "果洛藏族自治州",
			qu = "班玛县",
		},
		[3348]=
		{
			id = 3348,
			code = 632623,
			name = "青海省",
			city = "果洛藏族自治州",
			qu = "甘德县",
		},
		[3349]=
		{
			id = 3349,
			code = 632624,
			name = "青海省",
			city = "果洛藏族自治州",
			qu = "达日县",
		},
		[3350]=
		{
			id = 3350,
			code = 632625,
			name = "青海省",
			city = "果洛藏族自治州",
			qu = "久治县",
		},
		[3351]=
		{
			id = 3351,
			code = 632626,
			name = "青海省",
			city = "果洛藏族自治州",
			qu = "玛多县",
		},
		[3352]=
		{
			id = 3352,
			code = 632700,
			name = "青海省",
			city = "玉树藏族自治州",
		},
		[3353]=
		{
			id = 3353,
			code = 632721,
			name = "青海省",
			city = "玉树藏族自治州",
			qu = "玉树县",
		},
		[3354]=
		{
			id = 3354,
			code = 632722,
			name = "青海省",
			city = "玉树藏族自治州",
			qu = "杂多县",
		},
		[3355]=
		{
			id = 3355,
			code = 632723,
			name = "青海省",
			city = "玉树藏族自治州",
			qu = "称多县",
		},
		[3356]=
		{
			id = 3356,
			code = 632724,
			name = "青海省",
			city = "玉树藏族自治州",
			qu = "治多县",
		},
		[3357]=
		{
			id = 3357,
			code = 632725,
			name = "青海省",
			city = "玉树藏族自治州",
			qu = "囊谦县",
		},
		[3358]=
		{
			id = 3358,
			code = 632726,
			name = "青海省",
			city = "玉树藏族自治州",
			qu = "曲麻莱县",
		},
		[3359]=
		{
			id = 3359,
			code = 632800,
			name = "青海省",
			city = "海西蒙古族藏族自治州",
		},
		[3360]=
		{
			id = 3360,
			code = 632801,
			name = "青海省",
			city = "海西蒙古族藏族自治州",
			qu = "格尔木市",
		},
		[3361]=
		{
			id = 3361,
			code = 632802,
			name = "青海省",
			city = "海西蒙古族藏族自治州",
			qu = "德令哈市",
		},
		[3362]=
		{
			id = 3362,
			code = 632821,
			name = "青海省",
			city = "海西蒙古族藏族自治州",
			qu = "乌兰县",
		},
		[3363]=
		{
			id = 3363,
			code = 632822,
			name = "青海省",
			city = "海西蒙古族藏族自治州",
			qu = "都兰县",
		},
		[3364]=
		{
			id = 3364,
			code = 632823,
			name = "青海省",
			city = "海西蒙古族藏族自治州",
			qu = "天峻县",
		},
		[3365]=
		{
			id = 3365,
			code = 640000,
			name = "宁夏回族自治区",
		},
		[3366]=
		{
			id = 3366,
			code = 640100,
			name = "宁夏回族自治区",
			city = "银川市",
		},
		[3367]=
		{
			id = 3367,
			code = 640101,
			name = "宁夏回族自治区",
			city = "银川市",
			qu = "市辖区",
		},
		[3368]=
		{
			id = 3368,
			code = 640104,
			name = "宁夏回族自治区",
			city = "银川市",
			qu = "兴庆区",
		},
		[3369]=
		{
			id = 3369,
			code = 640105,
			name = "宁夏回族自治区",
			city = "银川市",
			qu = "西夏区",
		},
		[3370]=
		{
			id = 3370,
			code = 640106,
			name = "宁夏回族自治区",
			city = "银川市",
			qu = "金凤区",
		},
		[3371]=
		{
			id = 3371,
			code = 640121,
			name = "宁夏回族自治区",
			city = "银川市",
			qu = "永宁县",
		},
		[3372]=
		{
			id = 3372,
			code = 640122,
			name = "宁夏回族自治区",
			city = "银川市",
			qu = "贺兰县",
		},
		[3373]=
		{
			id = 3373,
			code = 640181,
			name = "宁夏回族自治区",
			city = "银川市",
			qu = "灵武市",
		},
		[3374]=
		{
			id = 3374,
			code = 640200,
			name = "宁夏回族自治区",
			city = "石嘴山市",
		},
		[3375]=
		{
			id = 3375,
			code = 640201,
			name = "宁夏回族自治区",
			city = "石嘴山市",
			qu = "市辖区",
		},
		[3376]=
		{
			id = 3376,
			code = 640202,
			name = "宁夏回族自治区",
			city = "石嘴山市",
			qu = "大武口区",
		},
		[3377]=
		{
			id = 3377,
			code = 640205,
			name = "宁夏回族自治区",
			city = "石嘴山市",
			qu = "惠农区",
		},
		[3378]=
		{
			id = 3378,
			code = 640221,
			name = "宁夏回族自治区",
			city = "石嘴山市",
			qu = "平罗县",
		},
		[3379]=
		{
			id = 3379,
			code = 640300,
			name = "宁夏回族自治区",
			city = "吴忠市",
		},
		[3380]=
		{
			id = 3380,
			code = 640301,
			name = "宁夏回族自治区",
			city = "吴忠市",
			qu = "市辖区",
		},
		[3381]=
		{
			id = 3381,
			code = 640302,
			name = "宁夏回族自治区",
			city = "吴忠市",
			qu = "利通区",
		},
		[3382]=
		{
			id = 3382,
			code = 640323,
			name = "宁夏回族自治区",
			city = "吴忠市",
			qu = "盐池县",
		},
		[3383]=
		{
			id = 3383,
			code = 640324,
			name = "宁夏回族自治区",
			city = "吴忠市",
			qu = "同心县",
		},
		[3384]=
		{
			id = 3384,
			code = 640381,
			name = "宁夏回族自治区",
			city = "吴忠市",
			qu = "青铜峡市",
		},
		[3385]=
		{
			id = 3385,
			code = 640400,
			name = "宁夏回族自治区",
			city = "固原市",
		},
		[3386]=
		{
			id = 3386,
			code = 640401,
			name = "宁夏回族自治区",
			city = "固原市",
			qu = "市辖区",
		},
		[3387]=
		{
			id = 3387,
			code = 640402,
			name = "宁夏回族自治区",
			city = "固原市",
			qu = "原州区",
		},
		[3388]=
		{
			id = 3388,
			code = 640422,
			name = "宁夏回族自治区",
			city = "固原市",
			qu = "西吉县",
		},
		[3389]=
		{
			id = 3389,
			code = 640423,
			name = "宁夏回族自治区",
			city = "固原市",
			qu = "隆德县",
		},
		[3390]=
		{
			id = 3390,
			code = 640424,
			name = "宁夏回族自治区",
			city = "固原市",
			qu = "泾源县",
		},
		[3391]=
		{
			id = 3391,
			code = 640425,
			name = "宁夏回族自治区",
			city = "固原市",
			qu = "彭阳县",
		},
		[3392]=
		{
			id = 3392,
			code = 640500,
			name = "宁夏回族自治区",
			city = "中卫市",
		},
		[3393]=
		{
			id = 3393,
			code = 640501,
			name = "宁夏回族自治区",
			city = "中卫市",
			qu = "市辖区",
		},
		[3394]=
		{
			id = 3394,
			code = 640502,
			name = "宁夏回族自治区",
			city = "中卫市",
			qu = "沙坡头区",
		},
		[3395]=
		{
			id = 3395,
			code = 640521,
			name = "宁夏回族自治区",
			city = "中卫市",
			qu = "中宁县",
		},
		[3396]=
		{
			id = 3396,
			code = 640522,
			name = "宁夏回族自治区",
			city = "中卫市",
			qu = "海原县",
		},
		[3397]=
		{
			id = 3397,
			code = 650000,
			name = "新疆维吾尔自治区",
		},
		[3398]=
		{
			id = 3398,
			code = 650100,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
		},
		[3399]=
		{
			id = 3399,
			code = 650101,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "市辖区",
		},
		[3400]=
		{
			id = 3400,
			code = 650102,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "天山区",
		},
		[3401]=
		{
			id = 3401,
			code = 650103,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "沙依巴克区",
		},
		[3402]=
		{
			id = 3402,
			code = 650104,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "新市区",
		},
		[3403]=
		{
			id = 3403,
			code = 650105,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "水磨沟区",
		},
		[3404]=
		{
			id = 3404,
			code = 650106,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "头屯河区",
		},
		[3405]=
		{
			id = 3405,
			code = 650107,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "达坂城区",
		},
		[3406]=
		{
			id = 3406,
			code = 650109,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "米东区",
		},
		[3407]=
		{
			id = 3407,
			code = 650121,
			name = "新疆维吾尔自治区",
			city = "乌鲁木齐市",
			qu = "乌鲁木齐县",
		},
		[3408]=
		{
			id = 3408,
			code = 650200,
			name = "新疆维吾尔自治区",
			city = "克拉玛依市",
		},
		[3409]=
		{
			id = 3409,
			code = 650201,
			name = "新疆维吾尔自治区",
			city = "克拉玛依市",
			qu = "市辖区",
		},
		[3410]=
		{
			id = 3410,
			code = 650202,
			name = "新疆维吾尔自治区",
			city = "克拉玛依市",
			qu = "独山子区",
		},
		[3411]=
		{
			id = 3411,
			code = 650203,
			name = "新疆维吾尔自治区",
			city = "克拉玛依市",
			qu = "克拉玛依区",
		},
		[3412]=
		{
			id = 3412,
			code = 650204,
			name = "新疆维吾尔自治区",
			city = "克拉玛依市",
			qu = "白碱滩区",
		},
		[3413]=
		{
			id = 3413,
			code = 650205,
			name = "新疆维吾尔自治区",
			city = "克拉玛依市",
			qu = "乌尔禾区",
		},
		[3414]=
		{
			id = 3414,
			code = 652100,
			name = "新疆维吾尔自治区",
			city = "吐鲁番地区",
		},
		[3415]=
		{
			id = 3415,
			code = 652101,
			name = "新疆维吾尔自治区",
			city = "吐鲁番地区",
			qu = "吐鲁番市",
		},
		[3416]=
		{
			id = 3416,
			code = 652122,
			name = "新疆维吾尔自治区",
			city = "吐鲁番地区",
			qu = "鄯善县",
		},
		[3417]=
		{
			id = 3417,
			code = 652123,
			name = "新疆维吾尔自治区",
			city = "吐鲁番地区",
			qu = "托克逊县",
		},
		[3418]=
		{
			id = 3418,
			code = 652200,
			name = "新疆维吾尔自治区",
			city = "哈密地区",
		},
		[3419]=
		{
			id = 3419,
			code = 652201,
			name = "新疆维吾尔自治区",
			city = "哈密地区",
			qu = "哈密市",
		},
		[3420]=
		{
			id = 3420,
			code = 652222,
			name = "新疆维吾尔自治区",
			city = "哈密地区",
			qu = "巴里坤哈萨克自治县",
		},
		[3421]=
		{
			id = 3421,
			code = 652223,
			name = "新疆维吾尔自治区",
			city = "哈密地区",
			qu = "伊吾县",
		},
		[3422]=
		{
			id = 3422,
			code = 652300,
			name = "新疆维吾尔自治区",
			city = "昌吉回族自治州",
		},
		[3423]=
		{
			id = 3423,
			code = 652301,
			name = "新疆维吾尔自治区",
			city = "昌吉回族自治州",
			qu = "昌吉市",
		},
		[3424]=
		{
			id = 3424,
			code = 652302,
			name = "新疆维吾尔自治区",
			city = "昌吉回族自治州",
			qu = "阜康市",
		},
		[3425]=
		{
			id = 3425,
			code = 652323,
			name = "新疆维吾尔自治区",
			city = "昌吉回族自治州",
			qu = "呼图壁县",
		},
		[3426]=
		{
			id = 3426,
			code = 652324,
			name = "新疆维吾尔自治区",
			city = "昌吉回族自治州",
			qu = "玛纳斯县",
		},
		[3427]=
		{
			id = 3427,
			code = 652325,
			name = "新疆维吾尔自治区",
			city = "昌吉回族自治州",
			qu = "奇台县",
		},
		[3428]=
		{
			id = 3428,
			code = 652327,
			name = "新疆维吾尔自治区",
			city = "昌吉回族自治州",
			qu = "吉木萨尔县",
		},
		[3429]=
		{
			id = 3429,
			code = 652328,
			name = "新疆维吾尔自治区",
			city = "昌吉回族自治州",
			qu = "木垒哈萨克自治县",
		},
		[3430]=
		{
			id = 3430,
			code = 652700,
			name = "新疆维吾尔自治区",
			city = "博尔塔拉蒙古自治州",
		},
		[3431]=
		{
			id = 3431,
			code = 652701,
			name = "新疆维吾尔自治区",
			city = "博尔塔拉蒙古自治州",
			qu = "博乐市",
		},
		[3432]=
		{
			id = 3432,
			code = 652722,
			name = "新疆维吾尔自治区",
			city = "博尔塔拉蒙古自治州",
			qu = "精河县",
		},
		[3433]=
		{
			id = 3433,
			code = 652723,
			name = "新疆维吾尔自治区",
			city = "博尔塔拉蒙古自治州",
			qu = "温泉县",
		},
		[3434]=
		{
			id = 3434,
			code = 652800,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
		},
		[3435]=
		{
			id = 3435,
			code = 652801,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "库尔勒市",
		},
		[3436]=
		{
			id = 3436,
			code = 652822,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "轮台县",
		},
		[3437]=
		{
			id = 3437,
			code = 652823,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "尉犁县",
		},
		[3438]=
		{
			id = 3438,
			code = 652824,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "若羌县",
		},
		[3439]=
		{
			id = 3439,
			code = 652825,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "且末县",
		},
		[3440]=
		{
			id = 3440,
			code = 652826,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "焉耆回族自治县",
		},
		[3441]=
		{
			id = 3441,
			code = 652827,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "和静县",
		},
		[3442]=
		{
			id = 3442,
			code = 652828,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "和硕县",
		},
		[3443]=
		{
			id = 3443,
			code = 652829,
			name = "新疆维吾尔自治区",
			city = "巴音郭楞蒙古自治州",
			qu = "博湖县",
		},
		[3444]=
		{
			id = 3444,
			code = 652900,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
		},
		[3445]=
		{
			id = 3445,
			code = 652901,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "阿克苏市",
		},
		[3446]=
		{
			id = 3446,
			code = 652922,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "温宿县",
		},
		[3447]=
		{
			id = 3447,
			code = 652923,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "库车县",
		},
		[3448]=
		{
			id = 3448,
			code = 652924,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "沙雅县",
		},
		[3449]=
		{
			id = 3449,
			code = 652925,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "新和县",
		},
		[3450]=
		{
			id = 3450,
			code = 652926,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "拜城县",
		},
		[3451]=
		{
			id = 3451,
			code = 652927,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "乌什县",
		},
		[3452]=
		{
			id = 3452,
			code = 652928,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "阿瓦提县",
		},
		[3453]=
		{
			id = 3453,
			code = 652929,
			name = "新疆维吾尔自治区",
			city = "阿克苏地区",
			qu = "柯坪县",
		},
		[3454]=
		{
			id = 3454,
			code = 653000,
			name = "新疆维吾尔自治区",
			city = "克孜勒苏柯尔克孜自治州",
		},
		[3455]=
		{
			id = 3455,
			code = 653001,
			name = "新疆维吾尔自治区",
			city = "克孜勒苏柯尔克孜自治州",
			qu = "阿图什市",
		},
		[3456]=
		{
			id = 3456,
			code = 653022,
			name = "新疆维吾尔自治区",
			city = "克孜勒苏柯尔克孜自治州",
			qu = "阿克陶县",
		},
		[3457]=
		{
			id = 3457,
			code = 653023,
			name = "新疆维吾尔自治区",
			city = "克孜勒苏柯尔克孜自治州",
			qu = "阿合奇县",
		},
		[3458]=
		{
			id = 3458,
			code = 653024,
			name = "新疆维吾尔自治区",
			city = "克孜勒苏柯尔克孜自治州",
			qu = "乌恰县",
		},
		[3459]=
		{
			id = 3459,
			code = 653100,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
		},
		[3460]=
		{
			id = 3460,
			code = 653101,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "喀什市",
		},
		[3461]=
		{
			id = 3461,
			code = 653121,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "疏附县",
		},
		[3462]=
		{
			id = 3462,
			code = 653122,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "疏勒县",
		},
		[3463]=
		{
			id = 3463,
			code = 653123,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "英吉沙县",
		},
		[3464]=
		{
			id = 3464,
			code = 653124,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "泽普县",
		},
		[3465]=
		{
			id = 3465,
			code = 653125,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "莎车县",
		},
		[3466]=
		{
			id = 3466,
			code = 653126,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "叶城县",
		},
		[3467]=
		{
			id = 3467,
			code = 653127,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "麦盖提县",
		},
		[3468]=
		{
			id = 3468,
			code = 653128,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "岳普湖县",
		},
		[3469]=
		{
			id = 3469,
			code = 653129,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "伽师县",
		},
		[3470]=
		{
			id = 3470,
			code = 653130,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "巴楚县",
		},
		[3471]=
		{
			id = 3471,
			code = 653131,
			name = "新疆维吾尔自治区",
			city = "喀什地区",
			qu = "塔什库尔干塔吉克自治县",
		},
		[3472]=
		{
			id = 3472,
			code = 653200,
			name = "新疆维吾尔自治区",
			city = "和田地区",
		},
		[3473]=
		{
			id = 3473,
			code = 653201,
			name = "新疆维吾尔自治区",
			city = "和田地区",
			qu = "和田市",
		},
		[3474]=
		{
			id = 3474,
			code = 653221,
			name = "新疆维吾尔自治区",
			city = "和田地区",
			qu = "和田县",
		},
		[3475]=
		{
			id = 3475,
			code = 653222,
			name = "新疆维吾尔自治区",
			city = "和田地区",
			qu = "墨玉县",
		},
		[3476]=
		{
			id = 3476,
			code = 653223,
			name = "新疆维吾尔自治区",
			city = "和田地区",
			qu = "皮山县",
		},
		[3477]=
		{
			id = 3477,
			code = 653224,
			name = "新疆维吾尔自治区",
			city = "和田地区",
			qu = "洛浦县",
		},
		[3478]=
		{
			id = 3478,
			code = 653225,
			name = "新疆维吾尔自治区",
			city = "和田地区",
			qu = "策勒县",
		},
		[3479]=
		{
			id = 3479,
			code = 653226,
			name = "新疆维吾尔自治区",
			city = "和田地区",
			qu = "于田县",
		},
		[3480]=
		{
			id = 3480,
			code = 653227,
			name = "新疆维吾尔自治区",
			city = "和田地区",
			qu = "民丰县",
		},
		[3481]=
		{
			id = 3481,
			code = 654000,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
		},
		[3482]=
		{
			id = 3482,
			code = 654002,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "伊宁市",
		},
		[3483]=
		{
			id = 3483,
			code = 654003,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "奎屯市",
		},
		[3484]=
		{
			id = 3484,
			code = 654021,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "伊宁县",
		},
		[3485]=
		{
			id = 3485,
			code = 654022,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "察布查尔锡伯自治县",
		},
		[3486]=
		{
			id = 3486,
			code = 654023,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "霍城县",
		},
		[3487]=
		{
			id = 3487,
			code = 654024,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "巩留县",
		},
		[3488]=
		{
			id = 3488,
			code = 654025,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "新源县",
		},
		[3489]=
		{
			id = 3489,
			code = 654026,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "昭苏县",
		},
		[3490]=
		{
			id = 3490,
			code = 654027,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "特克斯县",
		},
		[3491]=
		{
			id = 3491,
			code = 654028,
			name = "新疆维吾尔自治区",
			city = "伊犁哈萨克自治州",
			qu = "尼勒克县",
		},
		[3492]=
		{
			id = 3492,
			code = 654200,
			name = "新疆维吾尔自治区",
			city = "塔城地区",
		},
		[3493]=
		{
			id = 3493,
			code = 654201,
			name = "新疆维吾尔自治区",
			city = "塔城地区",
			qu = "塔城市",
		},
		[3494]=
		{
			id = 3494,
			code = 654202,
			name = "新疆维吾尔自治区",
			city = "塔城地区",
			qu = "乌苏市",
		},
		[3495]=
		{
			id = 3495,
			code = 654221,
			name = "新疆维吾尔自治区",
			city = "塔城地区",
			qu = "额敏县",
		},
		[3496]=
		{
			id = 3496,
			code = 654223,
			name = "新疆维吾尔自治区",
			city = "塔城地区",
			qu = "沙湾县",
		},
		[3497]=
		{
			id = 3497,
			code = 654224,
			name = "新疆维吾尔自治区",
			city = "塔城地区",
			qu = "托里县",
		},
		[3498]=
		{
			id = 3498,
			code = 654225,
			name = "新疆维吾尔自治区",
			city = "塔城地区",
			qu = "裕民县",
		},
		[3499]=
		{
			id = 3499,
			code = 654226,
			name = "新疆维吾尔自治区",
			city = "塔城地区",
			qu = "和布克赛尔蒙古自治县",
		},
		[3500]=
		{
			id = 3500,
			code = 654300,
			name = "新疆维吾尔自治区",
			city = "阿勒泰地区",
		},
		[3501]=
		{
			id = 3501,
			code = 654301,
			name = "新疆维吾尔自治区",
			city = "阿勒泰地区",
			qu = "阿勒泰市",
		},
		[3502]=
		{
			id = 3502,
			code = 654321,
			name = "新疆维吾尔自治区",
			city = "阿勒泰地区",
			qu = "布尔津县",
		},
		[3503]=
		{
			id = 3503,
			code = 654322,
			name = "新疆维吾尔自治区",
			city = "阿勒泰地区",
			qu = "富蕴县",
		},
		[3504]=
		{
			id = 3504,
			code = 654323,
			name = "新疆维吾尔自治区",
			city = "阿勒泰地区",
			qu = "福海县",
		},
		[3505]=
		{
			id = 3505,
			code = 654324,
			name = "新疆维吾尔自治区",
			city = "阿勒泰地区",
			qu = "哈巴河县",
		},
		[3506]=
		{
			id = 3506,
			code = 654325,
			name = "新疆维吾尔自治区",
			city = "阿勒泰地区",
			qu = "青河县",
		},
		[3507]=
		{
			id = 3507,
			code = 654326,
			name = "新疆维吾尔自治区",
			city = "阿勒泰地区",
			qu = "吉木乃县",
		},
		[3508]=
		{
			id = 3508,
			code = 659000,
			name = "新疆维吾尔自治区",
			city = "自治区直辖县级行政单位",
		},
		[3509]=
		{
			id = 3509,
			code = 659001,
			name = "新疆维吾尔自治区",
			city = "自治区直辖县级行政单位",
			qu = "石河子市",
		},
		[3510]=
		{
			id = 3510,
			code = 659002,
			name = "新疆维吾尔自治区",
			city = "自治区直辖县级行政单位",
			qu = "阿拉尔市",
		},
		[3511]=
		{
			id = 3511,
			code = 659003,
			name = "新疆维吾尔自治区",
			city = "自治区直辖县级行政单位",
			qu = "图木舒克市",
		},
		[3512]=
		{
			id = 3512,
			code = 659004,
			name = "新疆维吾尔自治区",
			city = "自治区直辖县级行政单位",
			qu = "五家渠市",
		},
		[3513]=
		{
			id = 3513,
			code = 710000,
			name = "台湾省",
		},
		[3514]=
		{
			id = 3514,
			code = 810000,
			name = "香港特别行政区",
		},
		[3515]=
		{
			id = 3515,
			code = 820000,
			name = "澳门特别行政区",
		},
	},
}