-- 创建时间:2018-09-04

return
{
	config_num=
	{
		-- 开始展示比赛 9.20 00:00
		beginTime=1537372800,
		-- 结束展示比赛 10.10 00:00
		endTime=1539100800,

		--海选赛晋级人数
		sea_advance_num = 1,
		--复赛晋级人数
		rematch_advance_num = 54,
	},
	config_txt = {
		--复赛结束后结算界面提示给玩家的文字
		rematch_hint = [[您已获得复赛资格，离大奖又进了一步(复赛奖励在28号00:10邮件发送)
		复赛将在<color=yellow>9月28号 20：00 </color>开启，祝您再创佳绩！]],
		--决赛结束后结算界面提示给玩家的文字
		finals_hint = [[您已获得决赛资格，离大奖又进了一步
		决赛将在<color=yellow>10月1号 14：00 </color>资阳西南电商城举行，
		请在10:00~12:00凭决赛门票报名签到，真人对战，参赛就有现金奖。]],
		--绑定手机的提示
		binding_phone = [[提示:绑定手机便于领取比赛奖励]],
		--大厅显示的比赛时间的文字
		time_txt = [[2018.09.26 12:00 -- 2018.10.01 14:00]],
		--复赛没有门票点击报名弹窗中的文字
		rematch_not_tireck_hint = [[你缺少复赛门票，无法报名
		更多比赛奖励等你来拿，是否立即报名？]]
	},
	config_tips = {
		[1] = "海选赛：9月26日12:00~9月27日24:00 ",
		[2] = "复赛：9月28日20:00 ~21:00",
		[3] = [[决赛：10月1日10:00~12:00报名，14:00开赛（决赛在资阳西南电商城举行，凭决赛门票入场，
		参赛就有现金和实物大奖，更有超级现金大奖等你来拿！）]],
		--复赛晋级后点击按钮反馈的tips
		finals_gaming_tips = [[决赛将在10月1日15:00资阳西南电商城举行，请在10:00~12:00凭决赛门票报名签到！]],
		--取得复赛门票后点击按钮反馈tips
		rematch_tips = [[您已在海选赛晋级并且获得复赛门票，复赛将在9月28日20:00开赛，预祝您再创佳绩！]]
	},

	--城市杯决赛排名
	config_finals_rank = {
		my_rank = {
			rank = nil,
			name = "",
			award = ""
		},
		rank_list = {
			[1] = {rank = 1, name = "待君入席", award = "5000元现金、安岳三宝一箱、公益锦旗",url = ""},
			[2] = {rank = 2, name = "待君入席", award = "3000元现金、安岳三宝一箱、公益锦旗",url = ""},
			[3] = {rank = 3, name = "待君入席", award = "2000元现金、安岳三宝一箱、公益锦旗",url = ""},
			[4] = {rank = 4, name = "待君入席", award = "388元现金、安岳三宝一箱"},
			[5] = {rank = 5, name = "待君入席", award = "388元现金、安岳三宝一箱"},
			[6] = {rank = 6, name = "待君入席", award = "388元现金、安岳三宝一箱"},
			[7] = {rank = 7, name = "待君入席", award = "388元现金、安岳三宝一箱"},
			[8] = {rank = 8, name = "待君入席", award = "388元现金、安岳三宝一箱"},
			[9] = {rank = 9, name = "待君入席", award = "388元现金、安岳三宝一箱"},
			[10] = {rank = 10, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[11] = {rank = 11, name = "待君入席", award = "188元现金、安岳三宝一箱"},			
			[12] = {rank = 12, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[13] = {rank = 13, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[14] = {rank = 14, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[15] = {rank = 15, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[16] = {rank = 16, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[17] = {rank = 17, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[18] = {rank = 18, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[19] = {rank = 19, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[20] = {rank = 20, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[21] = {rank = 21, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[22] = {rank = 22, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[23] = {rank = 23, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[24] = {rank = 24, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[25] = {rank = 25, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[26] = {rank = 26, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[27] = {rank = 27, name = "待君入席", award = "188元现金、安岳三宝一箱"},
			[28] = {rank = 28, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[29] = {rank = 29, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[30] = {rank = 30, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[31] = {rank = 31, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[32] = {rank = 32, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[33] = {rank = 33, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[34] = {rank = 34, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[35] = {rank = 35, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[36] = {rank = 36, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[37] = {rank = 37, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[38] = {rank = 38, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[39] = {rank = 39, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[40] = {rank = 40, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[41] = {rank = 41, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[42] = {rank = 42, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[43] = {rank = 43, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[44] = {rank = 44, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[45] = {rank = 45, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[46] = {rank = 46, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[47] = {rank = 47, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[48] = {rank = 48, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[49] = {rank = 49, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[50] = {rank = 50, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[51] = {rank = 51, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[52] = {rank = 52, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[53] = {rank = 53, name = "待君入席", award = "88元现金、安岳三宝一箱"},
			[54] = {rank = 54, name = "待君入席", award = "88元现金、安岳三宝一箱"},		
			
		}
	}
}


