return {
	config=
	{
		[1]=
		{
			id = 1,
			ID = 1,
			desc = "《第一届鲸鱼杯公益斗地主》海选赛还有%s分钟开始！参赛即有奖，更有现金实物大奖等你来拿！",
			beginTime = 1537933800,
			endTime = 1537934400,
			targetTime = 1537934400,
			isOnOff = 1,
		},
		[2]=
		{
			id = 2,
			ID = 2,
			desc = "《第一届鲸鱼杯公益斗地主》海选赛还有%s分钟结束！还没有晋级的朋友抓紧机会了，\n参赛即有奖，更有现金实物大奖等你来拿！",
			beginTime = 1537927200,
			endTime = 1538064000,
			targetTime = 1538064000,
			isOnOff = 1,
		},
		[3]=
		{
			id = 3,
			ID = 3,
			desc = "《第一届鲸鱼杯公益斗地主》复赛还有%s分钟开启报名！参赛即有奖，更有现金实物大奖等你来拿！",
			beginTime = 1538100000,
			endTime = 1538135400,
			targetTime = 1538135400,
			isOnOff = 1,
		},
		[4]=
		{
			id = 4,
			ID = 4,
			desc = "《第一届鲸鱼杯公益斗地主》复赛离报名截止时间还有%s分钟！还没有报名的朋友抓紧机会了，\n参赛即有奖，更有现金实物大奖等你来拿！",
			beginTime = 1538135460,
			endTime = 1538136000,
			targetTime = 1538136000,
			isOnOff = 1,
		},
	},
}