--
-- Author: lyx
-- Date: 2018/9/10
-- Time: 15:13
-- 说明：游戏管理员列表
--

return 
{
	-- login id => 等级
	["oBzSS0jQ_lCE2a_nzHCSlnJ2NKn8"]=1, -- 隆元线 老兔子
	["oBzSS0uaaaH7-gu4OL9oskrzh4MM"]=1, -- 何威 hewe
	["oBzSS0hv50wjX2RKf0jyCkmRajDo"]=1, -- 杨洋 进击的电饭]煲😏
	["oBzSS0steZdi7_IVBXQxEjyPrLM0"]=1, -- 魏世顺 阿顺

	["105428"]=1, -- 测试用户
	["1024193"]=1, -- 测试用户

	["109908"]=1, -- 何威
	["105801"]=1, -- 刘大铭

	-- ["10443409"]=1, -- 测试用户
	
	["105894"]=1, -- 客服发奖
	["10248791"]=1, -- 测试用户
	["10173139"]=1, -- 测试用户


	["10974693"]=1, -- jf测试用户

	["102141866"]=1, -- jf测试用户

	["106154"]=1, -- jf测试用户
	
}